Repository: sarryteng/lvl4-individual-project
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: A secure boot process ensures that the hardware components of a device can safely use the operating system and programs. It helps prevent unauthorized modifications to the boot process and protects against malware infections.
fr: Un processus de démarrage sécurisé garantit que les composants matériels d'un appareil peuvent utiliser en toute sécurité le système d'exploitation et les programmes. Il aide à prévenir les modifications non autorisées du processus de démarrage et protège contre les infections de logiciels malveillants.

source: 4. What is a secure boot process?
fr: 4. Qu'est-ce qu'un processus de démarrage sécurisé?

source: A method to speed up device startup times.
fr: Une méthode pour accélérer les heures de démarrage des périphériques.

source: A way to connect multiple devices to the internet.
fr: Un moyen de connecter plusieurs appareils à Internet.

source: A process ensuring hardware can safely use operating systems and programs.
fr: Un processus garantissant le matériel peut utiliser en toute sécurité les systèmes d'exploitation et les programmes.

source: A tool to delete unused apps from your phone.
fr: Un outil pour supprimer les applications inutilisées de votre téléphone.

source: Use strong passwords, enable two-factor authentication, and avoid clicking on suspicious links to protect yourself from mobile security threats. Regularly update your mobile device and apps to patch security vulnerabilities and prevent malware infections.
fr: Utilisez des mots de passe solides, activez l'authentification à deux facteurs et évitez de cliquer sur des liens suspects pour vous protéger des menaces de sécurité mobile. Mettez régulièrement à jour votre appareil mobile et vos applications pour corriger les vulnérabilités de sécurité et prévenir les infections des logiciels malveillants.

source: 5. How can you protect yourself from mobile security threats?
fr: 5. Comment pouvez-vous vous protéger des menaces de sécurité mobile?

source: Use strong passwords, enable two-factor authentication, and avoid clicking on suspicious links.
fr: Utilisez des mots de passe solides, activez l'authentification à deux facteurs et évitez de cliquer sur des liens suspects.

source: Disable antivirus software to save battery life.
fr: Désactivez les logiciels antivirus pour sauver la durée de vie de la batterie.

source: Ignore updates for your mobile device.
fr: Ignorez les mises à jour de votre appareil mobile.

source: Download apps only from third-party sources.
fr: Téléchargez les applications uniquement à partir de sources tierces.

source: QUIZ about Password Security
fr: Quiz sur la sécurité du mot de passe

source: Password Security Quiz
fr: Quiz de sécurité du mot de passe

source: Password security is important to prevent cybercriminals from gaining unauthorized access to your accounts. Strong passwords help protect your personal information and sensitive data from being compromised.
fr: La sécurité du mot de passe est importante pour empêcher les cybercriminels de gagner un accès non autorisé à vos comptes. Les mots de passe solides aident à protéger vos informations personnelles et vos données sensibles contre les compromis.

source: 1. Why is password security important?
fr: 1. Pourquoi la sécurité du mot de passe est-elle importante?

source: To prevent cybercriminals from gaining access to your accounts.
fr: Pour empêcher les cybercriminels d'accéder à vos comptes.

source: To make logging in faster.
fr: Pour rendre la journalisation plus rapidement.

source: To allow sharing passwords easily with friends.
fr: Pour permettre le partage de mots de passe facilement avec des amis.

source: To avoid updating passwords regularly.
fr: Pour éviter de mettre à jour régulièrement les mots de passe.

source: A strong password is long, unique, and includes a mix of uppercase letters, lowercase letters, numbers, and symbols. Avoid using common phrases, words, or personal information as passwords.
fr: Un mot de passe fort est long, unique et comprend un mélange de lettres majuscules, de lettres minuscules, de chiffres et de symboles. Évitez d'utiliser des phrases, des mots ou des informations personnelles courantes comme mots de passe.

source: 2. What is a characteristic of a strong password?
fr: 2. Quelle est la caractéristique d'un mot de passe fort?

source: A short, easy-to-remember phrase.
fr: Une phrase courte et facile à penser.

source: A long password with a mix of uppercase, lowercase, numbers, and symbols.
fr: Un long mot de passe avec un mélange de majuscules, de minuscules, de nombres et de symboles.

source: Your pet’s name and birth year.
fr: Le nom de votre animal et l'année de naissance.

source: Your favorite movie title.
fr: Votre titre de film préféré.

source: Cybercriminals can steal passwords through phishing attacks, data breaches, and malware infections. It is important to be cautious and avoid sharing passwords or clicking on suspicious links.
fr: Les cybercriminels peuvent voler des mots de passe par le biais d'attaques de phishing, de violations de données et d'infections de logiciels malveillants. Il est important d'être prudent et d'éviter de partager des mots de passe ou de cliquer sur des liens suspects.

source: 3. How do cybercriminals steal passwords?
fr: 3. Comment les cybercriminels volent-ils les mots de passe?

source: By guessing passwords randomly.
fr: En devinant les mots de passe au hasard.

source: Through phishing, data breaches, and malware.
fr: Par le phishing, les violations de données et les logiciels malveillants.

source: By sharing passwords on social media.
fr: En partageant des mots de passe sur les réseaux sociaux.

source: If your password is exposed in a data breach, you should change the password immediately to prevent unauthorized access to your accounts. Enabling two-factor authentication can add an extra layer of security to your accounts.
fr: Si votre mot de passe est exposé dans une violation de données, vous devez modifier immédiatement le mot de passe pour éviter un accès non autorisé à vos comptes. L'activation de l'authentification à deux facteurs peut ajouter une couche supplémentaire de sécurité à vos comptes.

source: 4. What should you do if your password is exposed in a data breach?
fr: 4. Que devez-vous faire si votre mot de passe est exposé dans une violation de données?

source: Change the exposed password immediately and enable two-factor authentication.
fr: Modifiez immédiatement le mot de passe exposé et activez l'authentification à deux facteurs.

source: Ignore the breach and continue using the same password.
fr: Ignorez la violation et continuez en utilisant le même mot de passe.

source: Share the breach information with your friends.
fr: Partagez les informations sur les violations avec vos amis.

source: Delete your account immediately.
fr: Supprimez votre compte immédiatement.

source: To create a secure password, use a combination of numbers, symbols, uppercase letters, lowercase letters, and make it long and unique. Avoid using common phrases, words, or personal information as passwords.
fr: Pour créer un mot de passe sécurisé, utilisez une combinaison de nombres, de symboles, de lettres majuscules, de lettres minuscules et de la rendre longue et unique. Évitez d'utiliser des phrases, des mots ou des informations personnelles courantes comme mots de passe.

source: 5. How can you create a secure password?
fr: 5. Comment pouvez-vous créer un mot de passe sécurisé?

source: Use your birthdate as a password.
fr: Utilisez votre date de naissance comme mot de passe.

source: Use the same password for all your accounts.
fr: Utilisez le même mot de passe pour tous vos comptes.

source: Use a common phrase or word.
fr: Utilisez une phrase ou un mot commun.

source: Use a password that is long, unique, and includes numbers, symbols, and letters.
fr: Utilisez un mot de passe long, unique et comprend des nombres, des symboles et des lettres.

source: QUIZ about Phishing
fr: Quiz sur le phishing

source: Phishing Quiz
fr: Quiz de phishing

source: Phishing is a cyber threat where scammers impersonate a trustworthy source to steal sensitive data. It often involves sending fake emails or messages that appear to be from legitimate organizations.
fr: Le phishing est une cyber-menace où les escrocs se font passer pour une source de confiance pour voler des données sensibles. Cela implique souvent d'envoyer de faux e-mails ou des messages qui semblent provenir d'organisations légitimes.

source: 1. What is phishing?
fr: 1. Qu'est-ce que le phishing?

source: A cyber threat where scammers impersonate a trustworthy source to steal sensitive data.
fr: Une cyber-menace où les escrocs se font passer pour une source digne de confiance pour voler des données sensibles.

source: A method for encrypting data online.
fr: Une méthode pour chiffrer les données en ligne.

source: A legitimate way to verify identity.
fr: Une façon légitime de vérifier l'identité.

source: A tool used to block spam emails.
fr: Un outil utilisé pour bloquer les e-mails de spam.

source: A phishing link is a fake link used to trick users into revealing sensitive information. It often leads to fake websites that mimic legitimate ones to steal login credentials, financial information, or personal data.
fr: Un lien de phishing est un faux lien utilisé pour inciter les utilisateurs à révéler des informations sensibles. Cela conduit souvent à de faux sites Web qui imitent ceux légitimes pour voler des informations d'identification de connexion, des informations financières ou des données personnelles.

source: 2. What is a phishing link?
fr: 2. Qu'est-ce qu'un lien de phishing?

source: A secure link to reset passwords.
fr: Un lien sécurisé pour réinitialiser les mots de passe.

source: A fake link used to trick users into revealing sensitive information.
fr: Un faux lien utilisé pour inciter les utilisateurs à révéler des informations sensibles.

source: A method for encrypting online communication.
fr: Une méthode pour chiffrer la communication en ligne.

source: A legitimate way to verify email addresses.
fr: Un moyen légitime de vérifier les adresses e-mail.

source: Phishing attacks often involve sending fake emails to steal sensitive data such as login credentials, financial information, or personal details. These emails may appear to be from trusted sources, but they are designed to deceive users into revealing their information.
fr: Les attaques de phishing impliquent souvent l'envoi de faux e-mails pour voler des données sensibles telles que les informations d'identification de connexion, les informations financières ou les informations personnelles. Ces e-mails peuvent sembler provenir de sources de confiance, mais ils sont conçus pour tromper les utilisateurs pour révéler leurs informations.

source: 3. What is an example of a phishing attack?
fr: 3. Quel est un exemple d'attaque de phishing?

source: Sending legitimate promotional emails.
fr: Envoi de courriels promotionnels légitimes.

source: Installing antivirus software.
fr: Installation du logiciel antivirus.

source: Encrypting sensitive files.
fr: Crypter des fichiers sensibles.

source: Sending fake emails to steal sensitive data.
fr: Envoi de faux e-mails pour voler des données sensibles.

source: Whaling is a type of phishing attack that targets high-ranking executives or individuals with access to sensitive information. It aims to deceive these individuals into revealing confidential data or transferring funds to cybercriminals.
fr: La baleine est un type d'attaque de phishing qui cible des cadres de haut rang ou des individus ayant accès à des informations sensibles. Il vise à tromper ces individus à révéler des données confidentielles ou à transférer des fonds aux cybercriminels.

source: 4. What is whaling in phishing?
fr: 4. Qu'est-ce que la chasse à la baleine dans le phishing?

source: A method to stop spam emails.
fr: Une méthode pour arrêter les e-mails de spam.

source: A phishing attack targeting small businesses.
fr: Une attaque de phishing ciblant les petites entreprises.

source: A phishing attack targeting high-ranking executives.
fr: Une attaque de phishing ciblant les cadres de haut rang.

source: A phishing technique to encrypt data.
fr: Une technique de phishing pour chiffrer les données.

source: To protect yourself from phishing attacks, avoid clicking on suspicious links, verify the authenticity of senders, and be cautious when sharing personal information online. It is important to stay informed about common phishing tactics and be vigilant when handling emails or messages.
fr: Pour vous protéger contre les attaques de phishing, évitez de cliquer sur des liens suspects, vérifiez l'authenticité des expéditeurs et soyez prudent lorsque vous partagez des informations personnelles en ligne. Il est important de rester informé des tactiques de phishing courantes et d'être vigilants lors de la gestion des e-mails ou des messages.

source: 5. How can you protect yourself from phishing attacks?
fr: 5. Comment pouvez-vous vous protéger contre les attaques de phishing?

source: Avoid clicking on suspicious links and verify sender authenticity.
fr: Évitez de cliquer sur les liens suspects et de vérifier l'authenticité de l'expéditeur.

source: Share your passwords with trusted friends.
fr: Partagez vos mots de passe avec des amis de confiance.

source: Use the same password for all accounts.
fr: Utilisez le même mot de passe pour tous les comptes.

source: Ignore all emails and messages.
fr: Ignorez tous les e-mails et messages.

source: QUIZ about Software Updates
fr: Quiz sur les mises à jour logicielles

source: Software Updates Quiz
fr: Quiz à mises à jour logicielles

source: Software updates are important because they include security patches that fix vulnerabilities, performance upgrades that optimize code, and other improvements that enhance functionality and compatibility.
fr: Les mises à jour logicielles sont importantes car elles incluent des correctifs de sécurité qui corrigent les vulnérabilités, les mises à niveau des performances qui optimisent le code et d'autres améliorations qui améliorent les fonctionnalités et la compatibilité.

source: 1. What is a software update?
fr: 1. Qu'est-ce qu'une mise à jour logicielle?

source: A new version of a program that includes security patches, performance upgrades, and other improvements.
fr: Une nouvelle version d'un programme qui comprend des correctifs de sécurité, des mises à niveau des performances et d'autres améliorations.

source: A process to delete unused files.
fr: Un processus pour supprimer des fichiers inutilisés.

source: A tool for creating new software applications.
fr: Un outil pour créer de nouvelles applications logicielles.

source: A method to increase screen brightness.
fr: Une méthode pour augmenter la luminosité de l'écran.

source: 2. Why are software updates important?
fr: 2. Pourquoi les mises à jour logicielles sont-elles importantes?

source: To change the appearance of your device.
fr: Pour changer l'apparence de votre appareil.

source: To fix security vulnerabilities, improve performance, and ensure compatibility.
fr: Pour réparer les vulnérabilités de sécurité, améliorer les performances et assurer la compatibilité.

source: To delete old files automatically.
fr: Pour supprimer automatiquement les anciens fichiers.

source: To reduce internet usage.
fr: Pour réduire l'utilisation d'Internet.

source: Software updates improve performance by optimizing code, reducing resource usage, and enhancing compatibility with other programs and devices.
fr: Les mises à jour logicielles améliorent les performances en optimisant le code, en réduisant l'utilisation des ressources et en améliorant la compatibilité avec d'autres programmes et appareils.

source: 3. How do software updates improve performance?
fr: 3. Comment les mises à jour logicielles améliorent-elles les performances?

source: By reducing screen resolution.
fr: En réduisant la résolution d'écran.

source: By disabling unused programs.
fr: En désactivant les programmes inutilisés.

source: By optimizing code and reducing resource usage.
fr: En optimisant le code et en réduisant l'utilisation des ressources.

source: By increasing battery consumption.
fr: En augmentant la consommation de batterie.

source: An operating system update is a new version of the software that includes security patches, performance upgrades, and other improvements to enhance functionality and compatibility.
fr: Une mise à jour du système d'exploitation est une nouvelle version du logiciel qui comprend des correctifs de sécurité, des mises à niveau des performances et d'autres améliorations pour améliorer les fonctionnalités et la compatibilité.

source: 4. What is an operating system update?
fr: 4. Qu'est-ce qu'une mise à jour du système d'exploitation?

source: A new version of an operating system that improves security, performance, and functionality.
fr: Une nouvelle version d'un système d'exploitation qui améliore la sécurité, les performances et les fonctionnalités.

source: A method to install new applications.
fr: Une méthode pour installer de nouvelles applications.

source: A process to delete old operating systems.
fr: Un processus pour supprimer les anciens systèmes d'exploitation.

source: A tool for managing files on a device.
fr: Un outil pour gérer des fichiers sur un appareil.

source: Software updates help protect your data by closing vulnerabilities that hackers could exploit to gain unauthorized access to your files and information.
fr: Les mises à jour logicielles aident à protéger vos données en fermant les vulnérabilités que les pirates pourraient exploiter pour obtenir un accès non autorisé à vos fichiers et informations.

source: 5. How do software updates help protect your data?
fr: 5. Comment les mises à jour logicielles aident-elles à protéger vos données?

source: By making files easier to share.
fr: En rendant les fichiers plus faciles à partager.

source: By deleting unnecessary files.
fr: En supprimant des fichiers inutiles.

source: By increasing internet speed.
fr: En augmentant la vitesse Internet.

source: By closing vulnerabilities that hackers could exploit.
fr: En fermant les vulnérabilités que les pirates pourraient exploiter.

source: QUIZ about Two Factor Authentication
fr: Quiz environ l'authentification de deux facteurs

source: Two Factor Authentication Quiz
fr: Quiz d'authentification à deux facteurs

source: Two-factor authentication (2FA) is a security method that requires two forms of verification to access an account. This typically includes something you know (like a password) and something you have (like a mobile phone). By adding an extra layer of verification, 2FA provides additional protection against unauthorized access.
fr: L'authentification à deux facteurs (2FA) est une méthode de sécurité qui nécessite deux formes de vérification pour accéder à un compte. Cela comprend généralement quelque chose que vous savez (comme un mot de passe) et quelque chose que vous avez (comme un téléphone mobile). En ajoutant une couche supplémentaire de vérification, 2FA offre une protection supplémentaire contre l'accès non autorisé.

source: 1. What is two-factor authentication (2FA)?
fr: 1. Qu'est-ce que l'authentification à deux facteurs (2FA)?

source: A security method requiring two forms of verification to access an account.
fr: Une méthode de sécurité nécessitant deux formes de vérification pour accéder à un compte.

source: A tool for generating passwords.
fr: Un outil pour générer des mots de passe.

source: An app for managing accounts.
fr: Une application pour gérer les comptes.

source: A method for storing passwords securely.
fr: Une méthode pour stocker en toute sécurité les mots de passe.

source: An example of something you have in 2FA is a mobile phone. By using a mobile phone to receive a verification code, you can add an extra layer of security to your account.
fr: Un exemple de quelque chose que vous avez en 2FA est un téléphone portable. En utilisant un téléphone mobile pour recevoir un code de vérification, vous pouvez ajouter une couche supplémentaire de sécurité à votre compte.

source: 2. Which is an example of something you have in 2FA?
fr: 2. Quel est un exemple de quelque chose que vous avez en 2FA?

source: A password.
fr: Un mot de passe.

source: A mobile phone.
fr: Un téléphone mobile.

source: A username.
fr: Un nom d'utilisateur.

source: A fingerprint.
fr: Une empreinte digitale.

source: 2FA improves security by adding an extra layer of verification. By requiring two forms of verification, 2FA makes it more difficult for unauthorized users to access an account, even if they have the password.
fr: 2FA améliore la sécurité en ajoutant une couche supplémentaire de vérification. En nécessitant deux formes de vérification, 2FA rend plus difficile pour les utilisateurs non autorisés d'accéder à un compte, même s'ils ont le mot de passe.

source: 3. How does 2FA improve security?
fr: 3. Comment 2FA améliore-t-il la sécurité?

source: By encrypting passwords.
fr: En chiffrant les mots de passe.

source: By generating stronger passwords.
fr: En générant des mots de passe plus forts.

source: By monitoring account activity.
fr: En surveillant l'activité du compte.

source: By adding an extra layer of verification.
fr: En ajoutant une couche supplémentaire de vérification.

source: An example of a biometric factor in 2FA is a fingerprint scan. By using a fingerprint scan as a form of verification, you can add an extra layer of security to your account.
fr: Un exemple de facteur biométrique en 2FA est un scan d'empreinte digitale. En utilisant une analyse d'empreintes digitales comme une forme de vérification, vous pouvez ajouter une couche supplémentaire de sécurité à votre compte.

source: 4. What is an example of a biometric factor in 2FA?
fr: 4. Quel est un exemple de facteur biométrique en 2FA?

source: A security question.
fr: Une question de sécurité.

source: A fingerprint scan.
fr: Une analyse d'empreintes digitales.

source: An email verification code.
fr: Un code de vérification par e-mail.

source: 2FA is important because it provides additional protection against unauthorized access. By requiring two forms of verification, 2FA makes it more difficult for unauthorized users to access an account, even if they have the password.
fr: 2FA est important car il offre une protection supplémentaire contre l'accès non autorisé. En nécessitant deux formes de vérification, 2FA rend plus difficile pour les utilisateurs non autorisés d'accéder à un compte, même s'ils ont le mot de passe.

source: 5. Why is 2FA important?
fr: 5. Pourquoi 2FA est-il important?

source: It reduces the need for passwords.
fr: Il réduit le besoin de mots de passe.

source: It provides additional protection against unauthorized access.
fr: Il offre une protection supplémentaire contre l'accès non autorisé.

source: It speeds up the login process.
fr: Il accélère le processus de connexion.

source: It eliminates account recovery steps.
fr: Il élimine les étapes de récupération des comptes.

source: QUIZ about VPN
fr: Quiz sur VPN

source: VPN Quiz
fr: Quiz VPN

source: A VPN creates a secure connection between your device and the internet. It encrypts your data and hides your IP address, making it difficult for hackers to access your information.
fr: Un VPN crée une connexion sécurisée entre votre appareil et Internet. Il crypte vos données et masque votre adresse IP, ce qui rend difficile pour les pirates d'accéder à vos informations.

source: 1. What is a VPN?
fr: 1. Qu'est-ce qu'un VPN?

source: A tool that provides privacy and anonymity by creating a private network.
fr: Un outil qui offre une confidentialité et un anonymat en créant un réseau privé.
