Repository: sarryteng/lvl4-individual-project
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Pretty Good Privacy/Multipurpose Internet Extensions (PGP/MIME) is another encryption protocol that can send secure emails. While it provides the same protection as S/MIME, this protocol only uses the recipient’s private and public encryption keys, eliminating the need to use a Certificate Authority (CA), and instead relying on the “web of trust” model.
fr: Assez bonne confidentialité / extensions Internet polyvalents (PGP / MIME) est un autre protocole de cryptage qui peut envoyer des e-mails sécurisés. Bien qu'il offre la même protection que S / MIME, ce protocole utilise uniquement les clés de chiffrement privés et publics du destinataire, éliminant la nécessité d'utiliser une autorité de certificat (CA) et de s'appuyer plutôt sur le modèle «Web of Trust».

source: PGP/MIME provides more control and flexibility concerning how well you want your emails encrypted but sometimes requires a third-party extension.
fr: PGP / MIME offre plus de contrôle et de flexibilité concernant la façon dont vous souhaitez que vos e-mails cryptent mais nécessitent parfois une extension tierce.

source: SSL/TLS/STARTTLS encryption
fr: Cryptage SSL / TLS / StartTLS

source: Secure Sockets Layer/Transport Layer Security is a protocol that uses SSL and TLS (the successor to SSL) to encrypt communications between two devices, including email encryption. This type of encryption does not apply directly to messages and email contents, but to the connection between email servers.
fr: Secure Sockets Layer / Transport Layer Security est un protocole qui utilise SSL et TLS (le successeur de SSL) pour crypter les communications entre deux appareils, y compris le cryptage des e-mails. Ce type de cryptage ne s'applique pas directement aux messages et au contenu des e-mails, mais à la connexion entre les serveurs de messagerie.

source: The sending server signals the receiver to secure the connection during email transmission. This helps prevent snoops from seeing the contents of a message while it’s being sent.
fr: Le serveur d'envoi indique le récepteur pour sécuriser la connexion lors de la transmission des e-mails. Cela aide à empêcher les Snoops de voir le contenu d'un message pendant qu'il est envoyé.

source: LEARN about identity theft
fr: Renseignez-vous sur le vol d'identité

source: What is identity theft?
fr: Qu'est-ce que le vol d'identité?

source: Identity theft is a crime where someone illegally obtains and uses another person’s personal information, usually for financial gain.
fr: Le vol d'identité est un crime où quelqu'un obtient illégalement et utilise les informations personnelles d'une autre personne, généralement à des fins financières.

source: It’s a serious crime that can have devastating effects on victims, including ruined credit, financial loss, and personal distress.
fr: C’est un crime grave qui peut avoir des effets dévastateurs sur les victimes, notamment le crédit en ruine, la perte financière et la détresse personnelle.

source: How does identity theft happen?
fr: Comment le vol d'identité se produit-il?

source: Identity thieves use various methods to steal your information, including:
fr: Les voleurs d'identité utilisent diverses méthodes pour voler vos informations, notamment:

source: Phishing: A scam where fraudsters impersonate a legitimate entity to trick you into revealing your personal information.
fr: Phishing: une arnaque où les fraudeurs se font passer pour une entité légitime pour vous inciter à révéler vos informations personnelles.

source: Mail theft: Thieves may steal personal mail to get sensitive information, like credit card statements or tax returns.
fr: Vol de courrier: les voleurs peuvent voler du courrier personnel pour obtenir des informations sensibles, comme les relevés de carte de crédit ou les déclarations de revenus.

source: Data breaches: Hackers may gain access to online databases that contain personal information.
fr: Violation de données: les pirates peuvent avoir accès aux bases de données en ligne contenant des informations personnelles.

source: Skimming: Fraudsters may use card readers to steal information from your credit or debit cards.
fr: Écrémage: les fraudeurs peuvent utiliser des lecteurs de cartes pour voler des informations de vos cartes de crédit ou de débit.

source: Signs of identity theft
fr: Signes de vol d'identité

source: If you notice any of the following, it could be a sign that your identity has been stolen:
fr: Si vous remarquez l'un des éléments suivants, cela pourrait être un signe que votre identité a été volée:

source: Unexplained charges on your bank or credit card statements.
fr: Frais inexpliqués sur vos relevés de la banque ou de la carte de crédit.

source: Receiving bills or collection notices for items you didn’t purchase.
fr: Recevoir des factures ou des avis de collecte pour les articles que vous n'avez pas achetés.

source: Missing mail or notices that your financial or credit account information has been changed without your consent.
fr: Mail manquant ou note que vos informations de compte financier ou de crédit ont été modifiées sans votre consentement.

source: How to protect yourself from identity theft
fr: Comment se protéger du vol d'identité

source: To protect yourself from identity theft, you can:
fr: Pour vous protéger du vol d'identité, vous pouvez:

source: Use strong, unique passwords for your online accounts.
fr: Utilisez des mots de passe solides et uniques pour vos comptes en ligne.

source: Enable two-factor authentication wherever possible.
fr: Activez l'authentification à deux facteurs dans la mesure du possible.

source: Be cautious of unsolicited requests for personal information via phone, email, or text message.
fr: Soyez prudent des demandes non sollicitées d'informations personnelles par téléphone, e-mail ou SMS.

source: Monitor your bank accounts and credit reports regularly for any unusual activity.
fr: Surveillez régulièrement vos comptes bancaires et vos rapports de crédit pour toute activité inhabituelle.

source: Avoid sharing sensitive information on public Wi-Fi networks.
fr: Évitez de partager des informations sensibles sur les réseaux Wi-Fi publics.

source: What to do if you’re a victim of identity theft?
fr: Que faire si vous êtes victime de vol d'identité?

source: If you become a victim of identity theft, here are the steps to take:
fr: Si vous devenez victime de vol d'identité, voici les étapes à prendre:

source: Report the theft to your bank or credit card company to freeze accounts and protect against further charges.
fr: Signalez le vol à votre banque ou société de carte de crédit pour geler les comptes et protéger contre d'autres frais.

source: Place a fraud alert on your credit report with major credit bureaus (Equifax, Experian, TransUnion).
fr: Placez une alerte de fraude sur votre rapport de crédit avec les principaux bureaux de crédit (Equifax, Experian, TransUnion).

source: File a report with the Federal Trade Commission (FTC) and local law enforcement.
fr: Dépose un rapport auprès de la Federal Trade Commission (FTC) et des forces de l'ordre locales.

source: Monitor your credit reports to ensure the thief has not opened new accounts in your name.
fr: Surveillez vos rapports de crédit pour vous assurer que le voleur n'a pas ouvert de nouveaux comptes à votre nom.

source: LEARN about Malware
fr: En savoir plus sur les logiciels malveillants

source: US Norton Blog - Malware: what it is, how it works, and how to stop it
fr: US Norton Blog - Malware: ce que c'est, comment cela fonctionne et comment l'arrêter

source: What is malware?
fr: Qu'est-ce que les logiciels malveillants?

source: Malware, short for "malicious software," is any kind of software designed to gain access to or damage a computer, usually without the owner's knowledge. Originally, software engineers created malware for experiments and pranks. Eventually, ill-willed individuals found it useful for vandalism and the destruction of targeted machines.
fr: Les logiciels malveillants, abrégés pour «logiciel malveillant», est tout type de logiciel conçu pour accéder ou endommager un ordinateur, généralement à l'insu du propriétaire. À l'origine, les ingénieurs logiciels ont créé des logiciels malveillants pour des expériences et des farces. Finalement, les individus mal tenus l'ont trouvé utile pour le vandalisme et la destruction des machines ciblées.

source: How do you get malware?
fr: Comment obtenir des logiciels malveillants?

source: Users get malware when a hacker infects a device; this process typically follows three general steps:
fr: Les utilisateurs obtiennent des logiciels malveillants lorsqu'un pirate infecte un appareil; Ce processus suit généralement trois étapes générales:

source: A hacker strategically places a malicious link, file, or attachment in front of their victim, potentially as a phishing email or other social engineering scheme.
fr: Un hacker met stratégiquement un lien, un dossier ou une pièce jointe malveillants devant leur victime, potentiellement en tant que courriel de phishing ou autre schéma d'ingénierie sociale.

source: The victim clicks on the infected asset, unknowingly triggering the malware to install onto their device.
fr: La victime clique sur l'actif infecté, déclenchant sans le savoir les logiciels malveillants pour s'installer sur leur appareil.

source: The malware proceeds to steal, compromise, and/or destroy sensitive data stored on the device.
fr: Le malware procède à voler, faire des compromis et / ou détruire des données sensibles stockées sur l'appareil.

source: While you may download many kinds of malware from the internet, some hackers use USB sticks and flash drives to spread malware, because it’s harder for the system to detect infections that way. To avoid this tactic, never insert unfamiliar storage devices into your computer.
fr: Bien que vous puissiez télécharger de nombreux types de logiciels malveillants sur Internet, certains pirates utilisent des bâtons USB et des lecteurs flash pour répandre les logiciels malveillants, car il est plus difficile pour le système de détecter les infections de cette façon. Pour éviter cette tactique, n'insérez jamais de dispositifs de stockage inconnus dans votre ordinateur.

source: Common malware types
fr: Types de logiciels malveillants communs

source: There are many different kinds of malware lurking online. Here are 14 of the most common types of malware seen on the internet:
fr: Il existe de nombreux types de logiciels malveillants qui se cachent en ligne. Voici 14 des types de logiciels malveillants les plus courants sur Internet:

source: Malware Types Pt.1
fr: Types de logiciels malveillants Pt.1

source: These are dangerous pieces of code inserted into a program or application and are often triggered by your actions.
fr: Ce sont des éléments de code dangereux insérés dans un programme ou une application et sont souvent déclenchés par vos actions.

source: Worms
fr: Vers

source: A worm is a type of malware infection that replicates itself and uses system flaws to make its way onto your devices.
fr: Un ver est un type d'infection malveillante qui se reproduit et utilise des défauts du système pour faire son chemin sur vos appareils.

source: This kind of malware can lock, encrypt, and hold your data hostage before destroying your personal files unless you pay a ransom.
fr: Ce type de malware peut verrouiller, crypter et maintenir vos données en otage avant de détruire vos fichiers personnels à moins que vous ne payiez une rançon.

source: To mine cryptocurrency faster, hackers create malware designed to take part of your device’s computing power to mine crypto on its behalf.
fr: Pour exploiter la crypto-monnaie plus rapidement, les pirates créent des logiciels malveillants conçus pour participer à la puissance de calcul de votre appareil pour exploiter la crypto en son nom.

source: Browser hijacker
fr: Pirate de navigateur

source: This form of malware edits your browser's settings to get you to visit certain sites or perform other actions that the hacker wants.
fr: Cette forme de logiciels malveillants modifie les paramètres de votre navigateur pour vous amener à visiter certains sites ou à effectuer d'autres actions que le pirate veut.

source: Malware Types Pt.2
fr: Types de logiciels malveillants Pt.2

source: Trojan
fr: troyen

source: A Trojan imitates legitimate applications or programs to get you to download and unknowingly install malware.
fr: Un Troie imite des applications ou des programmes légitimes pour vous amener à télécharger et à installer sans le savoir les logiciels malveillants.

source: Logic bomb
fr: Bombe logique

source: A logic bomb is a type of malware that waits inside a system until you meet certain conditions or perform specific actions.
fr: Une bombe logique est un type de logiciels malveillants qui attend à l'intérieur d'un système jusqu'à ce que vous remplissiez certaines conditions ou effectuez des actions spécifiques.

source: Scareware
fr: Effrayant

source: Scareware is designed to scare you into performing a specific action, like downloading fake security software.
fr: Scareware est conçu pour vous effrayer pour effectuer une action spécifique, comme le téléchargement de faux logiciels de sécurité.

source: Malvertising
fr: Malvertisation

source: Infected ads loaded with malware download and install malicious programs onto your device after you click on a displayed pop-up.
fr: Des annonces infectées chargées de téléchargement de logiciels malveillants et d'installer des programmes malveillants sur votre appareil après avoir cliqué sur une fenêtre contextuelle affichée.

source: A rootkit is the kind of difficult-to-detect malware that grants hackers complete remote access to your device.
fr: Un rootkit est le type de logiciels malveillants difficiles à détecter qui accorde aux pirates un accès à distance complet à votre appareil.

source: Malware Types Pt.3
fr: Types de logiciels malveillants Pt.3

source: Spyware
fr: Logiciel espion

source: This type of malware secretly tracks and records your activity to learn more about you, and often tries to gain access to data or financial accounts.
fr: Ce type de malware suit et enregistre secrètement votre activité pour en savoir plus sur vous et essaie souvent d'accéder à des données ou à des comptes financiers.

source: Adware
fr: Logiciel publicitaire

source: Taking the form of unwanted pop-ups, this type of malware can track your browsing activity and install other forms of malware like keyloggers or spyware.
fr: Prenant la forme de fenêtres contextuelles indésirables, ce type de logiciels malveillants peut suivre votre activité de navigation et installer d'autres formes de logiciels malveillants comme des keyloggers ou des logiciels espions.

source: These spider-like programs crawl the internet looking for security flaws to exploit by linking a network of infected systems together to further its reach and ability to do damage.
fr: Ces programmes de type araignée explorent Internet à la recherche de défauts de sécurité pour exploiter en liant ensemble un réseau de systèmes infectés pour poursuivre sa portée et sa capacité à faire des dégâts.

source: Fileless malware
fr: MALWOWIQUE EN FILESS

source: By using protocols and software already built into operating systems to infect devices, fileless malware can operate undetected for a long time as it slowly hogs your resources or steals your information.
fr: En utilisant des protocoles et des logiciels déjà intégrés dans les systèmes d'exploitation pour infecter les appareils, les logiciels malveillants sans fil peuvent fonctionner non détectés pendant une longue période car il monte lentement vos ressources ou vole vos informations.

source: LEARN about Mobile Security
fr: Découvrez la sécurité mobile

source: What is mobile security?
fr: Qu'est-ce que la sécurité mobile?

source: Mobile security is a system of security software and habits that keeps your data out of the hands of hackers, scammers, and identity thieves.
fr: La sécurité mobile est un système de logiciels de sécurité et d'habitudes qui empêche vos données de pirates, de fraudeurs et de voleurs d'identité.

source: While it’s tempting to think that only politicians, financial institutions, and big tech companies need enhanced security, everyone needs protection.
fr: Bien qu'il soit tentant de penser que seuls les politiciens, les institutions financières et les grandes entreprises technologiques ont besoin d'une sécurité améliorée, tout le monde a besoin d'une protection.

source: Why mobile security is crucial
fr: Pourquoi la sécurité mobile est cruciale

source: While device manufacturers help you protect your Android and Apple devices and operating systems, it often isn’t enough to fully safeguard your data from attacks by hackers.
fr: Bien que les fabricants d'appareils vous aident à protéger vos appareils Android et Apple et vos systèmes d'exploitation, il ne suffit souvent pas de protéger complètement vos données contre les attaques par des pirates.

source: Cybercriminals don’t discriminate when they create malware to infect the latest computers, phones, and tablets. If they can design a virus that will make its way into the servers of large banks to steal account numbers and passwords, those scammers will also find a way to deploy it against normal people (or they’ll sell it to someone who will).
fr: Les cybercriminels ne font pas de discrimination lorsqu'ils créent des logiciels malveillants pour infecter les derniers ordinateurs, téléphones et tablettes. S'ils peuvent concevoir un virus qui fera son chemin dans les serveurs des grandes banques pour voler les numéros de compte et les mots de passe, ces escrocs trouveront également un moyen de le déployer contre des gens normaux (ou ils le vendront à quelqu'un qui le fera).

source: Mobile security attacks can:
fr: Les attaques de sécurité mobile peuvent:

source: Expose your financial information.
fr: Exposez vos informations financières.

source: Increase the likelihood of identity theft.
fr: Augmentez la probabilité de vol d'identité.

source: Corrupt your files and personal data.
fr: Corrompez vos fichiers et vos données personnelles.

source: Real security means taking extra steps to improve your digital safety habits and using software that recognizes and stops threats before your devices are compromised.
fr: La véritable sécurité signifie prendre des mesures supplémentaires pour améliorer vos habitudes de sécurité numériques et utiliser des logiciels qui reconnaissent et arrêtent les menaces avant que vos appareils ne soient compromis.

source: What Mobile Security Protects
fr: Ce que la sécurité mobile protège

source: 5 examples of mobile security and how they work
fr: 5 exemples de sécurité mobile et comment ils fonctionnent

source: Because the threats posed by malware and hacking are so varied, the systems needed to prevent and stop them are varied, too. When mobile security systems work together, they create a much stronger shield against bad actors than any one system could on its own.
fr: Parce que les menaces posées par les logiciels malveillants et le piratage sont si variées, les systèmes nécessaires pour les prévenir et les arrêter sont également variés. Lorsque les systèmes de sécurité mobile fonctionnent ensemble, ils créent un bouclier beaucoup plus fort contre les mauvais acteurs que n'importe quel système ne le pourrait seul.

source: Some examples of mobile security include:
fr: Certains exemples de sécurité mobile comprennent:

source: to keep your online traffic and data secret. Encrypted information can only be read by those with the decryption key.
fr: Pour garder secrètement votre trafic en ligne et vos données. Les informations chiffrées ne peuvent être lues que par ceux qui ont la clé de décryptage.

source: Secure boot processes
fr: Processus de démarrage sécurisés

source: for safer compliance between hardware and firmware. These security standards ensure that hardware can use operating systems and programs. This prevents dangerous hardware, like a flash drive loaded with malware, from being able to access and run amok within a system.
fr: Pour une conformité plus sûre entre le matériel et le firmware. Ces normes de sécurité garantissent que le matériel peut utiliser les systèmes d'exploitation et les programmes. Cela empêche le matériel dangereux, comme un lecteur flash chargé de logiciels malveillants, de pouvoir accéder et de s'amuser dans un système.

source: Application sandboxing
fr: Boîte de sable d'application

source: to observe and stop the spread of malicious software. Application sandboxing creates a limited environment for code to run. These environments reduce access to resources to observe new programs, recognized threats, and suspicious code. By isolating and observing malware, these systems can learn how it functions and how to protect against it.
fr: pour observer et arrêter la propagation des logiciels malveillants. L'application Sandboxing crée un environnement limité à exécuter du code. Ces environnements réduisent l'accès aux ressources pour observer de nouveaux programmes, des menaces reconnues et un code suspect. En isolant et en observant les logiciels malveillants, ces systèmes peuvent apprendre comment il fonctionne et comment se protéger contre lui.

source: Mobile malware and antivirus software
fr: Logiciels malveillants mobiles et antivirus

source: stop known threats and watch over your devices. Using signature detection to stop known threats along with a form of application sandboxing to contain possible threats, mobile antivirus software helps keep devices free from infection.
fr: Arrêtez des menaces connues et veillez sur vos appareils. L'utilisation de la détection de signature pour arrêter les menaces connues ainsi qu'une forme de sable d'application pour contenir des menaces possibles, le logiciel antivirus mobile aide à garder les appareils exempts d'infection.

source: Network security protocols
fr: Protocoles de sécurité du réseau

source: like HTTPS, let your devices know a connection is safe. These protocols, including SSL certificates, create an encrypted channel for traffic to move safely between trusted devices.
fr: Comme HTTPS, faites savoir à vos appareils qu'une connexion est sûre. Ces protocoles, y compris les certificats SSL, créent un canal crypté pour le trafic pour se déplacer en toute sécurité entre les appareils de confiance.

source: The main threats to mobile security
fr: Les principales menaces à la sécurité mobile

source: What are Mobile Security Threats
fr: Quelles sont les menaces de sécurité mobile

source: These threats present themselves in many different formats, and the people behind them always try to improve their effectiveness. Knowing these dangers, how they impact your mobile data security, and what damage they can do can help you react when these problems arise.
fr: Ces menaces se présentent dans de nombreux formats différents, et les personnes derrière elles essaient toujours d'améliorer leur efficacité. Connaître ces dangers, comment ils ont un impact sur la sécurité des données mobiles et les dommages qu'ils peuvent faire peuvent vous aider à réagir lorsque ces problèmes surviennent.

source: LEARN about password security
fr: En savoir plus sur la sécurité du mot de passe

source: Strong Passwords
fr: Mots de passe forts

source: Why Is Password Security Important?
fr: Pourquoi la sécurité du mot de passe est-elle importante?

source: Why is password security important?
fr: Pourquoi la sécurité du mot de passe est-elle importante?
