Repository: sarryteng/lvl4-individual-project
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Learn
fr: Apprendre

source: Tools
fr: Outils

source: Please select an answer.
fr: Veuillez sélectionner une réponse.

source: Incorrect. The correct answer is {correctAnswer}.
fr: Incorrect. La bonne réponse est {correctAnswer}.

source: Quiz Completed!
fr: Quiz terminé!

source: Your score: {score}/{total}.
fr: Votre score: {score}/{total}.

source: Finish Quiz
fr: Finition quiz

source: Restart Quiz
fr: Redémarrer quiz

source: Here are the Guides
fr: Voici les guides

source: Secure Mobile Devices
fr: Appareils mobiles sécurisés

source: Learn how to protect your mobile devices from threats.
fr: Apprenez à protéger vos appareils mobiles contre les menaces.

source: Encryption
fr: Cryptage

source: Understand how encryption safeguards sensitive information.
fr: Comprendre comment le chiffrement garantit les informations sensibles.

source: Secure Passwords
fr: Mots de passe sécurisés

source: Discover techniques for creating strong, secure passwords.
fr: Découvrez des techniques pour créer des mots de passe solides et sécurisés.

source: 2FA Authentication
fr: Authentification 2FA

source: Learn about two-factor authentication and its benefits.
fr: Découvrez l'authentification à deux facteurs et ses avantages.

source: Phishing Attacks
fr: Attaques de phishing

source: Identify and avoid common phishing attacks.
fr: Identifiez et évitez les attaques de phishing courantes.

source: Software Updates
fr: Mises à jour logicielles

source: Why keeping your software updated is critical.
fr: Pourquoi garder votre logiciel à jour est essentiel.

source: Identity Theft
fr: Vol d'identité

source: Understand how to protect yourself from identity theft.
fr: Comprendre comment vous protéger du vol d'identité.

source: Malware Protection
fr: Protection contre les logiciels malveillants

source: Learn about malware and how to prevent infections.
fr: Découvrez les logiciels malveillants et comment prévenir les infections.

source: Discover the benefits of using a virtual private network.
fr: Découvrez les avantages de l'utilisation d'un réseau privé virtuel.

source: Home - Cybersecurity Resource Hub
fr: Accueil - Cybersecurity Resource Hub

source: Welcome to the Cybersecurity Resource Hub
fr: Bienvenue au Cybersecurity Resource Hub

source: Your go-to source for online safety and cybersecurity information with a primary focus on mobile phones.
fr: Votre source de référence pour les informations de sécurité et de cybersécurité en ligne avec un accent principal sur les téléphones mobiles.

source: In today’s connected world, staying safe online is more important than ever—especially for mobile users. This platform is designed to help users in developing countries navigate the digital landscape securely. Whether you’re new to cybersecurity or want to deepen your knowledge, our resources make it easy to understand and apply essential safety practices.
fr: Dans le monde connecté d'aujourd'hui, rester en sécurité en ligne est plus important que jamais, en particulier pour les utilisateurs mobiles. Cette plate-forme est conçue pour aider les utilisateurs des pays en développement à naviguer en toute sécurité dans le paysage numérique. Que vous soyez nouveau dans la cybersécurité ou que vous souhaitiez approfondir vos connaissances, nos ressources facilitent la compréhension et appliquent des pratiques de sécurité essentielles.

source: What You'll Find Here:
fr: Ce que vous trouverez ici:

source: Explore basic concepts of online safety and cybersecurity. Understand why securing your online activities is crucial.
fr: Explorez les concepts de base de la sécurité en ligne et de la cybersécurité. Comprenez pourquoi la sécurisation de vos activités en ligne est cruciale.

source: Step-by-step instructions on how to protect yourself, from safe browsing habits to mobile security best practices.
fr: Instructions étape par étape sur la façon de vous protéger, des habitudes de navigation sûres aux meilleures pratiques de sécurité mobile.

source: A curated list of free, reliable antivirus and security tools for mobile devices.
fr: Une liste organisée d'outils antivirus et de sécurité gratuits et fiables pour les appareils mobiles.

source: Learn about Cybersecurity Concepts
fr: Découvrez les concepts de cybersécurité

source: Mobile Security
fr: Sécurité mobile

source: Test Yourself!
fr: Testez-vous!

source: Password Security
fr: Sécurité du mot de passe

source: Best Antivirus Software for iPhones
fr: Meilleur logiciel antivirus pour iPhones

source: For more details, visit
fr: Pour plus de détails, visitez

source: Best Antivirus for iPhones
fr: Meilleur antivirus pour iPhones

source: TotalAV Mobile Security
fr: Sécurité mobile Totalav

source: Best antivirus app for iPhone
fr: Meilleure application antivirus pour iPhone

source: Norton Mobile Security for iOS
fr: Sécurité mobile Norton pour iOS

source: User-friendly iPhone antivirus
fr: Antivirus iPhone convivial

source: Lightweight antivirus for iPhone with a free plan
fr: Antivirus léger pour iPhone avec un plan gratuit

source: All-around antivirus for iOS
fr: Antivirus polyvalent pour iOS

source: Antivirus for iPhone with exceptional malware detection power
fr: Antivirus pour iPhone avec une puissance de détection de logiciels malveillants exceptionnelle

source: Best Antivirus Software for Android
fr: Meilleur logiciel antivirus pour Android

source: Best Antivirus for Android
fr: Meilleur antivirus pour Android

source: Bitdefender Mobile Security
fr: Bitdefender Sécurité mobile

source: Best antivirus app for Android
fr: Meilleure application antivirus pour Android

source: Avast Mobile Security
fr: Sécurité mobile avast

source: Great free Android antivirus app with low system overhead
fr: Grande application Android antivirus gratuite avec des frais généraux de système faible

source: Norton 360 for Mobile
fr: Norton 360 pour mobile

source: Comprehensive protection
fr: Protection complète

source: McAfee Mobile Security
fr: Sécurité mobile McAfee

source: Mini security suite with a clean interface
fr: Mini-suite de sécurité avec une interface propre

source: ESET Mobile Security
fr: Sécurité mobile ESET

source: Quick and easy scans with slight performance hit
fr: Des analyses rapides et faciles avec un léger coup de performance

source: GUIDE on How To Update Softwares
fr: Guide sur la façon de mettre à jour les logiciels

source: US Norton Blog - Why you should install software updates and operating system updates today
fr: Blog américain Norton - Pourquoi vous devriez installer des mises à jour logicielles et des mises à jour du système d'exploitation aujourd'hui

source: Update software and apps
fr: Mettre à jour les logiciels et les applications

source: How you update software depends on the devices and operating systems you’re using. You can update your software quickly by following the steps we’ve provided for the various platforms below.
fr: La façon dont vous mettez à jour le logiciel dépend des appareils et des systèmes d'exploitation que vous utilisez. Vous pouvez mettre à jour votre logiciel rapidement en suivant les étapes que nous avons fournies pour les différentes plates-formes ci-dessous.

source: Updating software and apps on iOS devices
fr: Mise à jour des logiciels et des applications sur les appareils iOS

source: If you have an iPhone, iPad, Apple Watch, or another device running iOS, your software and applications will be updated in the Apple App Store. You’ll see a red circle with a number in the top right corner of the App Store icon if any of your apps have an important update available.
fr: Si vous avez un iPhone, un iPad, Apple Watch ou un autre appareil exécutant iOS, vos logiciels et applications seront mis à jour dans l'App Store d'Apple. Vous verrez un cercle rouge avec un numéro dans le coin supérieur droit de l'icône de l'App Store si l'une de vos applications a une mise à jour importante disponible.

source: Then, simply:
fr: Ensuite, simplement:

source: Click on the App Store icon.
fr: Cliquez sur l'icône de l'App Store.

source: Click the Update button next to individual apps to begin the process, or click the Install All Updates button to do them all at once.
fr: Cliquez sur le bouton de mise à jour à côté des applications individuelles pour commencer le processus, ou cliquez sur le bouton Installer tous les mises à jour pour les faire tous en même temps.

source: Updating software and apps on Android devices
fr: Mise à jour des logiciels et des applications sur les appareils Android

source: When using Android, you‘ll update most of your applications in the Google Play Store. You can also turn on automatic updates to make sure you’re doing everything possible to protect your Android device.
fr: Lorsque vous utilisez Android, vous mettez à jour la plupart de vos applications dans le Google Play Store. Vous pouvez également activer les mises à jour automatiques pour vous assurer que vous faites tout possible pour protéger votre appareil Android.

source: But to implement updates manually:
fr: Mais pour implémenter les mises à jour manuellement:

source: Open the Google Play Store app.
fr: Ouvrez l'application Google Play Store.

source: Tap the profile icon in the top right.
fr: Appuyez sur l'icône de profil en haut à droite.

source: Tap Manage apps & devices to view apps that have updates available.
fr: Appuyez sur Gérer les applications et les appareils pour afficher les applications qui ont des mises à jour disponibles.

source: Tap Update to start the update.
fr: Appuyez sur la mise à jour pour démarrer la mise à jour.

source: How to update operating systems
fr: Comment mettre à jour les systèmes d'exploitation

source: How you update your operating system also depends on the device you’re using. To make sure you’re running the latest version of your operating system, follow the steps for the different platforms provided below.
fr: La façon dont vous mettez à jour votre système d'exploitation dépend également de l'appareil que vous utilisez. Pour vous assurer que vous exécutez la dernière version de votre système d'exploitation, suivez les étapes des différentes plates-formes ci-dessous.

source: Update iOS devices
fr: Mettre à jour les appareils iOS

source: When using an iOS device, you’ll access your operating system updates through the System Settings. You’ll see a red circle with a number in the top right corner of the System Settings icon if an iOS update is ready to be installed.
fr: Lorsque vous utilisez un appareil iOS, vous accéderez à vos mises à jour du système d'exploitation via les paramètres du système. Vous verrez un cercle rouge avec un numéro dans le coin supérieur droit de l'icône des paramètres du système si une mise à jour iOS est prête à être installée.

source: To get the new version:
fr: Pour obtenir la nouvelle version:

source: Open Settings.
fr: Ouvrir les paramètres.

source: Tap General.
fr: Appuyez sur Général.

source: Tap Software Update.
fr: Appuyez sur la mise à jour du logiciel.

source: Tap the Update Now or Download and Install to install the newest version of Mac iOS.
fr: Appuyez maintenant sur la mise à jour ou téléchargez et installez pour installer la dernière version de Mac iOS.

source: Apple recommends backing up your device before installing an iOS update.
fr: Apple recommande de sauvegarder votre appareil avant d'installer une mise à jour iOS.

source: How to Update iOS
fr: Comment mettre à jour iOS

source: How to update operating systems on Android devices
fr: Comment mettre à jour les systèmes d'exploitation sur les appareils Android

source: When using an Android phone or tablet, you’ll find operating system updates in Settings.
fr: Lorsque vous utilisez un téléphone ou une tablette Android, vous trouverez des mises à jour du système d'exploitation dans les paramètres.

source: To check for, and install, available updates:
fr: Pour vérifier et installer les mises à jour disponibles:

source: Tap About phone.
fr: Appuyez sur le téléphone.

source: Tap Software update or Check now for updates.
fr: Appuyez sur la mise à jour du logiciel ou vérifiez maintenant les mises à jour.

source: Tap Download and install or choose one of the other options to install the OS update later.
fr: Appuyez sur Télécharger et installer ou choisissez l'une des autres options pour installer la mise à jour du système d'exploitation ultérieurement.

source: How to Update Android
fr: Comment mettre à jour Android

source: How to keep software and operating systems updated
fr: Comment tenir les logiciels et les systèmes d'exploitation mis à jour

source: For most modern devices, it’s easy to keep your apps or OS updated. Let’s look at two of the best ways to stay as up to date as possible:
fr: Pour la plupart des appareils modernes, il est facile de tenir vos applications ou votre système d'exploitation. Regardons deux des meilleures façons de rester aussi à jour que possible:

source: Look for notifications: The Apple App Store, the Google Play Store, Android and iOS devices, and Windows and Mac OS computers will tell you when an update is ready for installation. You might receive a push notification, see a flag or bubble on the store or settings icon, or may need to go into the update menu directly.
fr: Recherchez les notifications: l'App Store d'Apple, les appareils Google Play Store, Android et iOS, et les ordinateurs Windows et Mac OS vous diront quand une mise à jour sera prête pour l'installation. Vous pouvez recevoir une notification push, consulter un drapeau ou une bulle sur l'icône du magasin ou des paramètres, ou peut-être avoir besoin d'aller directement dans le menu de mise à jour.

source: Turn on automatic updates: Almost every device will let you turn on automatic updates for apps and operating systems. This process can vary depending on your device, but a good place to look for these settings is in the device settings section or store settings.
fr: Activez les mises à jour automatiques: presque chaque appareil vous permettra d'activer les mises à jour automatiques pour les applications et les systèmes d'exploitation. Ce processus peut varier en fonction de votre appareil, mais un bon endroit pour rechercher ces paramètres est dans la section des paramètres de l'appareil ou les paramètres de stockage.

source: FAQs about software updates
fr: FAQ sur les mises à jour logicielles

source: Have more questions about computer updates? We have answers.
fr: Vous avez plus de questions sur les mises à jour informatiques? Nous avons des réponses.

source: What happens if I don’t update my software?
fr: Que se passe-t-il si je ne met pas à jour mon logiciel?

source: If you don’t update your software, you’re at greater risk of system problems, hackers, malware, and compatibility issues. Older versions are usually less efficient, meaning your computer runs slower and may struggle to multitask or handle RAM-heavy tasks like audio or video editing.
fr: Si vous ne mettez pas à jour votre logiciel, vous êtes plus à risque de problèmes système, de pirates, de logiciels malveillants et de problèmes de compatibilité. Les versions plus anciennes sont généralement moins efficaces, ce qui signifie que votre ordinateur est plus lent et peut avoir du mal à effectuer plusieurs tâches ou gérer les tâches lourdes de RAM comme l'édition audio ou vidéo.

source: Are there any risks to updating software?
fr: Y a-t-il des risques pour mettre à jour le logiciel?

source: There are some risks to updating software and operating systems. Any new version of an app or OS is almost certain to contain some security vulnerabilities. And if you have an older device, newer software might malfunction due to new hardware requirements. Even with those potential risks, the security and performance benefits of updated software far outweigh the downsides.
fr: Il existe des risques pour mettre à jour les logiciels et les systèmes d'exploitation. Toute nouvelle version d'une application ou d'un système d'exploitation est presque certain de contenir certaines vulnérabilités de sécurité. Et si vous avez un appareil plus ancien, un logiciel plus récent pourrait mal fonctionner en raison de nouvelles exigences matérielles. Même avec ces risques potentiels, les avantages de la sécurité et des performances des logiciels mis à jour l'emportent de loin sur les inconvénients.

source: How do I know if my software is up to date?
fr: Comment savoir si mon logiciel est à jour?

source: The easiest way to check if your software is up to date is to see if updates are available wherever you normally update your software. This usually means checking for Apple App Store or Google Play store updates. You can also usually find any available updates via your system settings.
fr: Le moyen le plus simple de vérifier si votre logiciel est à jour est de voir si des mises à jour sont disponibles partout où vous mettez normalement à mettre à jour votre logiciel. Cela signifie généralement la vérification des mises à jour Apple App Store ou Google Play Store. Vous pouvez également trouver des mises à jour disponibles via les paramètres de votre système.

source: What is the risk of running outdated software?
fr: Quel est le risque d'exécuter un logiciel obsolète?

source: If you run outdated software, the known vulnerabilities in older versions of apps and operating systems mean you’re at a higher risk of being hacked. Additionally, your phone could run hotter, your device might fall prey to malware, and your computer may not run as smoothly as it could.
fr: Si vous exécutez des logiciels obsolètes, les vulnérabilités connues dans les anciennes versions des applications et des systèmes d'exploitation signifient que vous êtes plus à risque d'être piraté. De plus, votre téléphone peut fonctionner plus chaud, votre appareil peut être prouver aux logiciels malveillants et votre ordinateur peut ne pas fonctionner aussi bien que possible.

source: GUIDE on Malware Detection and Prevention Tips
fr: Guide sur les conseils de détection et de prévention des logiciels malveillants

source: US Norton Blog - How to get rid of iPhone viruses
fr: US Norton Blog - Comment se débarrasser des virus iPhone

source: US Norton Blog - How to remove a virus from an Android phone
fr: US Norton Blog - Comment supprimer un virus d'un téléphone Android

source: How to check for viruses on your iPhone
fr: Comment vérifier les virus sur votre iPhone

source: If your iPhone is acting unusually, it's important to determine if these behaviors are typical signs of a virus. It's possible that other factors, like hardware issues or bugs in the iOS operating system or an app, might be the culprit. In that case, a simple software update could help fix the issue.
fr: Si votre iPhone agit inhabituellement, il est important de déterminer si ces comportements sont des signes typiques d'un virus. Il est possible que d'autres facteurs, comme les problèmes matériels ou les bogues dans le système d'exploitation iOS ou une application, soient le coupable. Dans ce cas, une simple mise à jour logicielle pourrait aider à résoudre le problème.

source: But, if your iPhone shows common virus symptoms, that’s a signal that you could be dealing with a malware infection. Here’s what to look out for:
fr: Mais, si votre iPhone présente des symptômes de virus courants, c'est un signal que vous pourriez faire face à une infection de logiciels malveillants. Voici ce qu'il faut rechercher:

source: Phone performance
fr: Performance du téléphone

source: If your iPhone's apps frequently crash or the device shuts down unexpectedly, a virus might be disrupting your phone's operations. That interference could affect task processing and negatively impact app functionality.
fr: Si les applications de votre iPhone se bloquent fréquemment ou si l'appareil s'arrête de manière inattendue, un virus pourrait perturber les opérations de votre téléphone. Cette interférence pourrait affecter le traitement des tâches et un impact négatif sur la fonctionnalité de l'application.

source: Viruses also strain your phone’s processor and memory with additional tasks, hindering the efficient operation of other apps. That extra workload can lead to increased power consumption and can cause your device to overheat and the battery to drain more quickly.
fr: Les virus essaient également le processeur et la mémoire de votre téléphone avec des tâches supplémentaires, ce qui entrave le fonctionnement efficace des autres applications. Cette charge de travail supplémentaire peut entraîner une augmentation de la consommation d'énergie et peut provoquer une surchauffe de votre appareil et la batterie s'écouler plus rapidement.

source: Data usage
fr: Utilisation des données

source: Malware on your iPhone can exploit your data connection for malicious activities. That may involve hijacking data-intensive apps, covertly downloading harmful code, or funneling your private information to other sources.
fr: Les logiciels malveillants sur votre iPhone peuvent exploiter votre connexion de données pour des activités malveillantes. Cela peut impliquer le détournement d'applications à forte intensité de données, le téléchargement secrète de code nocif ou la canalisation de vos informations privées vers d'autres sources.

source: Such actions can lead to a significant increase in your mobile data usage. That excess data usage may cause you to exceed your data limit and lead to a higher phone bill.
fr: Ces actions peuvent entraîner une augmentation significative de votre utilisation des données mobiles. Cette utilisation excessive de données peut vous faire dépasser votre limite de données et conduire à une facture de téléphone plus élevée.

source: Third-party software
fr: Logiciel tiers

source: Discovering an unfamiliar app on your iPhone could indicate malware. Even if you installed the app, issues that emerge after installation could signal trouble. That is particularly true for apps from third-party sources or if your phone is jailbroken. Jailbreaking allows you to install apps outside of iOS's secured ecosystem, which can increase the risk of virus exposure.
fr: Découvrir une application inconnue sur votre iPhone pourrait indiquer des logiciels malveillants. Même si vous avez installé l'application, les problèmes qui émergent après l'installation pourraient signaler des problèmes. Cela est particulièrement vrai pour les applications provenant de sources tierces ou si votre téléphone est jailbreaké. Jailbreaking vous permet d'installer des applications en dehors de l'écosystème sécurisé d'iOS, ce qui peut augmenter le risque d'exposition au virus.

source: But even malicious apps have snuck into Apple’s App Store. If you notice persistent pop-ups or other suspicious app behavior, that may be a sign that malicious third-party software has infiltrated your iPhone.
fr: Mais même les applications malveillantes se sont glissées dans l'App Store d'Apple. Si vous remarquez des fenêtres contextuelles persistantes ou un autre comportement de l'application suspecte, cela peut être un signe que les logiciels tiers malveillants ont infiltré votre iPhone.

source: Scan for viruses
fr: Scarn for Virus
