Repository: sarryteng/lvl4-individual-project
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: What is the strongest 2FA method?
fr: Quelle est la méthode 2FA la plus forte?

source: Hardware-based 2FA is the strongest form of 2FA verification. Because a physical item is needed, whether it’s a phone, a thumb drive, an ID card, or another object, it’s much more difficult for a hacker or criminal to access all parts of 2FA logins.
fr: Le 2FA basé sur le matériel est la forme la plus forte de vérification 2FA. Parce qu'un élément physique est nécessaire, qu'il s'agisse d'un téléphone, d'un lecteur de pouce, d'une carte d'identité ou d'un autre objet, il est beaucoup plus difficile pour un pirate ou un criminel d'accéder à toutes les parties des connexions 2FA.

source: Is MFA better than 2FA?
fr: La MFA est-elle meilleure que 2FA?

source: Multi-factor authentication that uses three or more authentication factors is more secure than 2FA. For most sites, apps, and platforms, 2FA should be secure enough. Groups that have higher security needs (governments, healthcare providers, and financial institutions, for example) may require additional verification factors.
fr: L'authentification multi-facteurs qui utilise trois facteurs d'authentification ou plus est plus sécurisée que 2FA. Pour la plupart des sites, applications et plateformes, 2FA doit être suffisamment sécurisé. Les groupes qui ont des besoins de sécurité plus élevés (gouvernements, prestataires de soins de santé et institutions financières, par exemple) peuvent nécessiter des facteurs de vérification supplémentaires.

source: GUIDE on VPN on Devices
fr: Guide sur VPN sur les appareils

source: US Norton Blog - VPN for smartphones
fr: US Norton Blog - VPN pour les smartphones

source: US Norton Blog - How to use a VPN on an iPhone or iPad in 2024
fr: Blog américain Norton - Comment utiliser un VPN sur un iPhone ou un iPad en 2024

source: Are there smartphones that are equipped with VPN?
fr: Y a-t-il des smartphones équipés de VPN?

source: Some smartphones come with built-in VPN software. These devices let you cloak your activity and have minimal set-up requirements. However, the VPN is restricted to your smartphone. You can't use the same network to protect your computer or tablet, something to keep in mind if you want the ease of connecting to the same service on multiple devices. With external VPN services, you can often choose which network you connect to and customize your choices based on server location.
fr: Certains smartphones sont livrés avec un logiciel VPN intégré. Ces dispositifs vous permettent de masquer votre activité et ont des exigences de configuration minimes. Cependant, le VPN est limité à votre smartphone. Vous ne pouvez pas utiliser le même réseau pour protéger votre ordinateur ou votre tablette, quelque chose à garder à l'esprit si vous souhaitez la facilité de connexion au même service sur plusieurs appareils. Avec les services VPN externes, vous pouvez souvent choisir le réseau auquel vous vous connectez et personnaliser vos choix en fonction de l'emplacement du serveur.

source: How to choose a VPN provider for your smartphone
fr: Comment choisir un fournisseur VPN pour votre smartphone

source: With so many VPN services, knowing where to start can be challenging. Select a VPN app with suitable features to keep your data secure and let you do what you want online. Here’s what to look for when choosing a VPN:
fr: Avec autant de services VPN, savoir par où commencer peut être difficile. Sélectionnez une application VPN avec des fonctionnalités appropriées pour garder vos données sécurisées et vous permettre de faire ce que vous voulez en ligne. Voici ce qu'il faut rechercher lors du choix d'un VPN:

source: Encryption method:
fr: Méthode de chiffrement:

source: A VPN's safety largely depends on the encryption method used to shield your internet traffic. Some of the best VPNs use bank-grade AES 256-bit encryption that's practically uncrackable—it'd take a supercomputer billions of years to brute-force attack it.
fr: La sécurité d'un VPN dépend en grande partie de la méthode de chiffrement utilisée pour protéger votre trafic Internet. Certains des meilleurs VPN utilisent un cryptage AES 256 bits de qualité bancaire qui est pratiquement non recrortable - il prendrait un supercalculateur des milliards d'années pour l'attaquer par force brute.

source: Privacy:
fr: Confidentialité:

source: Some VPNs record your online activity. If maximum privacy is your priority, select a VPN like Norton Secure VPN which has a no-log policy, meaning we don't track or store your online activities.
fr: Certains VPN enregistrent votre activité en ligne. Si le maximum de confidentialité est votre priorité, sélectionnez un VPN comme Norton Secure VPN qui a une politique de non-logarithme, ce qui signifie que nous ne suivons pas ou ne stockons pas vos activités en ligne.

source: Cost:
fr: Coût:

source: With weak security, bandwidth restrictions, and limited server options, free VPN services can bombard you with annoying ads or even sell your data to data brokers. Many of the best premium services offer a free trial to help you find a secure, reliable VPN that meets your needs.
fr: Avec une sécurité faible, des restrictions de bande passante et des options de serveur limitées, les services VPN gratuits peuvent vous bombarder des publicités ennuyeuses ou même vendre vos données aux courtiers de données. Beaucoup des meilleurs services premium offrent un essai gratuit pour vous aider à trouver un VPN sécurisé et fiable qui répond à vos besoins.

source: Usage limitations:
fr: Limites d'utilisation:

source: From monthly download limits to bandwidth restrictions, avoid any iPhone VPN settings that could limit your access. Choose a service that lets you browse freely without usage limitations.
fr: Des limites de téléchargement mensuelles aux restrictions de bande passante, évitez tous les paramètres VPN iPhone qui pourraient limiter votre accès. Choisissez un service qui vous permet de parcourir librement sans limitations d'utilisation.

source: Additional features:
fr: Caractéristiques supplémentaires:

source: Additional VPN configurations and features that can further boost your privacy, security, and user experience include VPN kill switches, ad blockers or firewalls, and multi-device licenses that allow simultaneous connections.
fr: Des configurations et fonctionnalités VPN supplémentaires qui peuvent encore augmenter votre confidentialité, votre sécurité et votre expérience utilisateur incluent des commutateurs de mise à mort VPN, des bloqueurs d'annonces ou des pare-feu et des licences multi-appareils qui permettent des connexions simultanées.

source: Speed:
fr: Vitesse:

source: Increase your download speeds by choosing a VPN that offers a wide range of geo-optimized servers that enable fast, stable connections from around the world.
fr: Augmentez vos vitesses de téléchargement en choisissant un VPN qui offre une large gamme de serveurs géo-optimisés qui permettent des connexions rapides et stables du monde entier.

source: Should you use a free VPN on your smartphone?
fr: Devriez-vous utiliser un VPN gratuit sur votre smartphone?

source: Free options work for some parts of life. But when it comes to your online presence and security, you can't be too careful. Free VPNs may come with drawbacks such as:
fr: Les options gratuites fonctionnent pour certaines parties de la vie. Mais en ce qui concerne votre présence et votre sécurité en ligne, vous ne pouvez pas être trop prudent. Les VPN gratuits peuvent s'accompagner de inconvénients tels que:

source: Security protocols may be limited
fr: Les protocoles de sécurité peuvent être limités

source: Connection can be slow, laggy or entirely unavailable at times, particularly with free VPN services that cap your bandwidth usage
fr: La connexion peut parfois être lente, lame ou entièrement indisponible, en particulier avec les services VPN gratuits qui plafonnent votre utilisation de la bande passante

source: The provider may track your data, and may use it for advertising purposes
fr: Le fournisseur peut suivre vos données et les utiliser à des fins publicitaires

source: You want to select a provider whose quality and security you can trust. Speed is also important, and a paid VPN service may let you enjoy higher connection speeds than a free service, so you don't have to sacrifice speed or bandwidth for security. While free services may track and save your activity, many paid providers offer a no-log guarantee. This means they don't track the sites you visit as you surf the web. Perhaps most importantly, most paid options have strong security protocols so you can surf the web with peace of mind.
fr: Vous souhaitez sélectionner un fournisseur dont vous pouvez faire confiance à la qualité et à la sécurité. La vitesse est également importante, et un service VPN payant peut vous permettre de profiter de vitesses de connexion plus élevées qu'un service gratuit, vous n'avez donc pas à sacrifier la vitesse ou la bande passante pour la sécurité. Bien que les services gratuits puissent suivre et sauver votre activité, de nombreux fournisseurs payants offrent une garantie de non-logarithme. Cela signifie qu'ils ne suivent pas les sites que vous visitez lorsque vous surfez sur le Web. Peut-être plus important encore, la plupart des options payantes ont de solides protocoles de sécurité, vous pouvez donc surfer sur le Web avec la tranquillité d'esprit.

source: LEARN about encryption
fr: Découvrir le chiffrement

source: US Norton Blog - What is encryption? How it works + types of encryption
fr: US Norton Blog - Qu'est-ce que le cryptage? Comment cela fonctionne + types de cryptage

source: What is Encryption?
fr: Qu'est-ce que le cryptage?

source: Encryption is a cybersecurity measure that scrambles plain text so it can only be read by the user who has the secret code, or decryption key.
fr: Le chiffrement est une mesure de cybersécurité qui se précipite en texte brut afin qu'il ne puisse être lu que par l'utilisateur qui a le code secret ou la clé de décryptage.

source: It provides added security for sensitive information.
fr: Il assure une sécurité supplémentaire pour des informations sensibles.

source: Huge amounts of data are managed online and stored in the cloud or on servers with an ongoing connection to the web. It’s nearly impossible to do anything online—from purchasing new office chairs to logging in to your HR portal—without your personal data ending up in an organization’s networked computer system. That’s why it’s crucial to know how to help keep that personal information private.
fr: D'énormes quantités de données sont gérées en ligne et stockées dans le cloud ou sur des serveurs avec une connexion continue avec le Web. Il est presque impossible de faire quoi que ce soit en ligne - de l'achat de nouvelles chaises de bureau pour vous connecter à votre portail RH - sans vos données personnelles se retrouvant dans le système informatique en réseau d'une organisation. C’est pourquoi il est crucial de savoir comment garder ces informations personnelles privées.

source: Encryption plays an essential role in this task.
fr: Le cryptage joue un rôle essentiel dans cette tâche.

source: When to use encryption
fr: Quand utiliser le chiffrement

source: When to Use Encryption
fr: Quand utiliser le chiffrement

source: It’s important to encrypt messages, files, and data exchanged online whenever they contain personal, sensitive, or classified information like:
fr: Il est important de chiffrer les messages, les fichiers et les données échangés en ligne chaque fois qu'ils contiennent des informations personnelles, sensibles ou classifiées comme:

source: Sending an email to your doctor regarding an illness
fr: Envoi d'un e-mail à votre médecin concernant une maladie

source: Entering your financial information to log in to your online bank account
fr: Entrer vos informations financières pour vous connecter à votre compte bancaire en ligne

source: Sharing a confidential report with your employer
fr: Partager un rapport confidentiel avec votre employeur

source: Encryption ensures only the intended recipient can access the information you shared.
fr: Le chiffrement garantit que seul le destinataire prévu peut accéder aux informations que vous avez partagées.

source: How does encryption work?
fr: Comment fonctionne le cryptage?

source: Encryption takes plain text, like a text message or email, and scrambles it into an unreadable format called
fr: Le chiffrement prend du texte brut, comme un message texte ou un e-mail, et le brouille dans un format illisible appelé

source: ciphertext
fr: texte chiffré

source: This helps protect the confidentiality of digital data either stored on computer systems or transmitted through a network like the internet.
fr: Cela permet de protéger la confidentialité des données numériques soit stockées sur des systèmes informatiques, soit transmis via un réseau comme Internet.

source: How Does Encryption Work
fr: Comment fonctionne le cryptage

source: When the intended recipient accesses the message, the information is translated back to its original form. This is called
fr: Lorsque le destinataire prévu accède au message, les informations sont traduites à sa forme d'origine. C'est ce qu'on appelle

source: decryption
fr: décryptage

source: To unlock the message, both the sender and the recipient have to use a “secret”
fr: Pour déverrouiller le message, l'expéditeur et le destinataire doivent utiliser un «secret»

source: encryption key
fr: clé de chiffrement

source: a collection of algorithms that scramble and unscramble data back to a readable format.
fr: Une collection d'algorithmes qui brouillent et décrochent les données dans un format lisible.

source: Types of encryption
fr: Types de cryptage

source: An encryption key is a series of numbers used to encrypt and decrypt data.
fr: Une clé de chiffrement est une série de nombres utilisés pour crypter et déchiffrer les données.

source: Encryption keys are created with algorithms, and each key is random and unique.
fr: Les clés de chiffrement sont créées avec des algorithmes, et chaque clé est aléatoire et unique.

source: There are two main types of encryption systems: symmetric encryption and asymmetric encryption.
fr: Il existe deux principaux types de systèmes de chiffrement: le chiffrement symétrique et le cryptage asymétrique.

source: Here’s how they differ.
fr: Voici comment ils diffèrent.

source: Types of Encryption
fr: Types de cryptage

source: Symmetric encryption
fr: Cryptage symétrique

source: Symmetric encryption uses a single secret password or key to encrypt and decrypt data.
fr: Le cryptage symétrique utilise un mot de passe ou une clé secrète unique pour crypter et déchiffrer les données.

source: The key could be a code or a random string of letters or numbers generated by a random number generator (RNG), which is typically required for banking-grade encryption. Symmetric algorithms are the simplest and most used form of encryption.
fr: La clé peut être un code ou une chaîne aléatoire de lettres ou de nombres générés par un générateur de nombres aléatoires (RNG), qui est généralement requis pour le cryptage de qualité bancaire. Les algorithmes symétriques sont la forme de cryptage la plus simple et la plus utilisée.

source: Symmetric encryption are available in two forms:
fr: Le chiffrement symétrique est disponible sous deux formes:

source: Block algorithms:
fr: Bloquer des algorithmes:

source: Encrypt a group of plain text symbols as one block.
fr: Cryptez un groupe de symboles de texte brut comme un bloc.

source: Stream algorithms:
fr: Algorithmes de flux:

source: Convert one symbol of plain text directly into ciphertext.
fr: Convertissez un symbole du texte brut directement en texte chiffré.

source: Although symmetric encryption has its weak spots, it makes up for them in speed and efficiency. Since only one key is shared between parties—and that key is typically much shorter than with asymmetric encryption—symmetric cryptography is faster to run.
fr: Bien que le cryptage symétrique ait ses points faibles, il les compense en vitesse et en efficacité. Étant donné qu'une seule clé est partagée entre les parties - et cette clé est généralement beaucoup plus courte qu'avec le cryptage asymétrique - la cryptographie symétrique est plus rapide à exécuter.

source: Asymmetric encryption
fr: Cryptage asymétrique

source: Asymmetric encryption—also known as public key cryptography—uses two keys for encryption and decryption. A public key, which is shared among users, can either encrypt or decrypt the data. A private key can also encrypt or decrypt data, but it's not shared among users. The key you choose to encrypt or decrypt depends on the security measure you’re trying to employ:
fr: Le cryptage asymétrique - également connu sous le nom de cryptographie de clé publique - utilise deux clés pour le cryptage et le décryptage. Une clé publique, partagée entre les utilisateurs, peut crypter ou déchiffrer les données. Une clé privée peut également crypter ou décrypter les données, mais elle n'est pas partagée entre les utilisateurs. La clé que vous choisissez de crypter ou de décrypter dépend de la mesure de sécurité que vous essayez d'employer:

source: Encrypting with the public key:
fr: Encryport avec la clé publique:

source: ensures only the intended recipient can use the corresponding private key to decrypt the message, even if the information was breached during transit
fr: S'assure que seul le destinataire prévu peut utiliser la clé privée correspondante pour décrypter le message, même si les informations ont été violées pendant le transit

source: Encrypting with the private key:
fr: Encryport avec la clé privée:

source: allows the recipient of the information to verify the sender’s identity, since they won’t be able to decrypt data that’s been tampered with by an unauthorized user
fr: Permet au destinataire des informations de vérifier l'identité de l'expéditeur, car ils ne pourront pas décrypter des données qui ont été falsifiées par un utilisateur non autorisé

source: Because asymmetric encryption uses two longer keys, it’s much slower and less efficient to run compared to symmetric cryptography. It can even bog down networks and create issues with memory capacity and battery life.
fr: Parce que le cryptage asymétrique utilise deux clés plus longues, il est beaucoup plus lent et moins efficace à exécuter par rapport à la cryptographie symétrique. Il peut même enrager les réseaux et créer des problèmes avec la capacité de la mémoire et la durée de vie de la batterie.

source: However, asymmetric encryption is considered more advanced in terms of security than symmetric cryptography. Both are still in use today—sometimes simultaneously to compensate for the other’s weaknesses.
fr: Cependant, le cryptage asymétrique est considéré comme plus avancé en termes de sécurité que la cryptographie symétrique. Les deux sont encore utilisés aujourd'hui - parfois simultanément pour compenser les faiblesses de l'autre.

source: What is email encryption?
fr: Qu'est-ce que le cryptage par e-mail?

source: Email encryption is a security measure that disguises the contents of an email to protect against sensitive data exposure and ensure only the intended recipient can read it. Email encryption encodes and scrambles the plain text of the email so that any hackers taking a peek will see only unrecognizable nonsense.
fr: Le chiffrement des e-mails est une mesure de sécurité qui déguise le contenu d'un e-mail pour protéger contre l'exposition sensible aux données et s'assurer que seul le destinataire prévu peut le lire. Le cryptage par e-mail code et brouille le texte brut de l'e-mail afin que tous les pirates jetaient un coup d'œil ne verront que des bêtises méconnaissables.

source: Email Encryption
fr: Cryptage par e-mail

source: The importance of email encryption
fr: L'importance du cryptage des e-mails

source: Email encryption helps protect your personal information and communications from being exposed in data breaches and other cyberattacks. Protecting your personal information in emails can also help reduce the likelihood of identity theft.
fr: Le cryptage par e-mail aide à protéger vos informations personnelles et vos communications contre les violations de données et les autres cyberattaques. La protection de vos informations personnelles dans les e-mails peut également aider à réduire la probabilité de vol d'identité.

source: If you send unencrypted emails, you risk hackers intercepting your messages. While a short email catching up with a friend may not have any information a scammer could use to break into your bank accounts or steal your identity, other messages could.
fr: Si vous envoyez des e-mails non cryptés, vous risquez les pirates d'interception de vos messages. Bien qu'un bref e-mail rattrape un ami peut ne pas avoir d'informations qu'un escroc pour pouvoir utiliser pour pénétrer dans vos comptes bancaires ou voler votre identité, d'autres messages pourraient.

source: In 2022 alone, there were more than 21,000 business emails compromised. Using social engineering, scammers accessed business email accounts and used them to steal money, upload malware or spyware, and cause disruptions.
fr: Rien qu'en 2022, plus de 21 000 e-mails commerciaux ont été compromis. En utilisant l'ingénierie sociale, les escrocs ont accédé à des comptes de messagerie commerciaux et les ont utilisés pour voler de l'argent, télécharger des logiciels malveillants ou des logiciels espions et provoquer des perturbations.

source: Types of email encryption
fr: Types de chiffrement des e-mails

source: Understanding how email encryption works is important, and learning about the different types of protocols used for sending safer emails can help you choose the right encryption for them. Multiple email encryption protocols can protect information from unwanted online predators.
fr: Il est important de comprendre comment le cryptage des e-mails est important et l'apprentissage des différents types de protocoles utilisés pour envoyer des e-mails plus sûrs peut vous aider à choisir le bon cryptage pour eux. Plusieurs protocoles de chiffrement par e-mail peuvent protéger les informations contre les prédateurs en ligne indésirables.

source: S/MIME (Secure/Multipurpose) encryption
fr: Cryptage s / mime (sécurisé / polyvalent)

source: Secure/Multipurpose Internet Mail Extension (S/MIME) is an email encryption protocol often built into macOS devices and major web-based email providers like Outlook and Gmail. It uses public key encryption, involving digital certificates issued by a Certificate Authority for verification.
fr: Extension de messagerie Internet sécurisée / polyvalente (S / MIME) est un protocole de chiffrement par e-mail souvent intégré aux appareils MacOS et aux principaux fournisseurs de diffusion Web comme Outlook et Gmail. Il utilise le cryptage des clés publics, impliquant des certificats numériques délivrés par une autorité de certificat de vérification.

source: S/MIME encryption enables the sender to secure messages with these digital certificates. The recipient can then use the provided certificate to verify the safety of the message received, helping to keep their device secure.
fr: Le cryptage S / MIME permet à l'expéditeur de sécuriser les messages avec ces certificats numériques. Le destinataire peut ensuite utiliser le certificat fourni pour vérifier la sécurité du message reçu, contribuant à assurer la sécurité de son appareil.

source: PGP/MIME encryption
fr: Cryptage PGP / mime
