Repository: sarryteng/lvl4-individual-project
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: If you are streaming, gaming, or downloading many files, your ISP may decide to slow down your internet. With a VPN, they won’t be able to do that.
fr: Si vous diffusez, jouez ou téléchargez de nombreux fichiers, votre FAI peut décider de ralentir votre Internet. Avec un VPN, ils ne pourront pas le faire.

source: Secure your VoIP conversations:
fr: Sécurisez vos conversations VoIP:

source: Internet phone calls aren’t always secure, but a VPN means your conversations stay private.
fr: Les appels téléphoniques Internet ne sont pas toujours sécurisés, mais un VPN signifie que vos conversations restent privées.

source: Access the internet safely when traveling:
fr: Accédez à Internet en toute sécurité lorsque vous voyagez:

source: Depending on where you’re at, the internet may not be safe to use, especially if your only internet connection is public. A VPN lets you browse with less worry.
fr: Selon l'endroit où vous êtes, Internet peut ne pas être sûr à utiliser, surtout si votre seule connexion Internet est publique. Un VPN vous permet de parcourir avec moins d'inquiétude.

source: Avoid censorship:
fr: Évitez la censure:

source: Some countries censor the internet. If you’re traveling and need help avoiding censorship, a VPN may help.
fr: Certains pays censurent Internet. Si vous voyagez et que vous avez besoin d'aide pour éviter la censure, un VPN peut vous aider.

source: Improve your gaming experience:
fr: Améliorez votre expérience de jeu:

source: While VPNs can slow your connection a little, they can also create a more stable, secure connection that can improve your gaming experience.
fr: Bien que les VPN puissent ralentir un peu votre connexion, ils peuvent également créer une connexion plus stable et sécurisée qui peut améliorer votre expérience de jeu.

source: Access content:
fr: Contenu d'accès:

source: VPNs let you choose which country your traffic is routed through, which can help you access your favorite content and sites. Make sure VPNs are legal to use wherever you are.
fr: Les VPN vous permettent de choisir le pays dans lequel votre trafic est acheminé, ce qui peut vous aider à accéder à votre contenu et à vos sites préférés. Assurez-vous que les VPN sont légaux à utiliser où que vous soyez.

source: What Can You Do with a VPN
fr: Que pouvez-vous faire avec un VPN

source: Are there any drawbacks to using a VPN?
fr: Y a-t-il des inconvénients à l'utilisation d'un VPN?

source: While most VPNs provide you with a much higher level of cybersecurity than browsing without one, there are a few potential downsides to using a VPN:
fr: Alors que la plupart des VPN vous fournissent un niveau de cybersécurité beaucoup plus élevé que la navigation sans un, il y a quelques inconvénients potentiels à utiliser un VPN:

source: Not all VPNs protect you from cookies on the websites you visit:
fr: Tous les VPN ne vous protègent pas des cookies sur les sites Web que vous visitez:

source: While most cookies are safe, they can introduce vulnerabilities and are used to track your habits.
fr: Bien que la plupart des cookies soient en sécurité, ils peuvent introduire des vulnérabilités et sont utilisés pour suivre vos habitudes.

source: Cybercriminals have hacked VPNs:
fr: Les cybercriminels ont piraté des VPN:

source: Cybercriminals can use zero-day exploits that haven’t been discovered or patched by some VPNs. That’s one reason why it’s essential to download the latest software updates as soon as they’re available.
fr: Les cybercriminels peuvent utiliser des exploits zéro-jours qui n'ont pas été découverts ou corrigés par certains VPN. C’est une des raisons pour lesquelles il est essentiel de télécharger les dernières mises à jour logicielles dès qu’ils sont disponibles.

source: VPNs are not created equally:
fr: Les VPN ne sont pas créés également:

source: VPNs come in many varieties. Some are free, and others have monthly fees. Free VPN services often collect information about you and target you with ads based on your online profile.
fr: Les VPN sont disponibles dans de nombreuses variétés. Certains sont gratuits et d'autres ont des frais mensuels. Les services VPN gratuits collectent souvent des informations vous concernant et vous ciblent avec des annonces en fonction de votre profil en ligne.

source: Some free VPNs sell your data to third parties:
fr: Certains VPN gratuits vendent vos données à des tiers:

source: Free VPN users may have no control over whether or not their data gets sold. Cybercriminals have even set up free VPNs to harvest personal information.
fr: Les utilisateurs VPN gratuits ne peuvent avoir aucun contrôle sur la vente ou non de leurs données. Les cybercriminels ont même mis en place des VPN gratuits pour récolter des informations personnelles.

source: Using a VPN can slow down your internet connection:
fr: L'utilisation d'un VPN peut ralentir votre connexion Internet:

source: While it might not be that noticeable most of the time, you may experience slower download and upload speeds, which can impact your streaming or gaming.
fr: Bien que ce ne soit pas la plupart du temps notable, vous pouvez ressentir des vitesses de téléchargement et de téléchargement plus lentes, ce qui peut avoir un impact sur votre streaming ou votre jeu.

source: QUIZ about Encryption
fr: Quiz sur le chiffrement

source: Encryption Quiz
fr: Quiz de chiffrement

source: Encryption is used to protect sensitive information from unauthorized access. It does not speed up data transmission, reduce storage space, or organize files.
fr: Le chiffrement est utilisé pour protéger les informations sensibles contre l'accès non autorisé. Il n'accélère pas la transmission des données, ne réduit pas l'espace de stockage ni n'organise des fichiers.

source: 1. What is the primary purpose of encryption?
fr: 1. Quel est le principal objectif du cryptage?

source: To speed up data transmission
fr: Pour accélérer la transmission des données

source: To protect sensitive information
fr: Pour protéger les informations sensibles

source: To reduce storage space
fr: Pour réduire l'espace de stockage

source: To organize files
fr: Pour organiser des fichiers

source: Check
fr: Vérifier

source: Ciphertext is the unreadable format created by encryption. Plaintext is the original readable format.
fr: CipherText est le format illisible créé par chiffrement. PlainText est le format lisible d'origine.

source: 2. What is the term for the unreadable format created by encryption?
fr: 2. Quel est le terme pour le format illisible créé par chiffrement?

source: Plaintext
fr: Texte en clair

source: Code text
fr: Texte de code

source: Ciphertext
fr: Texte chiffré

source: Encrypted text
fr: Texte crypté

source: Symmetric encryption uses one key for both encryption and decryption. Asymmetric encryption uses two keys: a public key for encryption and a private key for decryption.
fr: Le cryptage symétrique utilise une clé pour le cryptage et le déchiffrement. Le cryptage asymétrique utilise deux clés: une clé publique pour le chiffrement et une clé privée pour le déchiffrement.

source: 3. What is a key difference between symmetric and asymmetric encryption?
fr: 3. Quelle est une différence clé entre le cryptage symétrique et asymétrique?

source: Symmetric uses one key; asymmetric uses two keys
fr: Symmetric utilise une clé; asymétrique utilise deux clés

source: Asymmetric is faster than symmetric
fr: Asymétrique est plus rapide que symétrique

source: Symmetric encryption is obsolete
fr: Le cryptage symétrique est obsolète

source: Both use public keys
fr: Les deux utilisent des clés publiques

source: S/MIME relies on Certificate Authorities to verify the identity of email senders and recipients. PGP/MIME and SSL/TLS do not use Certificate Authorities.
fr: S / MIME s'appuie sur les autorités du certificat pour vérifier l'identité des expéditeurs de courriels et des destinataires. PGP / MIME et SSL / TLS n'utilisent pas les autorités de certificat.

source: 4. Which type of email encryption relies on Certificate Authorities?
fr: 4. Quel type de chiffrement par e-mail repose sur les autorités de certificat?

source: None of the above
fr: Aucune des réponses ci-dessus

source: Asymmetric encryption is slower and less efficient than symmetric encryption. It does not require a trusted third party, and it can be used for email encryption.
fr: Le cryptage asymétrique est plus lent et moins efficace que le cryptage symétrique. Il ne nécessite pas de tiers de confiance et peut être utilisé pour le cryptage des e-mails.

source: 5. What is the main drawback of asymmetric encryption?
fr: 5. Quel est le principal inconvénient du cryptage asymétrique?

source: It is less secure than symmetric encryption
fr: Il est moins sûr que le cryptage symétrique

source: It requires a trusted third party
fr: Il nécessite un tiers de confiance

source: It is slower and less efficient
fr: Il est plus lent et moins efficace

source: It cannot be used for email encryption
fr: Il ne peut pas être utilisé pour le cryptage des e-mails

source: Previous
fr: Précédent

source: Next
fr: Suivant

source: QUIZ about Identity Theft
fr: Quiz sur le vol d'identité

source: Identity Theft Quiz
fr: Quiz de vol d'identité

source: Identity theft is a crime where someone illegally obtains and uses another person’s personal information. It is not a technique for encrypting sensitive data, a process of authenticating someone’s identity, or a method to improve credit scores.
fr: Le vol d'identité est un crime où quelqu'un obtient illégalement et utilise les informations personnelles d'une autre personne. Ce n'est pas une technique pour chiffrer les données sensibles, un processus d'authentification de l'identité de quelqu'un ou une méthode pour améliorer les scores de crédit.

source: 1. What is identity theft?
fr: 1. Qu'est-ce que le vol d'identité?

source: A crime where someone illegally obtains and uses another person’s personal information.
fr: Un crime où quelqu'un obtient illégalement et utilise les informations personnelles d'une autre personne.

source: A technique for encrypting sensitive data.
fr: Une technique pour chiffrer les données sensibles.

source: A process of authenticating someone’s identity.
fr: Un processus d'authentification de l'identité de quelqu'un.

source: A method to improve credit scores.
fr: Une méthode pour améliorer les scores de crédit.

source: Phishing scams are fraudulent attempts to obtain sensitive information, such as usernames, passwords, and credit card details, by disguising as a trustworthy entity in electronic communication. Using public Wi-Fi, shredding personal documents, and encrypting sensitive data are not common methods used by identity thieves.
fr: Les escroqueries à phishing sont des tentatives frauduleuses pour obtenir des informations sensibles, telles que les noms d'utilisateur, les mots de passe et les détails de la carte de crédit, en déguisant une entité fiable dans la communication électronique. L'utilisation du Wi-Fi public, le déchiquetage des documents personnels et le chiffrement des données sensibles ne sont pas des méthodes courantes utilisées par les voleurs d'identité.

source: 2. Which of the following is a common method used by identity thieves?
fr: 2. Lequel des éléments suivants est une méthode courante utilisée par les voleurs d'identité?

source: Using public Wi-Fi to browse securely.
fr: Utilisation du Wi-Fi public pour parcourir en toute sécurité.

source: Shredding personal documents.
fr: Déchiquetage des documents personnels.

source: Phishing scams to steal sensitive information.
fr: Les escroqueries de phishing pour voler des informations sensibles.

source: Encrypting sensitive data.
fr: Crypter des données sensibles.

source: Unexplained charges on your bank statements can be a sign that your identity has been stolen. Receiving promotional emails, a slow internet connection, and spam messages in your inbox are not direct indicators of identity theft.
fr: Des frais inexpliqués sur vos relevés bancaires peuvent être un signe que votre identité a été volée. La réception des e-mails promotionnels, une connexion Internet lente et des messages de spam dans votre boîte de réception ne sont pas des indicateurs directs de vol d'identité.

source: 3. What is a sign that your identity may have been stolen?
fr: 3. Qu'est-ce qu'un signe que votre identité a peut-être été volée?

source: Receiving promotional emails.
fr: Recevoir des e-mails promotionnels.

source: Unexplained charges on your bank statements.
fr: Frais inexpliqués sur vos relevés bancaires.

source: A slow internet connection.
fr: Une connexion Internet lente.

source: Spam messages in your inbox.
fr: Spam messages dans votre boîte de réception.

source: To protect yourself from identity theft, use strong passwords for your accounts and enable two-factor authentication. Sharing sensitive information over public Wi-Fi, using weak passwords, and ignoring suspicious emails can increase.
fr: Pour vous protéger du vol d'identité, utilisez des mots de passe solides pour vos comptes et activez l'authentification à deux facteurs. Le partage d'informations sensibles sur le Wi-Fi public, l'utilisation de mots de passe faibles et l'ignorer les e-mails suspects peuvent augmenter.

source: 4. How can you protect yourself from identity theft?
fr: 4. Comment pouvez-vous vous protéger du vol d'identité?

source: Sharing sensitive information over public Wi-Fi.
fr: Partage d'informations sensibles sur le Wi-Fi public.

source: Using weak passwords for your accounts.
fr: En utilisant des mots de passe faibles pour vos comptes.

source: Ignoring suspicious emails.
fr: Ignorer les e-mails suspects.

source: Using strong passwords and enabling two-factor authentication.
fr: Utilisation de mots de passe forts et permettant une authentification à deux facteurs.

source: If you become a victim of identity theft, report the theft to your bank and place a fraud alert on your credit report. Sharing your personal information publicly, ignoring the issue, and creating new online accounts immediately are not recommended responses to identity theft.
fr: Si vous devenez victime de vol d'identité, signalez le vol à votre banque et placez une alerte de fraude sur votre rapport de crédit. Le partage de vos informations personnelles publiquement, l'ignorance du problème et la création de nouveaux comptes en ligne immédiatement ne sont pas des réponses recommandées au vol d'identité.

source: 5. What should you do if you become a victim of identity theft?
fr: 5. Que devez-vous faire si vous devenez victime de vol d'identité?

source: Report the theft to your bank and place a fraud alert on your credit report.
fr: Signalez le vol à votre banque et placez une alerte de fraude sur votre rapport de crédit.

source: Share your personal information publicly to alert others.
fr: Partagez publiquement vos informations personnelles pour alerter les autres.

source: Ignore the issue to avoid further stress.
fr: Ignorez le problème pour éviter un stress supplémentaire.

source: Create new online accounts immediately.
fr: Créez immédiatement de nouveaux comptes en ligne.

source: QUIZ about Malware
fr: Quiz sur les logiciels malveillants

source: Malware Quiz
fr: Quiz de logiciels malveillants

source: Malware is a type of software designed to damage or gain unauthorized access to a computer system. It can include viruses, worms, trojans, ransomware, and spyware.
fr: Le malware est un type de logiciel conçu pour endommager ou obtenir un accès non autorisé à un système informatique. Il peut inclure des virus, des vers, des chevaux de Troie, des ransomwares et des logiciels espions.

source: 1. What is malware?
fr: 1. Qu'est-ce que les logiciels malveillants?

source: Malicious software designed to damage or gain access to a computer.
fr: Logiciel malveillant conçu pour endommager ou accéder à un ordinateur.

source: Software used to encrypt sensitive data.
fr: Logiciel utilisé pour chiffrer les données sensibles.

source: A security tool for protecting systems from viruses.
fr: Un outil de sécurité pour protéger les systèmes contre les virus.

source: A harmless prank program created by software engineers.
fr: Un programme de farce inoffensif créé par les ingénieurs logiciels.

source: Malware can spread through malicious links, attachments, or websites. It is important to be cautious and avoid clicking on unknown or suspicious links.
fr: Les logiciels malveillants peuvent se propager à travers des liens malveillants, des pièces jointes ou des sites Web. Il est important d'être prudent et d'éviter de cliquer sur des liens inconnus ou suspects.

source: 2. How can malware typically spread to a user’s device?
fr: 2. Comment les logiciels malveillants peuvent-ils généralement se propager à l'appareil d'un utilisateur?

source: By installing trusted software.
fr: En installant des logiciels de confiance.

source: By using antivirus software.
fr: En utilisant un logiciel antivirus.

source: By clicking on malicious links or attachments.
fr: En cliquant sur des liens ou des pièces jointes malveillantes.

source: By avoiding unknown USB devices.
fr: En évitant les dispositifs USB inconnus.

source: Ransomware is a type of malware that encrypts a user’s data and demands payment for its release. It is important to regularly back up data to prevent data loss in case of a ransomware attack.
fr: Le ransomware est un type de malware qui crypte les données d'un utilisateur et demande le paiement de sa version. Il est important de sauvegarder régulièrement les données pour éviter la perte de données en cas d'attaque de ransomware.

source: 3. What is ransomware?
fr: 3. Qu'est-ce que le ransomware?

source: Malware designed to track your activity secretly.
fr: Malware conçu pour suivre secrètement votre activité.

source: Malware that encrypts your data and demands payment for its release.
fr: Malware qui crypte vos données et demande le paiement de sa version.

source: Software that prevents spam emails.
fr: Logiciel qui empêche les e-mails de spam.

source: A tool for detecting viruses on your computer.
fr: Un outil pour détecter les virus sur votre ordinateur.

source: Spyware is a type of malware that secretly collects information about a user’s activities and sends it to a third party. It is important to use antivirus software and avoid clicking on suspicious links to protect against spyware.
fr: Spyware est un type de malware qui collecte secrètement des informations sur les activités d'un utilisateur et l'envoie à un tiers. Il est important d'utiliser des logiciels antivirus et d'éviter de cliquer sur des liens suspects pour se protéger contre les logiciels espions.

source: 4. What is a common type of malware?
fr: 4. Qu'est-ce qu'un type commun de logiciels malveillants?

source: Firewall
fr: Pare-feu

source: VPN software
fr: Logiciel VPN

source: Cloud storage tools
fr: Outils de stockage cloud

source: To protect yourself from malware, avoid clicking on unknown links or attachments, use antivirus software, and keep your software up to date.
fr: Pour vous protéger des logiciels malveillants, évitez de cliquer sur des liens ou des pièces jointes inconnus, utilisez un logiciel antivirus et gardez votre logiciel à jour.

source: 5. How can you protect yourself from malware?
fr: 5. Comment pouvez-vous vous protéger des logiciels malveillants?

source: Avoid clicking on unknown links or attachments.
fr: Évitez de cliquer sur des liens ou des pièces jointes inconnues.

source: Disable antivirus software to improve performance.
fr: Désactivez les logiciels antivirus pour améliorer les performances.

source: Share your passwords on public forums.
fr: Partagez vos mots de passe sur les forums publics.

source: Ignore software updates to save time.
fr: Ignorez les mises à jour logicielles pour gagner du temps.

source: QUIZ about Mobile Security
fr: Quiz sur la sécurité mobile

source: Mobile Security Quiz
fr: Quiz de sécurité mobile

source: Mobile security refers to the protection of data on mobile devices such as smartphones and tablets. It includes measures to prevent unauthorized access, data breaches, and malware infections on mobile devices.
fr: La sécurité mobile fait référence à la protection des données sur les appareils mobiles tels que les smartphones et les tablettes. Il comprend des mesures pour empêcher l'accès non autorisé, les violations de données et les infections des logiciels malveillants sur les appareils mobiles.

source: 1. What is mobile security?
fr: 1. Qu'est-ce que la sécurité mobile?

source: A system of security software and habits to protect your data from hackers.
fr: Un système de logiciels de sécurité et d'habitudes pour protéger vos données contre les pirates.

source: A method to speed up internet connections on mobile devices.
fr: Une méthode pour accélérer les connexions Internet sur les appareils mobiles.

source: A tool to organize apps on your phone.
fr: Un outil pour organiser des applications sur votre téléphone.

source: An operating system for mobile phones.
fr: Un système d'exploitation pour les téléphones mobiles.

source: Mobile security is important to protect financial information, prevent identity theft, and safeguard personal data. It helps prevent unauthorized access to sensitive information stored on mobile devices.
fr: La sécurité mobile est importante pour protéger les informations financières, prévenir le vol d'identité et protéger les données personnelles. Il aide à prévenir l'accès non autorisé aux informations sensibles stockées sur les appareils mobiles.

source: 2. Why is mobile security important?
fr: 2. Pourquoi la sécurité mobile est-elle importante?

source: To increase the speed of your mobile phone.
fr: Pour augmenter la vitesse de votre téléphone portable.

source: To protect financial information, prevent identity theft, and safeguard personal data.
fr: Pour protéger les informations financières, prévenir le vol d'identité et protéger les données personnelles.

source: To allow all apps to run on your phone.
fr: Pour permettre à toutes les applications d'exécuter sur votre téléphone.

source: To remove advertisements from apps.
fr: Pour supprimer les publicités des applications.

source: Mobile security practices include using strong passwords, enabling two-factor authentication, and avoiding downloading apps from unverified sources. Encryption and antivirus software can help protect your data from unauthorized access and malware infections.
fr: Les pratiques de sécurité mobile incluent l'utilisation de mots de passe forts, l'activation de l'authentification à deux facteurs et la fin de téléchargement des applications à partir de sources non vérifiées. Les logiciels de chiffrement et d'antivirus peuvent aider à protéger vos données contre l'accès non autorisé et les infections des logiciels malveillants.

source: 3. What is an example of mobile security?
fr: 3. Quel est un exemple de sécurité mobile?

source: Downloading apps from unverified sources.
fr: Téléchargement des applications à partir de sources non vérifiées.

source: Disabling security protocols on your device.
fr: Désactiver les protocoles de sécurité sur votre appareil.

source: Avoiding software updates.
fr: Éviter les mises à jour logicielles.

source: Using encryption and antivirus software.
fr: Utilisation du chiffrement et des logiciels antivirus.
