Repository: sarryteng/lvl4-individual-project
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: A device used for internet connection.
fr: Un appareil utilisé pour la connexion Internet.

source: An app for managing files.
fr: Une application pour gérer les fichiers.

source: A VPN hides your IP address and browsing activity, making it difficult for websites and advertisers to track you online.
fr: Un VPN cache votre adresse IP et votre activité de navigation, ce qui rend difficile pour les sites Web et les annonceurs de vous suivre en ligne.

source: 2. What does a VPN hide?
fr: 2. Que se cache un VPN?

source: Your device password.
fr: Le mot de passe de votre appareil.

source: Your social media profiles.
fr: Vos profils de médias sociaux.

source: Your IP address and browsing activity.
fr: Votre adresse IP et votre activité de navigation.

source: Your email contacts.
fr: Vos contacts par e-mail.

source: Using a VPN on public Wi-Fi encrypts your data, preventing hackers from intercepting it and stealing your personal information.
fr: L'utilisation d'un VPN sur le Wi-Fi public crypte vos données, empêchant les pirates de l'intercepter et de voler vos informations personnelles.

source: 3. Why is it important to use a VPN on public Wi-Fi?
fr: 3. Pourquoi est-il important d'utiliser un VPN sur le Wi-Fi public?

source: To improve internet speed.
fr: Pour améliorer la vitesse Internet.

source: To protect your data from hackers.
fr: Pour protéger vos données contre les pirates.

source: To access blocked websites.
fr: Pour accéder aux sites Web bloqués.

source: To avoid spam emails.
fr: Pour éviter les e-mails de spam.

source: VPN encryption secures the data you send and receive, making it unreadable to anyone who intercepts it.
fr: Le chiffrement VPN sécurise les données que vous envoyez et recevez, ce qui la rend illisible à toute personne qui l'intercepte.

source: 4. What does VPN encryption do?
fr: 4. Que fait le cryptage VPN?

source: Saves your browsing history.
fr: Économise votre historique de navigation.

source: Shares your data securely.
fr: Partage vos données en toute sécurité.

source: Deletes unwanted files.
fr: Supprime les fichiers indésirables.

source: Secures the data you send and receive.
fr: Sécurise les données que vous envoyez et recevez.

source: A VPN does not boost your device storage. It provides privacy, security, and access to geo-restricted content.
fr: Un VPN n'améliore pas le stockage de votre appareil. Il offre la confidentialité, la sécurité et l'accès au contenu géo-restreint.

source: 5. Which is NOT a benefit of using a VPN?
fr: 5. Quel n'est pas un avantage d'utiliser un VPN?

source: Boosting your device storage.
fr: Stimulation de stockage de votre appareil.

source: Protecting your privacy.
fr: Protéger votre vie privée.

source: Accessing geo-restricted content.
fr: Accéder au contenu géo-restreint.

source: Securing your online transactions.
fr: Sécuriser vos transactions en ligne.
