Repository: sarryteng/lvl4-individual-project
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Report the identity theft to the FTC at IdentityTheft.gov to get your personal recovery plan or file a police report. You will need proof of one of these if you want to go on to place an extended fraud alert, which lasts seven years.
fr: Signalez le vol d'identité à la FTC sur identitytheft.gov pour obtenir votre plan de reprise personnel ou déposer un rapport de police. Vous aurez besoin de preuve de l'un de ceux-ci si vous voulez continuer à placer une alerte de fraude prolongée, qui dure sept ans.

source: Ways to protect your identity
fr: Façons de protéger votre identité

source: There are several ways that you can help protect your identity from would-be thieves. ​​Here are the key strategies for safeguarding your personal information and helping protect against identity fraud occurring in the first place:
fr: Il existe plusieurs façons de protéger votre identité contre les voleurs potentiels. Voici les stratégies clés pour protéger vos informations personnelles et aider à protéger contre la fraude d'identité survenant en premier lieu:

source: Strengthen passwords and PINs:
fr: Renforcer les mots de passe et les épingles:

source: Use complex and unique passwords for all your online accounts. Avoid using obvious information like birthdays or pet names. Consider a password manager to help you create and manage strong passwords. Turn on two-factor authentication or multi-factor authentication wherever possible.
fr: Utilisez des mots de passe complexes et uniques pour tous vos comptes en ligne. Évitez d'utiliser des informations évidentes comme les anniversaires ou les noms d'animaux. Considérez un gestionnaire de mots de passe pour vous aider à créer et à gérer des mots de passe solides. Activez l'authentification à deux facteurs ou l'authentification multi-facteurs dans la mesure du possible.

source: Be cautious with personal information online:
fr: Soyez prudent avec les informations personnelles en ligne:

source: Don't share sensitive information like credit card details on unsecured websites or in response to unsolicited emails or messages. And think before sharing anything on social media or online, as even seemingly innocent info like your place of birth can be used by identity thieves.
fr: Ne partagez pas d'informations sensibles comme les détails de la carte de crédit sur les sites Web non garantis ou en réponse à des e-mails ou des messages non sollicités. Et réfléchissez avant de partager quoi que ce soit sur les réseaux sociaux ou en ligne, car même des informations apparemment innocentes comme votre lieu de naissance peuvent être utilisées par les voleurs d'identité.

source: Monitor financial accounts regularly:
fr: Surveiller régulièrement les comptes financiers:

source: Regularly review your bank statements and credit card reports for any unauthorized activity. Catching fraudulent charges early can minimize the damage. You can also use a service like Norton™ 360 with LifeLock™ Select to help monitor your credit.
fr: Examinez régulièrement vos relevés bancaires et vos rapports de cartes de crédit pour toute activité non autorisée. La prise de charges frauduleuses précoces peut minimiser les dommages. Vous pouvez également utiliser un service comme Norton ™ 360 avec LifeLock ™ Select pour aider à surveiller votre crédit.

source: Shred sensitive documents:
fr: Documents sensibles déchiquetés:

source: Before discarding documents containing personal information like bank statements or credit card offers, shred them thoroughly and dispose of them in separate loads. This makes it much harder for criminals to steal your information from the trash.
fr: Avant de rejeter les documents contenant des informations personnelles comme les relevés bancaires ou les offres de cartes de crédit, les déchiqueter soigneusement et les éliminer dans des charges distinctes. Cela rend beaucoup plus difficile pour les criminels de voler vos informations à la poubelle.

source: Secure personal devices and networks:
fr: Secure personnelle et réseaux sécurisés:

source: Use a strong password on your home network and keep your devices' software updated so they have the latest security patches. Be cautious when using public Wi-Fi networks and avoid accessing or sending sensitive information on unsecured connections.
fr: Utilisez un mot de passe solide sur votre réseau domestique et gardez le logiciel de vos appareils à jour afin qu'ils aient les derniers correctifs de sécurité. Soyez prudent lorsque vous utilisez des réseaux Wi-Fi publics et évitez d'accéder ou d'envoyer des informations sensibles sur les connexions non garanties.

source: Be skeptical of unsolicited communications:
fr: Être sceptique quant aux communications non sollicitées:

source: Be wary of emails, texts, or phone calls you’re not expecting that request personal information. Don't click suspicious links or attachments, and if you’re unsure about a communication's legitimacy contact the sender directly through a verified channel.
fr: Méfiez-vous des e-mails, des SMS ou des appels téléphoniques que vous ne vous attendez pas à demander des informations personnelles. Ne cliquez pas sur des liens ou des pièces jointes suspectes, et si vous n'êtes pas sûr de la légitimité d'une communication, contactez l'expéditeur directement via un canal vérifié.

source: By following these steps and staying vigilant, you can reduce your risk of identity theft and help protect your personal information.
fr: En suivant ces étapes et en restant vigilant, vous pouvez réduire votre risque de vol d'identité et aider à protéger vos informations personnelles.

source: FAQs about identity theft
fr: FAQ sur le vol d'identité

source: Still have questions about identity theft? We’ve got you covered.
fr: Vous avez encore des questions sur le vol d'identité? Nous vous avons couvert.

source: What should I do if I suspect I'm a victim of identity theft?
fr: Que dois-je faire si je soupçonne que je suis victime de vol d'identité?

source: If you suspect that somebody stole your identity, alert your bank and credit card companies immediately. You should also place a fraud alert or credit freeze on your credit report and notify the authorities that you think your identity has been compromised.
fr: Si vous soupçonnez que quelqu'un a volé votre identité, alerte immédiatement vos sociétés de banque et de carte de crédit. Vous devez également placer une alerte de fraude ou un gel de crédit sur votre rapport de crédit et informer les autorités que vous pensez que votre identité a été compromise.

source: What do you do if someone has stolen your identity?
fr: Que faites-vous si quelqu'un a volé votre identité?

source: Contact the company where you know the fraud took place and speak to the fraud department. Ask them to freeze your account or implement their fraud procedures. Then place a fraud alert or credit freeze on your credit report and file a report at IdentityTheft.gov and with your local law enforcement office. If the theft warrants it, consider contacting the IRS as well as your insurance and medical care providers.
fr: Contactez l'entreprise où vous savez que la fraude a eu lieu et parlez au service de fraude. Demandez-leur de congeler votre compte ou de mettre en œuvre leurs procédures de fraude. Placez ensuite une alerte de fraude ou un gel de crédit sur votre rapport de crédit et déposent un rapport sur identitytheft.gov et avec votre bureau local d'application de la loi. Si le vol le justifie, envisagez de contacter l'IRS ainsi que vos fournisseurs d'assurance et de soins médicaux.

source: Can children be victims of identity theft?
fr: Les enfants peuvent-ils être victimes de vol d'identité?

source: Yes, child identity theft exists. If an ID thief knows your child’s Social Security number, they might use it to open new credit accounts or take out bank loans—and hurt your child’s credit score in the process.
fr: Oui, le vol d'identité des enfants existe. Si un voleur d'identité connaît le numéro de sécurité sociale de votre enfant, il peut l'utiliser pour ouvrir de nouveaux comptes de crédit ou contracter des prêts bancaires et nuire à la cote de crédit de votre enfant dans le processus.

source: Is identity theft punishable by law?
fr: Le vol d'identité est-il punissable par la loi?

source: Absolutely, identity theft is a serious crime with significant consequences for the perpetrators. The penalties for identity theft vary depending on the severity of the crime and the state where it occurs.
fr: Absolument, le vol d'identité est un crime grave avec des conséquences importantes pour les auteurs. Les sanctions pour le vol d'identité varient en fonction de la gravité du crime et de l'État où elle se produit.

source: GUIDE on keeping your mobile secure
fr: Guide sur le maintien de votre mobile sécurisé

source: US Norton Blog - Mobile security: What it is and why you need it
fr: US Norton Blog - Sécurité mobile: ce que c'est et pourquoi vous en avez besoin

source: How to secure mobile devices
fr: Comment sécuriser les appareils mobiles

source: Just as there are many different kinds of threats, there are many ways to reduce the likelihood of your device being impacted by one of them. With a few small changes, you can better secure your digital life and help keep different types of hackers and malware at bay.
fr: Tout comme il existe de nombreux types de menaces, il existe de nombreuses façons de réduire la probabilité que votre appareil soit affecté par l'un d'eux. Avec quelques petits changements, vous pouvez mieux sécuriser votre vie numérique et aider à garder différents types de pirates et de logiciels malveillants à distance.

source: Enable screen locks and biometrics for better in-person security
fr: Activer les verrous d'écran et la biométrie pour une meilleure sécurité en personne

source: Built-in security features should be your first line of defense against physical device tampering and theft. Choose as difficult a passcode as you can easily remember, and don’t reuse any of your codes. Biometrics, like FaceID or fingerprint scanners, create an extra layer of security that is more difficult to hack than a password.
fr: Les fonctionnalités de sécurité intégrées devraient être votre première ligne de défense contre la falsification et le vol des appareils physiques. Choisissez un code d'accès aussi difficile que vous vous en souvenez facilement et ne réutilisez aucun de vos codes. La biométrie, comme les scanners FACEID ou les empreintes digitales, créent une couche de sécurité supplémentaire qui est plus difficile à pirater qu'un mot de passe.

source: Keep your devices and apps up to date to limit vulnerabilities
fr: Gardez vos appareils et applications à jour pour limiter les vulnérabilités

source: An updated device is more secure than one running an older operating system or application. Turn on automatic updates to minimize the time your phone is vulnerable to known threats.
fr: Un appareil mis à jour est plus sécurisé que celui qui exécute un système d'exploitation ou une application plus ancien. Activez les mises à jour automatiques pour minimiser le temps que votre téléphone est vulnérable aux menaces connues.

source: Use secure networks and VPNs for safer browsing, shopping, and downloading
fr: Utilisez des réseaux sécurisés et des VPN pour une navigation, un shopping et un téléchargement plus sûrs

source: A VPN creates an encrypted path for you to use the internet by anonymizing your device and masking your IP address. Always protect your browsing when on public Wi-Fi by using a VPN.
fr: Un VPN crée un chemin chiffré pour que vous puissiez utiliser Internet en anonymisant votre appareil et en masquant votre adresse IP. Protégez toujours votre navigation en cas de connexion Wi-Fi publique en utilisant un VPN.

source: Back up and encrypt data to protect your personal information
fr: Sauvegarder et chiffrer les données pour protéger vos informations personnelles

source: Backing up an encrypted copy of your data protects you in the event of malware disabling your mobile device. Encrypted cloud backups mean you can access your data anywhere and be nearly as safe as with encrypted physical backups.
fr: La sauvegarde d'une copie cryptée de vos données vous protège en cas de logiciels malveillants en désactivant votre appareil mobile. Les sauvegardes cloud cryptées signifient que vous pouvez accéder à vos données n'importe où et être presque aussi sûre qu'avec des sauvegardes physiques chiffrées.

source: Employ strong, unique passwords and 2FA to keep your accounts safer
fr: Utilisez des mots de passe solides et uniques et 2FA pour garder vos comptes plus sûrs

source: Using a password manager will make securely storing and accessing passwords simple. Follow good password security practices by choosing unique passwords that you don’t reuse. Turn on two-factor authentication to put another roadblock between hackers and your personal information.
fr: L'utilisation d'un gestionnaire de mots de passe facilitera le stockage et l'accès à des mots de passe. Suivez les bonnes pratiques de sécurité des mots de passe en choisissant des mots de passe uniques que vous ne réutilisez pas. Allumez l'authentification à deux facteurs pour mettre un autre barrage entre les pirates et vos informations personnelles.

source: Use mobile security software for faster, more efficient mobile security
fr: Utilisez un logiciel de sécurité mobile pour une sécurité mobile plus rapide et plus efficace

source: Mobile security software like Norton Mobile Security for Android and iOS devices combines many of these security features into an easy-to-use package. It scans your messages for phishing attempts, warns you when suspicious networks are nearby, and protects your devices from malware.
fr: Des logiciels de sécurité mobiles comme Norton Mobile Security pour les appareils Android et iOS combine bon nombre de ces fonctionnalités de sécurité dans un package facile à utiliser. Il analyse vos messages pour les tentatives de phishing, vous avertit lorsque les réseaux suspects sont à proximité et protègent vos appareils contre les logiciels malveillants.

source: 6 Tips to Secure Mobile Device
fr: 6 conseils pour sécuriser l'appareil mobile

source: FAQs about mobile security
fr: FAQ sur la sécurité mobile

source: Have more questions about mobile security? We have answers.
fr: Vous avez plus de questions sur la sécurité mobile? Nous avons des réponses.

source: What is the best security you can put on a mobile device?
fr: Quelle est la meilleure sécurité que vous pouvez mettre sur un appareil mobile?

source: The best mobile security depends on a variety of factors, including:
fr: La meilleure sécurité mobile dépend de divers facteurs, notamment:

source: Device type
fr: Type d'appareil

source: How frequently you use your device
fr: À quelle fréquence vous utilisez votre appareil

source: What you use your device for
fr: Pour quoi vous utilisez votre appareil

source: Regardless of these factors, it’s a good idea to take advantage of the security features in your devices. That means screen lock passcodes, biometrics, and remote wiping if you lose your device. Installing cybersecurity software will give you an extra level of protection from threats.
fr: Quels que soient ces facteurs, c'est une bonne idée de profiter des fonctionnalités de sécurité de vos appareils. Cela signifie des codes de passe de verrouillage d'écran, des biométriques et des essuages ​​à distance si vous perdez votre appareil. L'installation du logiciel de cybersécurité vous offrira un niveau supplémentaire de protection contre les menaces.

source: How can I make my phone more secure?
fr: Comment puis-je rendre mon téléphone plus sécurisé?

source: To make your phone more secure, you should use security software, use a VPN when you browse the internet with public Wi-Fi, keep your operating system and applications updated, and avoid clicking on links and downloading files from people you don’t know.
fr: Pour rendre votre téléphone plus sécurisé, vous devez utiliser un logiciel de sécurité, utiliser un VPN lorsque vous parcourez Internet avec le Wi-Fi public, gardez votre système d'exploitation et vos applications, et évitez de cliquer sur les liens et de télécharger des fichiers à partir de personnes que vous ne connaissez pas .

source: What's the most secure way to lock your smartphone?
fr: Quelle est la façon la plus sécurisée de verrouiller votre smartphone?

source: The most secure way to lock your smartphone or tablet is to set a passcode and use any biometric security features (like a fingerprint scan or facial recognition) available on your device. It’s also vital that you choose a unique passcode and that you don’t share your passcode with anyone.
fr: Le moyen le plus sécurisé de verrouiller votre smartphone ou votre tablette consiste à définir un mot de passe et à utiliser toutes les fonctionnalités de sécurité biométriques (comme une analyse d'empreintes digitales ou une reconnaissance faciale) disponible sur votre appareil. Il est également essentiel que vous choisissiez un code d'accès unique et que vous ne partagez votre mot de passe avec personne.

source: Do I really need a password lock on my phone?
fr: Ai-je vraiment besoin d'un verrouillage de mot de passe sur mon téléphone?

source: If you care about the security of your phone and the personal information on it, yes. Not only will it stop people around you from accessing your device without your permission, but it may also prevent your information from falling into the hands of a thief if your phone is stolen.
fr: Si vous vous souciez de la sécurité de votre téléphone et des informations personnelles à ce sujet, oui. Non seulement cela empêchera les gens autour de vous d'accéder à votre appareil sans votre permission, mais cela peut également empêcher vos informations de tomber entre les mains d'un voleur si votre téléphone est volé.

source: GUIDE on creating strong passwords and keeping them safe
fr: Guide sur la création de mots de passe forts et les garder en sécurité

source: US Norton Blog - How to create a secure password
fr: US Norton Blog - Comment créer un mot de passe sécurisé

source: Password mistakes to avoid:
fr: Erreurs de mot de passe à éviter:

source: Make your passwords more secure by avoiding the following:
fr: Rendez vos mots de passe plus sécurisés en évitant les éléments suivants:

source: Numerical patterns like “1234”
fr: Modèles numériques comme «1234»

source: Common words like “password” or “guest”
fr: Des mots communs comme «mot de passe» ou «invité»

source: Repeated characters like “1111”
fr: Des personnages répétés comme "1111"

source: Keyboard patterns like “qazwsx” or “asdf”
fr: Modèles de clavier comme «Qazwsx» ou «ASDF»

source: First and last names
fr: Noms de premier et de famille

source: Pet and family member names
fr: Noms des membres de l'animal et de la famille

source: Nicknames
fr: Surnom

source: Important dates
fr: Dates importantes

source: Cities you’ve lived in
fr: Villes dans lesquelles vous avez vécu

source: Schools you’ve attended
fr: Écoles auxquelles vous avez fréquenté

source: Reversed words like “drowssap”
fr: Des mots inversés comme «Drowssap»

source: Character substitutions like using “@” in place of “a”
fr: Substitutions de caractère comme utiliser «@» à la place de «A»

source: 5 tips to create secure passwords
fr: 5 conseils pour créer des mots de passe sécurisés

source: When it comes to online security, creating long, strong, and unique passwords is your first line of defense. Here are five key tips to create strong passwords, fortify your accounts, and keep your personal information safer online:
fr: En ce qui concerne la sécurité en ligne, la création de mots de passe longs, forts et uniques est votre première ligne de défense. Voici cinq conseils clés pour créer des mots de passe solides, fortifier vos comptes et garder vos informations personnelles plus en ligne:

source: Randomize your passwords
fr: Randomiser vos mots de passe

source: Random passwords are the ultimate shield against hackers. Since they lack patterns and personal information, it’s nearly impossible for hackers to guess them using dictionary attacks, numerical patterns like “123,” or birthday predictions. You should also avoid falling into the trap of using guessable words that are significant to your life, like nicknames, surnames, pets, cities, and schools you attended.
fr: Les mots de passe aléatoires sont le bouclier ultime contre les pirates. Puisqu'ils manquent de modèles et d'informations personnelles, il est presque impossible pour les pirates de les deviner en utilisant des attaques de dictionnaire, des modèles numériques comme «123» ou des prédictions d'anniversaire. Vous devez également éviter de tomber dans le piège de l'utilisation de mots supposables qui sont importants pour votre vie, comme les surnoms, les noms de famille, les animaux de compagnie, les villes et les écoles que vous avez fréquentées.

source: Randomize your password
fr: Randomiser votre mot de passe

source: Make passwords long
fr: Faire des mots de passe longs

source: Longer passwords are more secure because every additional character increases the number of possible combinations. That means that it’s harder for hackers to guess your password. It also makes the password-cracking process more time-intensive, which could deter brute force attacks. To maximize account security, make your passwords at least 15 characters long.
fr: Les mots de passe plus longs sont plus sécurisés car chaque caractère supplémentaire augmente le nombre de combinaisons possibles. Cela signifie qu'il est plus difficile pour les pirates de deviner votre mot de passe. Il rend également le processus de craquage de mot de passe plus provenant de temps, ce qui pourrait dissuader les attaques de force brute. Pour maximiser la sécurité du compte, faites vos mots de passe au moins 15 caractères.

source: Avoid password recycling
fr: Évitez le recyclage des mots de passe

source: Recycling the same password across accounts makes your passwords less secure. If an attacker compromises one password, all your accounts with the same password are at risk. To boost your password security, create a strong and unique password for every account. You can use a secure password generator to create them and a password manager to store them.
fr: Le recyclage du même mot de passe sur les comptes rend vos mots de passe moins sécurisés. Si un attaquant compromet un mot de passe, tous vos comptes avec le même mot de passe sont à risque. Pour augmenter la sécurité de votre mot de passe, créez un mot de passe fort et unique pour chaque compte. Vous pouvez utiliser un générateur de mots de passe sécurisé pour les créer et un gestionnaire de mots de passe pour les stocker.

source: Use symbols, cases, and spellings
fr: Utilisez des symboles, des cas et des orthographes
