Repository: sarryteng/lvl4-individual-project
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Even if you develop a completely original password, it could still be easy to guess if you spell a word correctly, use predictable cases, and don’t use numbers or symbols. Up the ante by incorporating a mix of uppercase (A – Z) and lowercase letters (a – z), numbers (0 - 9), and symbols (#, $, %%). Also, don’t substitute letters with symbols or numbers (like “p@ssw0rd”) unless you’re creating a passphrase—most cybercriminals are well aware of this password trick.
fr: Même si vous développez un mot de passe complètement original, il pourrait toujours être facile de deviner si vous épelez correctement un mot, utilisez des cas prévisibles et n'utilisez pas de nombres ou de symboles. En hausse la mise en incorporant un mélange de majuscules (A - Z) et de lettres minuscules (A - Z), de chiffres (0 - 9) et de symboles (#, $, %%). De plus, ne remplacez pas les lettres par des symboles ou des nombres (comme «P @ SSW0RD») à moins que vous créiez une phrase secrète - la plupart des cybercriminels sont bien conscients de cette astuce de mot de passe.

source: Opt for long passphrases
fr: Optez pour de longues phrases de passe

source: Passphrases are strings of words that can help protect your accounts in the event of password attacks. They should use a complex and lengthy mix of characters, 5 to 7 words, and symbols. As a bonus, they are easier to remember since you can base them on movie quotes, rhymes, songs, etc., making them especially useful for securing your home computer lock screen.
fr: Les phrases de passe sont des chaînes de mots qui peuvent aider à protéger vos comptes en cas d'attaques de mot de passe. Ils doivent utiliser un mélange complexe et long de caractères, 5 à 7 mots et symboles. En prime, ils sont plus faciles à retenir car vous pouvez les baser sur des citations de films, des rimes, des chansons, etc., ce qui les rend particulièrement utiles pour sécuriser l'écran de verrouillage de votre ordinateur.

source: Just don’t use personal information or choose a passphrase directly linked to something you’ve shared publicly. For example, if you’re a loud and proud Swiftie, don’t use one of Taylor Swift’s songs to inspire your passphrase.
fr: N'utilisez pas les informations personnelles ou choisissez une phrase de passe directement liée à quelque chose que vous avez partagé publiquement. Par exemple, si vous êtes un Swiftie bruyant et fier, n'utilisez pas l'une des chansons de Taylor Swift pour inspirer votre phrase secrète.

source: If you’re not sure whether your passphrases are strong enough, consider using a random password generator to come up with hard-to-crack ideas.
fr: Si vous ne savez pas si vos phrases de passe sont suffisamment fortes, envisagez d'utiliser un générateur de mots de passe aléatoire pour proposer des idées difficiles à craquer.

source: How to remember strong passwords
fr: Comment se souvenir des mots de passe forts

source: While strong passwords are vital, remembering them can be tough, especially when you’re supposed to have a long, strong, and unique iteration for each account. Consider using a password manager like Norton Password Manager or mnemonics to stay on top of your passwords.
fr: Bien que les mots de passe solides soient essentiels, vous en souvenir peut être difficile, surtout lorsque vous êtes censé avoir une itération longue, forte et unique pour chaque compte. Pensez à utiliser un gestionnaire de mots de passe comme Norton Password Manager ou Mnemonics pour rester au-dessus de vos mots de passe.

source: Password managers
fr: Gestionnaires de mots de passe

source: A password manager is a secure digital vault that stores all your passwords. You just need to remember one master password to access it. Then, you can securely and conveniently auto-fill your credentials when you visit a website’s login page.
fr: Un gestionnaire de mots de passe est un coffre-fort numérique sécurisé qui stocke tous vos mots de passe. Il vous suffit de vous souvenir d'un mot de passe maître pour y accéder. Ensuite, vous pouvez remplir automatiquement et facilement vos informations d'identification lorsque vous visitez la page de connexion d'un site Web.

source: Mnemonic devices
fr: Dispositifs mnémoniques

source: A mnemonic device is a memory trick that helps you recall information by associating it with something more memorable, such as a phrase or rhyme. You can use these to remember secure and complex passwords—just come up with a memorable phrase or acronym.
fr: Un appareil mnémonique est une astuce de mémoire qui vous aide à rappeler des informations en les associant à quelque chose de plus mémorable, comme une phrase ou une rime. Vous pouvez les utiliser pour vous souvenir des mots de passe sécurisés et complexes - il vous suffit de trouver une phrase ou un acronyme mémorable.

source: For example, you know you shouldn’t use your name in a password. But you can use your name as a mnemonic device for a passphrase. So, instead of making your password “AdamC” (your first name and surname initial), you could use the mnemonic device, “AstronautDrivesArmorMiracleCorduroy,” to remember each word of your passphrase. Of course, you also need to mix up the cases and add numbers and symbols.
fr: Par exemple, vous savez que vous ne devriez pas utiliser votre nom dans un mot de passe. Mais vous pouvez utiliser votre nom comme un appareil mnémonique pour une phrase secrète. Donc, au lieu de faire de votre mot de passe «ADAMC» (votre prénom et votre nom de famille initial), vous pouvez utiliser l'appareil mnémonique, «AstronautdriveSarmorMerraclecorduroy», pour se souvenir de chaque mot de votre phrase de passe. Bien sûr, vous devez également mélanger les cas et ajouter des nombres et des symboles.

source: How to keep your passwords safe
fr: Comment garder vos mots de passe en sécurité

source: Password security requires a comprehensive approach. To keep your passwords safe:
fr: La sécurité du mot de passe nécessite une approche complète. Pour garder vos mots de passe en sécurité:

source: Create long, complex passwords
fr: Créer des mots de passe longs et complexes

source: Use unique passwords for every account
fr: Utilisez des mots de passe uniques pour chaque compte

source: Use a reputable password manager
fr: Utilisez un gestionnaire de mots de passe réputé

source: Enable two-factor authentication (2FA)
fr: Activer l'authentification à deux facteurs (2FA)

source: Change your passwords regularly
fr: Changez régulièrement vos mots de passe

source: Subscribe to data breach alerts
fr: Abonnez-vous aux alertes de violation de données

source: Avoid clicking suspicious links
fr: Évitez de cliquer sur des liens suspects

source: Don’t share your passwords with anyone
fr: Ne partagez vos mots de passe avec personne

source: Use a reputable security app
fr: Utilisez une application de sécurité réputée

source: FAQs about password security
fr: FAQ sur la sécurité du mot de passe

source: Still have questions about password security? Here’s what you need to know.
fr: Vous avez encore des questions sur la sécurité du mot de passe? Voici ce que vous devez savoir.

source: How long should my password be?
fr: Combien de temps mon mot de passe devrait-il durer?

source: A strong password should be at least 15 characters long, with a combination of different character sets like letters, numbers, and symbols.
fr: Un mot de passe fort doit comporter au moins 15 caractères, avec une combinaison de différents ensembles de caractères comme des lettres, des nombres et des symboles.

source: How do I know if my password is no longer secure?
fr: Comment savoir si mon mot de passe n'est plus sécurisé?

source: If your password is short, simple, has been shared with others, used on multiple accounts, or has been compromised in a data breach, it is not secure. On top of creating long, strong, unique passwords, you should also change them regularly if you want strong password security.
fr: Si votre mot de passe est court, simple, a été partagé avec d'autres, utilisé sur plusieurs comptes ou a été compromis dans une violation de données, il n'est pas sécurisé. En plus de créer des mots de passe longs, forts et uniques, vous devez également les modifier régulièrement si vous voulez une sécurité de mot de passe solide.

source: GUIDE on How to Identify Phishing Links and What to Do After Clicking Them
fr: Guide sur la façon d'identifier les liens de phishing et que faire après avoir cliqué

source: Recognizing and Preventing Phishing Attacks
fr: Reconnaître et prévenir les attaques de phishing

source: US Norton Blog - What is phishing? How to spot and avoid it
fr: US Norton Blog - Qu'est-ce que le phishing? Comment le repérer et l'éviter

source: What to do if you clicked on a phishing link
fr: Que faire si vous avez cliqué sur un lien de phishing

source: If a phishing scam lures you into clicking a malicious link, it’s important to act quickly to minimize the fallout. First, cease all interactions—stop communicating with the attacker, end any active downloads, and close out of the spoofed website if the URL took you to one. Then, secure your device and begin the process of monitoring your credit and other accounts for signs of fraud.
fr: Si une arnaque de phishing vous attire de cliquer sur un lien malveillant, il est important d'agir rapidement pour minimiser les retombées. Tout d'abord, cessez toutes les interactions - communiquez avec l'attaquant, terminez tous les téléchargements actifs et fermez le site Web usurpé si l'URL vous emmène à un. Ensuite, sécurisez votre appareil et commencez le processus de surveillance de votre crédit et d'autres comptes pour des signes de fraude.

source: Stop interacting
fr: Arrêtez d'interagir

source: If you realize you fell into a phishing trap, immediately stop what you’re doing. Depending on the situation, this could mean closing the spoofed website window or halting an in-progress download. Ending the interaction after clicking a phishing link can help protect your data by preventing sensitive information from being transmitted to the attacker.
fr: Si vous réalisez que vous êtes tombé dans un piège à phishing, arrêtez immédiatement ce que vous faites. Selon la situation, cela pourrait signifier fermer la fenêtre du site Web usurpé ou interrompre un téléchargement en cours. La fin de l'interaction après avoir cliqué sur un lien de phishing peut aider à protéger vos données en empêchant la transmission des informations sensibles à l'attaquant.

source: Disconnect your internet
fr: Débranchez votre Internet

source: Disconnecting your internet connection after clicking a phishing link is another way to stop ongoing data transfers. This is a good option for stopping background processes and preventing malware from spreading to other devices on your network.
fr: Débrancher votre connexion Internet après avoir cliqué sur un lien de phishing est une autre façon d'arrêter les transferts de données. Il s'agit d'une bonne option pour arrêter les processus d'arrière-plan et empêcher les logiciels malveillants de se propager à d'autres appareils sur votre réseau.

source: Change your passwords
fr: Changez vos mots de passe

source: Prevent ongoing unauthorized access to your accounts by changing any account login credentials that may have been compromised when you clicked a phishing link. To help block hackers, craft long and unique passwords, mixing uppercase and lowercase letters, numbers, and symbols for maximum security.
fr: Empêchez l'accès non autorisé en cours à vos comptes en modifiant les informations de connexion des comptes qui peuvent avoir été compromis lorsque vous avez cliqué sur un lien de phishing. Pour aider à bloquer les pirates, fabriquer des mots de passe longs et uniques, en mélangeant des lettres, des nombres et des symboles en majuscules pour une sécurité maximale.

source: If you recently clicked a phishing link, consider adding a further layer of protection to your accounts with two-factor authentication. This helps keep your accounts safer even if a hacker gets their hands on your password, because 2FA requires users to enter a secondary verification code sent directly to an alternative device.
fr: Si vous avez récemment cliqué sur un lien de phishing, envisagez d'ajouter une nouvelle couche de protection à vos comptes avec une authentification à deux facteurs. Cela aide à garder vos comptes plus sûrs même si un pirate met la main sur votre mot de passe, car 2FA oblige les utilisateurs à saisir un code de vérification secondaire envoyé directement à un autre appareil.

source: Alert the credit bureaus
fr: Alerter les bureaux de crédit

source: Visit the home pages of the three national credit bureaus—Experian<sup>®</sup>, Equifax<sup>®</sup>, and TransUnion<sup>®</sup>—to alert them of the phishing attack and freeze your credit. Freezing your credit helps ensure criminals can't open new credit accounts or take out new loans in your name.
fr: Visitez les pages d'accueil des trois bureaux nationaux de crédit - Expérian <p> ® </sup>, Equifax <p> ® </sup> et TransUnion <p> ® </sup> —Pour les alerter de l'attaque de phishing et congeler votre crédit. Le gel de votre crédit aide à garantir que les criminels ne peuvent pas ouvrir de nouveaux comptes de crédit ou contracter de nouveaux prêts à votre nom.

source: Contact your credit card providers and review your statements
fr: Contactez vos fournisseurs de cartes de crédit et examinez vos déclarations

source: If you shared your credit card information with a phisher, contact your credit card issuer. They can help you freeze your credit card to stop unauthorized purchases and help you comb through your statements to identify fraudulent transactions. They may even be able to reimburse you for purchases the phisher made using your card.
fr: Si vous avez partagé les informations de votre carte de crédit avec un Phisher, contactez votre émetteur de carte de crédit. Ils peuvent vous aider à congeler votre carte de crédit pour arrêter les achats non autorisés et vous aider à peigner vos déclarations pour identifier les transactions frauduleuses. Ils peuvent même être en mesure de vous rembourser pour acheter le phisher fabriqué à l'aide de votre carte.

source: Check your credit report
fr: Vérifiez votre rapport de crédit

source: Check your credit report regularly for signs of identity theft and financial fraud in the months after clicking a phishing link. This is where you’ll see if someone applies for loans or takes out lines of credit in your name.
fr: Vérifiez régulièrement votre rapport de crédit pour des signes de vol d'identité et de fraude financière dans les mois après avoir cliqué sur un lien de phishing. C'est là que vous verrez si quelqu'un demande des prêts ou élimine les lignes de crédit à votre nom.

source: Report the phishing attack
fr: Signaler l'attaque de phishing

source: Mark as spam or junk any phishing messages or calls you see. Then, report the phishing attempt to help counter-cybercrime groups track threats and limit future phishing attacks.
fr: Marquez comme spam ou indésirable tous les messages ou appels de phishing que vous voyez. Ensuite, signalez la tentative de phishing pour aider les groupes contre-cybercriminaux à suivre les menaces et à limiter les futures attaques de phishing.

source: Here’s how to report phishing messages:
fr: Voici comment signaler les messages de phishing:

source: Report phishing text messages
fr: Signaler des messages texte de phishing

source: by forwarding them to SPAM (7726).
fr: en les transmettant au spam (7726).

source: Report phishing emails
fr: Signaler les e-mails de phishing

source: by forwarding the phishing email to reportphishing@apwg.org.
fr: en transmettant l'e-mail de phishing à reportphishing@apwg.org.

source: Scan your device for malware
fr: Analyser votre appareil pour malware

source: Use antivirus software to help identify and block online attacks and help prevent phishers from continuing to spy on you or stealing your personal information.
fr: Utilisez un logiciel antivirus pour aider à identifier et bloquer les attaques en ligne et à empêcher les phishers de continuer à vous espionner ou de voler vos informations personnelles.

source: How can I spot a phishing attack before clicking a link?
fr: Comment puis-je repérer une attaque de phishing avant de cliquer sur un lien?

source: These days, phishers are much more adept at baiting their targets and luring them in. Still, there are several ways you can spot a phishing attack before it becomes a problem, including:
fr: Ces jours-ci, les phishers sont beaucoup plus aptes à appâter leurs cibles et à les attirer. Pourtant, il existe plusieurs façons de repérer une attaque de phishing avant que cela ne devienne un problème, notamment:

source: Unbelievable deals:
fr: Offres incroyables:

source: Be wary of emails offering wildly cheap products or services. If it seems too good to be true, it probably is.
fr: Méfiez-vous des e-mails offrant des produits ou des services très bon marché. Si cela semble trop beau pour être vrai, c'est probablement le cas.

source: Requests for personal information:
fr: Demandes d'informations personnelles:

source: Legitimate institutions like banks will never ask for account details via email—never share such information this way.
fr: Des institutions légitimes comme les banques ne demanderont jamais les détails du compte par e-mail - ne partagent jamais ces informations de cette façon.

source: Spelling and grammatical mistakes:
fr: Organisation et erreurs grammaticales:

source: Emails littered with typos and awkward phrasing are common in phishing emails and text messages.
fr: Les e-mails jonchés de fautes de frappe et de phrasé maladroit sont courants dans les e-mails de phishing et les SMS.

source: Generic greetings:
fr: Salutations génériques:

source: Many times, phishers don’t bother to personalize emails because they just want to cast a wide net and catch as many people as they can. So you might receive an email with a generic greeting like, “Hello, Sir” or “Dear Account Holder.”
fr: Plusieurs fois, les phishers ne prennent pas la peine de personnaliser les e-mails car ils veulent simplement lancer un filet large et attraper autant de personnes que possible. Vous pourriez donc recevoir un e-mail avec une salutation générique comme «Bonjour, monsieur» ou «cher titulaire de compte».

source: Urgent language:
fr: Langue urgente:

source: Phishers create urgency to rush you into clicking links. Don't be pressured; take your time when reading and responding to emails.
fr: Les phishers créent de l'urgence pour vous précipiter pour cliquer sur des liens. Ne vous faites pas pression; Prenez votre temps lorsque vous lisez et répondez aux e-mails.

source: Unfamiliar senders:
fr: Expéditeurs inconnus:

source: Delete emails from unknown senders without clicking anything. This is especially important if you can’t verify their identity.
fr: Supprimer les e-mails des expéditeurs inconnus sans rien cliquer. Ceci est particulièrement important si vous ne pouvez pas vérifier leur identité.

source: Familiar senders:
fr: Expéditeurs familiers:

source: Even seemingly familiar email addresses can be fake. If the tone, communication channel, or content feels off, try to reach out to the person using another form of communication to confirm their identity.
fr: Même les adresses e-mail apparemment familières peuvent être fausses. Si le ton, le canal de communication ou le contenu se sent éteint, essayez de tendre la main à la personne utilisant une autre forme de communication pour confirmer son identité.

source: Suspicious links and attachments:
fr: Liens et pièces jointes suspectes:

source: Before clicking a link or downloading an attachment, hover over the link and inspect the URL for inconsistencies.
fr: Avant de cliquer sur un lien ou de télécharger une pièce jointe, survolez le lien et inspectez l'URL pour les incohérences.

source: Use a scam detection tool to analyze messages:
fr: Utilisez un outil de détection de l'escroquerie pour analyser les messages:

source: If a message looks suspicious, use an anti-scam tool to help determine if the message is legitimate.
fr: Si un message semble suspect, utilisez un outil anti-scam pour déterminer si le message est légitime.

source: How do I know if I clicked a phishing link?
fr: Comment savoir si j'ai cliqué sur un lien de phishing?

source: You may not immediately realize that you clicked a phishing link because it can take some time for red flags to appear.
fr: Vous ne réalisez peut-être pas immédiatement que vous avez cliqué sur un lien de phishing car il peut prendre un certain temps pour que les drapeaux rouges apparaissent.

source: How to know if clicked on phishing link
fr: Comment savoir si clicait sur le lien de phishing

source: You’ll know you’ve likely been phished if you start noticing warning signs like:
fr: Vous saurez que vous avez probablement été phisé si vous commencez à remarquer des signes d'avertissement comme:

source: Suspicious redirects
fr: Redirection suspecte

source: that take you to crudely made websites with misspellings and odd characters in the URL.
fr: Cela vous amène à des sites Web grossièrement créés avec des fautes d'orthographe et des personnages étranges dans l'URL.

source: Invasive personal information requests
fr: Demandes d'informations personnelles envahissantes

source: like a form prompting you to enter sensitive details like your Social Security number or account information.
fr: Comme un formulaire vous incitant à saisir des détails sensibles comme votre numéro de sécurité sociale ou vos informations de compte.

source: Too-good-to-be-true messages and offers
fr: Messages et offres trop beaux

source: like free vacations or job offers with sky-high salaries to try to entice you to engage with the phisher.
fr: Comme des vacances gratuites ou des offres d'emploi avec des salaires de haut niveau pour essayer de vous inciter à vous engager avec le phisher.

source: High-pressure language
fr: Langue à haute pression

source: in messages or website copy that creates a sense of urgency to encourage you to click a link without thinking.
fr: Dans les messages ou la copie de site Web qui crée un sentiment d'urgence pour vous encourager à cliquer sur un lien sans réfléchir.

source: FAQs about phishing
fr: FAQ sur le phishing

source: If your questions don’t just stop at “What is phishing?” we’ve got you covered. Read through this FAQ section to learn more about phishing scams.
fr: Si vos questions ne s'arrêtent pas à "Qu'est-ce que le phishing?" Nous vous avons couvert. Lisez cette section FAQ pour en savoir plus sur les escroqueries à phishing.

source: Who are the targets of phishing attacks?
fr: Qui sont les cibles des attaques de phishing?

source: Anyone can be targeted in a phishing attack. To increase their chance of success, phishers will often target as many email addresses or phone numbers as possible.
fr: Tout le monde peut être ciblé dans une attaque de phishing. Pour augmenter leurs chances de succès, les Phishers viseront souvent autant d'adresses e-mail ou de numéros de téléphone que possible.

source: Can AI be used for phishing attacks?
fr: L'IA peut-elle être utilisée pour les attaques de phishing?

source: Yes, scammers can use AI to make their communications sound more believable. For example, phishers may use it to generate realistic conversations free of spelling and grammatical errors so their phishing messages seem more legitimate.
fr: Oui, les escrocs peuvent utiliser l'IA pour rendre leurs communications plus crédibles. Par exemple, les phishers peuvent l'utiliser pour générer des conversations réalistes sans orthographe et erreurs grammaticales afin que leurs messages de phishing semblent plus légitimes.
