Repository: sarryteng/lvl4-individual-project
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: If passwords aren’t strong and kept secure, cybercriminals could gain access to your accounts. That can lead to scams, financial repercussions, or even identity theft. And then there’s the added stress of recovering hacked accounts or a stolen identity.
fr: Si les mots de passe ne sont pas solides et maintenus en sécurité, les cybercriminels pourraient accéder à vos comptes. Cela peut entraîner des escroqueries, des répercussions financières ou même un vol d'identité. Et puis il y a le stress supplémentaire de récupérer des comptes piratés ou une identité volée.

source: If a cybercriminal can access your social media accounts or email with your password, they could scam your contacts or use your own information against you in a social engineering attack.
fr: Si un cybercriminal peut accéder à vos comptes de médias sociaux ou à vos e-mails avec votre mot de passe, il peut arnaquer vos contacts ou utiliser vos propres informations contre vous dans une attaque d'ingénierie sociale.

source: Financial loss:
fr: Perte financière:

source: Whether it’s your bank account drained, blackmail, or transferring money from your payment app, the end goal for password thieves is typically financial.
fr: Qu'il s'agisse de votre compte bancaire drainé, de chantage ou de transfert d'argent de votre application de paiement, l'objectif final des voleurs de mot de passe est généralement financier.

source: Identity theft:
fr: Vol d'identité:

source: If an identity thief has enough information about you, a password could be the final piece of the puzzle they need to achieve their objective. That could be anything from taking out a loan in your name to ordering a new credit card and intercepting it.
fr: Si un voleur d'identité a suffisamment d'informations sur vous, un mot de passe pourrait être la dernière pièce du puzzle dont il a besoin pour atteindre son objectif. Cela pourrait être quelque chose, de contracter un prêt en votre nom à la commande d'une nouvelle carte de crédit et de l'intercepter.

source: Creating a strong password can reduce the risk of cybercriminals guessing it and accessing your sensitive data. Keeper’s 2024 Future of Defense Report found that stolen or weak passwords remain a leading cause of breaches, solidifying the importance of creating and securely storing passwords for each of your online accounts.
fr: La création d'un mot de passe solide peut réduire le risque de cybercriminels le deviner et l'accès à vos données sensibles. Le rapport Future of Defense de Keeper en 2024 a révélé que les mots de passe volés ou faibles restent une cause de violations, solidifiant l'importance de créer et de stocker solidement des mots de passe pour chacun de vos comptes en ligne.

source: When you use weak, short passwords to secure your online accounts it makes it a lot easier and faster for a cybercriminal to crack it. On the other hand, if you use a strong password that is 20 characters long and contains a mix of uppercase and lowercase letters, numbers and symbols, it would take a cybercriminal three sextillion years to crack it.
fr: Lorsque vous utilisez des mots de passe faibles et courts pour sécuriser vos comptes en ligne, cela rend beaucoup plus facile et plus rapide pour un cybercriminal pour le casser. D'un autre côté, si vous utilisez un mot de passe solide qui fait 20 caractères et contient un mélange de lettres, de nombres et de symboles en majuscules et en minuscules, il faudrait un cybercrimiral trois sexnion pour le casser.

source: Time taken to crack password
fr: Temps pris pour casser le mot de passe

source: How are passwords stolen?
fr: Comment les mots de passe sont-ils volés?

source: Cybercriminals steal passwords through a variety of methods using scams or hacking techniques.
fr: Les cybercriminels volent des mots de passe via une variété de méthodes à l'aide d'escroqueries ou de techniques de piratage.

source: Data breaches:
fr: Violation de données:

source: If your password is exposed in a data breach, hackers can use it to access the associated account.
fr: Si votre mot de passe est exposé dans une violation de données, les pirates peuvent les utiliser pour accéder au compte associé.

source: Password-guessing attacks:
fr: Attaques de dégagement de mot de passe:

source: Dictionary attacks involve hackers trying common words and phrases at scale to guess passwords.
fr: Les attaques du dictionnaire impliquent des pirates essayant des mots et des phrases courants à l'échelle pour deviner les mots de passe.

source: Some types of malware can steal your passwords or record your keystrokes as you type.
fr: Certains types de logiciels malveillants peuvent voler vos mots de passe ou enregistrer vos touches pendant que vous tapez.

source: A phishing attack can be designed to trick you into revealing your password. An attack via email or text could also urge you to click a link that takes you to an unsafe website where you enter your password and unknowingly expose it.
fr: Une attaque de phishing peut être conçue pour vous inciter à révéler votre mot de passe. Une attaque par e-mail ou texte pourrait également vous exhorter à cliquer sur un lien qui vous emmène sur un site Web dangereux où vous entrez votre mot de passe et l'expose sans le savoir.

source: Social engineering:
fr: Ingénierie sociale:

source: Phishing is a common type of social engineering attack but there are other examples, like a scareware attack that could lead to a hacker stealing your password.
fr: Le phishing est un type commun d'attaque d'ingénierie sociale, mais il existe d'autres exemples, comme une attaque Scareware qui pourrait conduire un pirate à voler votre mot de passe.

source: LEARN about Phishing
fr: Apprenez-vous sur le phishing

source: What is phishing?
fr: Qu'est-ce que le phishing?

source: Phishing is a social engineering cyberthreat where scammers impersonate a trustworthy source and trick you into revealing sensitive data like passwords, credit card numbers, or personally identifiable information.
fr: Le phishing est une cyberthème d'ingénierie sociale où les escrocs se font passer pour une source digne de confiance et vous incitent à révéler des données sensibles comme les mots de passe, les numéros de carte de crédit ou les informations personnellement identifiables.

source: Phishing attacks often begin with scammers sending a malicious link or attachment via email, social media, or text—possibly triggering a malware download. Alternatively, you may receive a phishing call that comes from a phisher pretending to offer customer service or tech support.
fr: Les attaques de phishing commencent souvent par des escrocs envoyant un lien malveillant ou une pièce jointe par e-mail, médias sociaux ou texte - déclenchant un téléchargement de logiciel malveillant possible. Alternativement, vous pouvez recevoir un appel de phishing provenant d'un Phisher faisant semblant d'offrir un service client ou un support technique.

source: What is Phishing
fr: Qu'est-ce que le phishing

source: How does phishing work
fr: Comment fonctionne le phishing

source: While phishing can vary based on the specific type of scam the scammer is carrying out, phishing attacks often follow these steps:
fr: Bien que le phishing puisse varier en fonction du type spécifique d'arnaque que l'escroc effectue, les attaques de phishing suivent souvent ces étapes:

source: The phisher selects a target (this can be an organization, group, or individual) and comes up with a ruse.
fr: Le Phisher sélectionne une cible (il peut s'agir d'une organisation, d'un groupe ou d'un individu) et propose une ruse.

source: Next, the phisher chooses a communication method and makes contact.
fr: Ensuite, le Phisher choisit une méthode de communication et entre en contact.

source: If effective, the target will engage by replying, opening the phishing link, or downloading a malicious attachment.
fr: S'il est efficace, la cible s'engagera en répondant, en ouvrant le lien de phishing ou en téléchargeant une pièce jointe malveillante.

source: Finally, phishers will collect data and use it to make illegal purchases or commit fraudulent acts such as identity theft.
fr: Enfin, les Phishers collecteront des données et les utiliseront pour effectuer des achats illégaux ou commettre des actes frauduleux tels que le vol d'identité.

source: What is a phishing link?
fr: Qu'est-ce qu'un lien de phishing?

source: A phishing link is a fake link used by cybercriminals to trick you into compromising your own privacy and security. Clicking a phishing link may install malware on your device, or guide you to a spoofed website where you’re prompted to enter sensitive information.
fr: Un lien de phishing est un faux lien utilisé par les cybercriminels pour vous inciter à compromettre votre propre confidentialité et sécurité. Cliquer sur un lien de phishing peut installer des logiciels malveillants sur votre appareil ou vous guider vers un site Web usurpé où vous êtes invité à saisir des informations sensibles.

source: What is a Phishing Link
fr: Qu'est-ce qu'un lien de phishing

source: Types of phishing attacks
fr: Types d'attaques de phishing

source: Phishing scams can take many forms—the type of individual attack ultimately depends on the phisher, who they target, the communication platform they use, and their end goal.
fr: Les escroqueries de phishing peuvent prendre de nombreuses formes - le type d'attaque individuelle dépend finalement du phisher, qu'ils ciblent, de la plate-forme de communication qu'ils utilisent et de leur objectif final.

source: Here’s a rundown of a few predominantly link-based phishing attacks.
fr: Voici un aperçu de quelques attaques de phishing à prédominance liée.

source: The basic phishing email is sent by fraudsters impersonating legitimate companies, often banks or credit card providers. These email phishing examples trick you into providing sensitive information by getting you to download malware unknowingly or by directing you to an unsafe website where you’re asked to voluntarily enter private information.
fr: Le courrier électronique de phishing de base est envoyé par des fraudeurs qui se font l'identité d'entreprises légitimes, souvent des banques ou des fournisseurs de cartes de crédit. Ces exemples de phishing par e-mail vous incitent à fournir des informations sensibles en vous amenant à télécharger des logiciels malveillants sans le savoir ou en vous dirigeant vers un site Web dangereux où il vous est demandé de saisir volontairement des informations privées.

source: Spear phishing
fr: Phishing de lance

source: Spear phishing emails target a specific individual, business, or organization rather than just casting a wide net. Typically, spear phishers invest a lot of time and effort into researching their targets and building a credible persona. For example, the attacker may assume the identity of your boss and trick you into revealing proprietary information in what you believe to be an internal conversation.
fr: Les e-mails de phishing de lance ciblent un individu, une entreprise ou une organisation spécifique plutôt que de simplement lancer un large filet. En règle générale, Spear Phishers investit beaucoup de temps et d'efforts pour rechercher leurs objectifs et construire une personnalité crédible. Par exemple, l'attaquant peut assumer l'identité de votre patron et vous inciter à révéler des informations propriétaires dans ce que vous croyez être une conversation interne.

source: Clone phishing
fr: Phishing clone

source: In clone phishing attacks, scammers create a nearly identical version of an email that victims have already received. The cloned email is sent from an address that is nearly, but not quite, the same as the email address used by the message’s original sender. The body of the email looks the same, too.
fr: Dans les attaques de phishing de clone, les escrocs créent une version presque identique d'un e-mail que les victimes ont déjà reçu. L'e-mail cloné est envoyé à partir d'une adresse qui est presque, mais pas tout à fait, la même que l'adresse e-mail utilisée par l'expéditeur d'origine du message. Le corps de l'e-mail se ressemble également.

source: What’s different about a clone phishing attack is that the attachment or link in the message has been changed. If victims click those links now, it will take them to a malicious website or open an infected attachment.
fr: Ce qui est différent dans une attaque de phishing de clone, c'est que l'attachement ou le lien dans le message a été modifié. Si les victimes cliquent maintenant ces liens, cela les emmènera sur un site Web malveillant ou ouvrira une pièce jointe infectée.

source: Whaling
fr: Pêche à la baleine

source: Whaling attacks target chief executive officers, chief operating officers, or other high-ranking executives. The goal of a whaling attack is to trick powerful people into giving up sensitive corporate data. These attacks are more sophisticated than general phishing attacks and require plenty of research from scammers. They usually rely on fraudulent emails that appear to be from trusted sources within the company or from legitimate outside agencies.
fr: Les attaques de la chasse à la baleine ciblent les directeurs généraux, les chefs de l'exploitation ou d'autres dirigeants de haut rang. L'objectif d'une attaque baleinier est de inciter les personnes puissantes à abandonner les données sensibles des entreprises. Ces attaques sont plus sophistiquées que les attaques de phishing générales et nécessitent de nombreuses recherches des escrocs. Ils comptent généralement sur des e-mails frauduleux qui semblent provenir de sources de confiance au sein de l'entreprise ou d'agences externes légitimes.

source: Pop-up phishing
fr: Phishing pop-up

source: Pop-up ad phishing scams trick people into installing various types of malware on their devices by leveraging scare tactics. A common pop-up phishing example is when a fake virus alert pops up on a user’s screen warning the user that their computer has been infected and the only way to remove the virus is by installing a particular type of antivirus software. Once the user installs this fake software, it either doesn’t work or, worse, actually does infect the computer with malware.
fr: Les escroqueries par phishing pop-up incitent les gens à installer divers types de logiciels malveillants sur leurs appareils en tirant parti des tactiques de peur. Un exemple de phishing pop-up commun est lorsqu'une fausse alerte de virus apparaît sur l'écran d'un utilisateur avertissant l'utilisateur que son ordinateur a été infecté et que le seul moyen de supprimer le virus est d'installer un type particulier de logiciel antivirus. Une fois que l'utilisateur installe ce faux logiciel, cela ne fonctionne pas ou, pire, infecte en fait l'ordinateur par des logiciels malveillants.

source: What techniques do phishers use to manipulate their targets?
fr: Quelles techniques les phishers utilisent-ils pour manipuler leurs cibles?

source: To help increase their chances of getting the information they want, scammers may employ a combination of different phishing techniques, including:
fr: Pour aider à augmenter leurs chances d'obtenir les informations qu'ils souhaitent, les escrocs peuvent utiliser une combinaison de différentes techniques de phishing, notamment:

source: This is the act of tricking someone into divulging sensitive information using manipulative persuasion tactics. For example, a scammer may pretend to be a family member in a dangerous situation to try to get you to quickly send them money.
fr: C'est l'acte de inciter quelqu'un à divulguer des informations sensibles en utilisant des tactiques de persuasion manipulatrices. Par exemple, un escroc peut prétendre être un membre de la famille dans une situation dangereuse pour essayer de vous faire envoyer rapidement de l'argent.

source: Hyperlink manipulation:
fr: Manipulation de l'hyperlien:

source: Phishers may use the text of a legitimate URL to disguise a link to a phishing website. For example, you may think you’re navigating to your bank’s official support page, but after hovering over the link, you discover it is actually going somewhere else.
fr: Phishers peut utiliser le texte d'une URL légitime pour masquer un lien vers un site Web de phishing. Par exemple, vous pensez peut-être que vous naviguez vers la page de soutien officielle de votre banque, mais après avoir survolé le lien, vous découvrez que cela va en fait ailleurs.

source: Graphical rendering:
fr: Rendu graphique:

source: This happens when a phisher uploads their email as an image rather than text to prevent certain text from being scanned by phishing filters.
fr: Cela se produit lorsqu'un phisher télécharge son e-mail en tant qu'image plutôt que de texte pour empêcher que certains texte soient scannés par des filtres à phishing.

source: Site redirects:
fr: Redirection du site:

source: Phishers may also use a malicious webpage as a middle ground between their phishing email and a legitimate site. For example, following their instructions may take you to a webpage created by a phisher to collect your personal information before redirecting you to a legitimate website to minimize your suspicion of a phishing attack.
fr: Phishers peut également utiliser une page Web malveillante comme terrain d'entente entre leur e-mail de phishing et un site légitime. Par exemple, suivre leurs instructions peut vous amener à une page Web créée par un Phisher pour collecter vos informations personnelles avant de vous rediriger vers un site Web légitime afin de minimiser vos soupçons d'une attaque de phishing.

source: Link shortening:
fr: Raccourcissement des liens:

source: Another popular phishing tactic is using link shortening tools to disguise links to dangerous websites.
fr: Une autre tactique de phishing populaire consiste à utiliser des outils de raccourcissement des liens pour masquer les liens vers des sites Web dangereux.

source: Typosquatting:
fr: Typosquat:

source: By using typosquatting, a phisher registers domains that are very close to a legitimate domain, hoping their targets won’t notice. For example, a phisher pretending to be an Amazon support representative might create a phishing site under the URL “Amazpn.com.”
fr: En utilisant la typosquat, un phisher enregistre des domaines qui sont très proches d'un domaine légitime, en espérant que leurs cibles ne le remarqueront pas. Par exemple, un Phisher prétendant être un représentant du support Amazon pourrait créer un site de phishing sous l'URL «AmazPn.com».

source: AI voice generators:
fr: Générateurs de voix AI:

source: Phishers may use AI voice generators to impersonate public figures or acquaintances of yours to get you to divulge sensitive information.
fr: Les phishers peuvent utiliser des générateurs de voix d'IA pour usurper l'identité de personnalités publiques ou de connaissances pour vous amener à divulguer des informations sensibles.

source: Scammers may also use AI-enabled chatbots to create highly personalized phishing messages free of the kind of spelling and grammatical errors often associated with phishing attacks.
fr: Les escrocs peuvent également utiliser des chatbots compatibles AI pour créer des messages de phishing hautement personnalisés sans le type d'orthographe et d'erreurs grammaticales souvent associées aux attaques de phishing.

source: LEARN about Software Updates
fr: Découvrez les mises à jour logicielles

source: What is a software update?
fr: Qu'est-ce qu'une mise à jour logicielle?

source: A software update is a new version of an application, game, or other program on a computer or mobile device. New versions of software usually include patches to fix security vulnerabilities, performance upgrades, and cosmetic changes.
fr: Une mise à jour logicielle est une nouvelle version d'une application, d'un jeu ou d'un autre programme sur un ordinateur ou un appareil mobile. Les nouvelles versions des logiciels incluent généralement des correctifs pour corriger les vulnérabilités de sécurité, les mises à niveau des performances et les changements cosmétiques.

source: The importance of software updates
fr: L'importance des mises à jour logicielles

source: Keeping your software and operating system up to date is an important step towards ensuring your information is safe, your device is secured and working properly, and your programs and system remain compatible with each other.
fr: Garder votre logiciel et votre système d'exploitation à jour est une étape importante pour garantir la sécurité de vos informations, votre appareil est sécurisé et fonctionne correctement, et vos programmes et système restent compatibles les uns avec les autres.

source: Here’s a closer look at the benefits of software updates and why you should always keep them fully updated.
fr: Voici un examen plus approfondi des avantages des mises à jour logicielles et pourquoi vous devez toujours les tenir à jour entièrement.

source: Software updates reduce security flaws
fr: Les mises à jour logicielles réduisent les défauts de sécurité

source: Old software is full of security flaws. Over time, hackers find new ways to break through what was, at one time, the best available protection. Once these cybercriminals break into a system, they can spy on your computer, implant dangerous malware, or even use what they find in your system to commit identity theft.
fr: Les anciens logiciels sont pleins de défauts de sécurité. Au fil du temps, les pirates trouvent de nouvelles façons de percer ce qui était, à un moment donné, la meilleure protection disponible. Une fois que ces cybercriminels se sont effondrés dans un système, ils peuvent espionner votre ordinateur, implanter des logiciels malveillants dangereux ou même utiliser ce qu'ils trouvent dans votre système pour commettre un vol d'identité.

source: Software updates are there to patch zero-day exploits and update older, less effective protocols to the newer, tougher-to-crack standards. This makes updating all your software one of the most critical ways to improve your computer and mobile security.
fr: Les mises à jour logicielles sont là pour corriger les exploits zéro et mettre à jour des protocoles plus anciens et moins efficaces aux normes plus récentes et plus difficiles à crack. Cela fait de la mise à jour de tous vos logiciels l'un des moyens les plus critiques d'améliorer votre ordinateur et votre sécurité mobile.

source: Software updates help protect your data
fr: Les mises à jour logicielles aident à protéger vos données

source: Your data is at risk of being stolen, sold, and used against you by criminals. But the risk of being hit by a data breach is much higher if you’re using outdated software, as is the risk of accidentally destroying or corrupting your files.
fr: Vos données risquent d'être volées, vendues et utilisées contre vous par des criminels. Mais le risque d'être frappé par une violation de données est beaucoup plus élevé si vous utilisez un logiciel obsolète, tout comme le risque de détruire ou de corrompre accidentellement vos fichiers.

source: Updating your software to the latest versions can close off any vulnerabilities that let hackers in. Updates can also correct problems that could corrupt your files while making sure they’re compatible with the newest versions of the programs you use.
fr: La mise à jour de votre logiciel vers les dernières versions peut fermer toutes les vulnérabilités qui permettent aux pirates de rentrer. Les mises à jour peuvent également corriger les problèmes qui pourraient corrompre vos fichiers tout en s'assurant qu'ils sont compatibles avec les dernières versions des programmes que vous utilisez.

source: Software updates improve performance
fr: Les mises à jour logicielles améliorent les performances
