Repository: sarryteng/lvl4-individual-project
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Can you get scammed by opening a text message?
fr: Pouvez-vous être arnaqué en ouvrant un SMS?

source: No, opening a scam text message itself isn't risky. However, clicking links within those text messages or replying can expose you to malware or trick you into revealing personal information.
fr: Non, l'ouverture d'un message texte d'escroquerie lui-même n'est pas risqué. Cependant, cliquer sur les liens dans ces messages texte ou répondre peut vous exposer à des logiciels malveillants ou vous informer de la révélation des informations personnelles.

source: What do you do when you click a suspicious link on your phone?
fr: Que faites-vous lorsque vous cliquez sur un lien suspect sur votre téléphone?

source: If you click a suspicious link on your phone, close the website, stop any active downloads, and disconnect your internet connection. Then, use security software to scan your phone for malware. Finally, change the passwords for any accounts that may have been impacted.
fr: Si vous cliquez sur un lien suspect sur votre téléphone, fermez le site Web, arrêtez les téléchargements actifs et déconnectez votre connexion Internet. Ensuite, utilisez un logiciel de sécurité pour scanner votre téléphone pour des logiciels malveillants. Enfin, modifiez les mots de passe de tous les comptes qui auraient pu être touchés.

source: GUIDE on how to use email encryption
fr: Guide sur la façon d'utiliser le chiffrement des e-mails

source: US Norton Blog - How to encrypt email in Gmail, Outlook, iOS, and Android
fr: US NORTON BLOG - Comment crypter les e-mails dans Gmail, Outlook, iOS et Android

source: How to encrypt email on iPhone + other iOS devices
fr: Comment chiffrer les e-mails sur iPhone + d'autres appareils iOS

source: The security measures on iOS devices allow for S/MIME encryption. But you'll have to purchase and download an S/MIME certificate before successfully encrypting email messages. These steps may vary depending on the device you’re using.
fr: Les mesures de sécurité sur les appareils iOS permettent le chiffrement S / MIME. Mais vous devrez acheter et télécharger un certificat S / MIME avant de crypter avec succès les e-mails. Ces étapes peuvent varier en fonction de l'appareil que vous utilisez.

source: Open
fr: Ouvrir

source: and select your
fr: et sélectionnez votre

source: Apple ID
fr: ID de pomme

source: account at the top of the screen.
fr: compte en haut de l'écran.

source: Tap the
fr: Appuyez sur le

source: button.
fr: bouton.

source: Scroll to the
fr: Faites défiler vers le

source: Advanced
fr: Avancé

source: button at the bottom of the screen.
fr: bouton en bas de l'écran.

source: Tap
fr: Robinet

source: Encrypt by Default
fr: Crypter par défaut

source: and make sure the S/MIME details are correct.
fr: Et assurez-vous que les détails S / MIME sont corrects.

source: How to Encrypt Email on iPhone
fr: Comment chiffrer les e-mails sur iPhone

source: Email encryption for Android
fr: Encryption par e-mail pour Android

source: Android devices are similar to iOS devices in that they can support an additional encryption extension to protect emails. However, these devices require the PGP/MIME protocol and third-party apps to send secure emails.
fr: Les appareils Android sont similaires aux appareils iOS en ce qu'ils peuvent prendre en charge une extension de chiffrement supplémentaire pour protéger les e-mails. Cependant, ces appareils nécessitent le protocole PGP / MIME et les applications tierces pour envoyer des e-mails sécurisés.

source: Email encryption tools/services
fr: Outils / services de chiffrement par e-mail

source: Because some email providers and device makers make it harder than others to send encrypted email messages, there are also some third-party tools you can use to help send secure emails.
fr: Étant donné que certains fournisseurs de courriels et fabricants d'appareils rendent plus difficile que d'autres d'envoyer des e-mails cryptés, il existe également des outils tiers que vous pouvez utiliser pour aider à envoyer des e-mails sécurisés.

source: A few of the free apps available to send and receive encrypted messages, along with a few anonymous email services, include:
fr: Quelques-unes des applications gratuites disponibles pour envoyer et recevoir des messages chiffrés, ainsi que quelques services de messagerie anonymes, incluent:

source: How to read encrypted emails
fr: Comment lire les e-mails cryptés

source: These are the main methods for reading encrypted emails:
fr: Ce sont les principales méthodes de lecture des e-mails cryptés:

source: If an email is encrypted and protected by a password, you must enter the password to decrypt the email and read it.
fr: Si un e-mail est crypté et protégé par un mot de passe, vous devez saisir le mot de passe pour déchiffrer l'e-mail et le lire.

source: If an email is encrypted and not protected by a password, you’ll need to have the encryption key before the message's contents are readable.
fr: Si un e-mail est crypté et non protégé par un mot de passe, vous devrez avoir la clé de cryptage avant que le contenu du message ne soit lisible.

source: 5 email security best practices
fr: 5 meilleures pratiques de sécurité par e-mail

source: Knowing how to encrypt email messages is a great start to improving your email security. With the following steps, you’ll make it more difficult for hackers to get into your email. These practices and other identity management routines can help you better protect your information.
fr: Savoir comment crypter les e-mails est un excellent début pour améliorer la sécurité de votre e-mail. Avec les étapes suivantes, vous rendra plus difficile pour les pirates de pénétrer dans votre e-mail. Ces pratiques et autres routines de gestion de l'identité peuvent vous aider à mieux protéger vos informations.

source: Email Security Best Practices
fr: Meilleures pratiques de sécurité par e-mail

source: 1. Create strong email passwords
fr: 1. Créer des mots de passe de messagerie solides

source: Cyberattacks and data breaches are not only carried out using session hijacking or brute force attacks. Today’s cybercriminals also use strategic methods, like credential stuffing, to access sensitive information. Having a well-thought-out and unique password can lessen the likelihood of you falling victim to these kinds of cyberattacks.
fr: Les cyberattaques et les violations de données ne sont pas seulement effectuées à l'aide de détournement de session ou d'attaques par force brute. Les cybercriminels d’aujourd’hui utilisent également des méthodes stratégiques, comme la farce des informations d'identification, pour accéder aux informations sensibles. Avoir un mot de passe bien pensé et unique peut réduire la probabilité que vous soyez victime de ce type de cyberattaques.

source: Because remembering several unique and difficult passwords can be tough, you should consider using a password manager.
fr: Étant donné que vous souvenir de plusieurs mots de passe uniques et difficiles peut être difficile, vous devriez envisager d'utiliser un gestionnaire de mots de passe.

source: 2. Use two-factor authentication
fr: 2. Utilisez l'authentification à deux facteurs

source: Two-factor authentication (2FA), a type of multifactor authentication, adds another step to your login process to keep unauthorized users from gaining access to your account. Email providers like Gmail and Outlook are already using these tools.
fr: L'authentification à deux facteurs (2FA), un type d'authentification multifactorielle, ajoute une autre étape à votre processus de connexion pour empêcher les utilisateurs non autorisés d'accéder à votre compte. Les fournisseurs de courriels comme Gmail et Outlook utilisent déjà ces outils.

source: Some 2FA uses biometrics, like a fingerprint or FaceID, and a password before logging in. Others will send a text message to your device with a code you’ll need to log in. These login requirements are usually inaccessible to everyday hackers, meaning your email will be more secure.
fr: Certains 2FA utilisent la biométrie, comme une empreinte digitale ou un FACEID, et un mot de passe avant de vous connecter. D'autres enverront un message texte à votre appareil avec un code que vous devrez vous connecter. Ces exigences de connexion sont généralement inaccessibles aux pirates quotidiens, ce qui signifie que votre Le courrier électronique sera plus sécurisé.

source: 3. Beware of phishing emails
fr: 3. Méfiez-vous des e-mails de phishing

source: Hackers use phishing scams to access people's private information. One common type of phishing involves a scammer sending emails embedded with links leading to malicious websites designed to trick you into entering your login credentials. Those credentials are then saved and used to access your actual accounts.
fr: Les pirates utilisent des escroqueries à phishing pour accéder aux informations privées des gens. Un type commun de phishing implique un escroc envoyant des e-mails intégrés avec des liens menant à des sites Web malveillants conçus pour vous inciter à saisir vos informations d'identification de connexion. Ces informations d'identification sont ensuite enregistrées et utilisées pour accéder à vos comptes réels.

source: Always verify that you're on a site’s proper URL, and try to avoid opening emails that appear to be suspicious.
fr: Vérifiez toujours que vous êtes sur URL approprié d'un site et essayez d'éviter d'ouvrir des e-mails qui semblent suspects.

source: 4. Avoid accessing emails via public Wi-Fi
fr: 4. Évitez d'accéder aux e-mails via le Wi-Fi public

source: Whether you’re checking your account balances while in line for coffee or checking your email while at lunch, if you’re doing it on a public Wi-Fi network, your data is at risk. Public Wi-Fi networks make it easy for cybercriminals to hack and siphon off information from everyday people because they’re often unencrypted.
fr: Que vous vérifiiez les soldes de votre compte en ligne pour le café ou que vous vérifiiez votre e-mail pendant le déjeuner, si vous le faites sur un réseau Wi-Fi public, vos données sont en danger. Les réseaux Wi-Fi publics permettent aux cybercriminels de pirater et de siphonner les informations de tous les jours car elles ne sont souvent pas cryptées.

source: If you’re using public Wi-Fi, consider downloading a virtual private network (VPN) to put a protective shield over your device.
fr: Si vous utilisez un Wi-Fi public, envisagez de télécharger un réseau privé virtuel (VPN) pour mettre un bouclier protecteur sur votre appareil.

source: 5. Always log out when finished
fr: 5. Toujours se déconnecter une fois terminé

source: You should always log out of your email account after you've finished using it. This applies to when you're on both unfamiliar and familiar devices. If a hacker enters a protected network, you don’t want them to have a clear pathway toward the information they’re looking for by leaving your accounts wide open.
fr: Vous devez toujours vous connecter de votre compte de messagerie après avoir fini de l'utiliser. Cela s'applique lorsque vous êtes sur des appareils inconnus et familiers. Si un pirate entre dans un réseau protégé, vous ne voulez pas qu'ils aient une voie claire vers les informations qu'ils recherchent en laissant vos comptes grands ouverts.

source: FAQs about encrypting email
fr: FAQ sur le cryptage des e-mails

source: Still have questions about encrypting email messages? We have answers.
fr: Vous avez encore des questions sur le chiffrement des e-mails? Nous avons des réponses.

source: How do I password-protect an email attachment?
fr: Comment puis-je protéger une pièce jointe par e-mail?

source: It depends. For some types of attachments, you can save them with a password requirement. Other types of attachments can be password-protected within an email system, though this feature is not available for all providers.
fr: Ça dépend. Pour certains types de pièces jointes, vous pouvez les enregistrer avec une exigence de mot de passe. D'autres types de pièces jointes peuvent être protégées par mot de passe dans un système de messagerie, bien que cette fonctionnalité ne soit pas disponible pour tous les fournisseurs.

source: Is it a good idea to encrypt your email?
fr: Est-ce une bonne idée de crypter votre e-mail?

source: It is usually a good idea to encrypt your email, especially if you’re sharing any information you’d like to keep private. If somebody hacks your email, having certain types of email encryption can prevent the hacker from reading your messages.
fr: C'est généralement une bonne idée de crypter votre e-mail, surtout si vous partagez des informations que vous souhaitez garder privées. Si quelqu'un pirate votre e-mail, avoir certains types de chiffrement des e-mails peut empêcher le pirate de lire vos messages.

source: What is the difference between encrypted email and secure email?
fr: Quelle est la différence entre les e-mails cryptés et les e-mails sécurisés?

source: Encrypted emails are messages that are themselves encrypted, meaning that they are secure whether they’re in your sent messages or the inbox of the intended recipient. Secure email means that the data in an email account is secure within the system, but individual emails are not necessarily encrypted.
fr: Les e-mails cryptés sont des messages qui sont eux-mêmes cryptés, ce qui signifie qu'ils sont sécurisés s'ils sont dans vos messages envoyés ou la boîte de réception du destinataire prévu. Un e-mail sécurisé signifie que les données d'un compte de messagerie sont sécurisées dans le système, mais les e-mails individuels ne sont pas nécessairement cryptés.

source: GUIDE on How to Setup Two Factor Authentication
fr: Guide sur la façon de configurer l'authentification à deux facteurs

source: Two Factor Authentication (2FA)
fr: Authentification à deux facteurs (2FA)

source: Two-factor authentication for beginners
fr: Authentification à deux facteurs pour les débutants

source: US Norton Blog - 2FA: A simplified guide to two-factor authentication
fr: US Norton Blog - 2FA: un guide simplifié de l'authentification à deux facteurs

source: 2FA Approaches
fr: Approches 2FA

source: There are a few simple, widely supported approaches for adding 2FA to your accounts. There’s not one “right” way to use it, and each has distinct considerations for security and convenience.
fr: Il existe quelques approches simples et largement prises en charge pour ajouter 2FA à vos comptes. Il n'y a pas une «bonne» façon de l'utiliser, et chacune a des considérations distinctes pour la sécurité et la commodité.

source: A pretty good option: SMS text messages
fr: Une assez bonne option: SMS SMS

source: Most services allow you to use regular old text messages as your 2FA. When logging in to a site you need a password for, you’ll receive a short confirmation code on your mobile device. Enter the code when prompted during login.
fr: La plupart des services vous permettent d'utiliser les anciens messages texte réguliers comme 2FA. Lorsque vous vous connectez à un site pour lequel vous avez besoin d'un mot de passe, vous recevrez un court code de confirmation sur votre appareil mobile. Entrez le code lorsque vous êtes invité pendant la connexion.

source: SMS Authentication
fr: Authentification SMS

source: Text messages are a painless way to access 2FA codes, but are only as reliable as the phone network. For example, if you lose network access or travel outside the country, you might not be able to receive the messages.Text messages are a painless way to access 2FA codes, but are only as reliable as the phone network. For example, if you lose network access or travel outside the country, you might not be able to receive the messages.
fr: Les messages texte sont un moyen indolore d'accéder aux codes 2FA, mais ne sont aussi fiables que le réseau téléphonique. Par exemple, si vous perdez l'accès au réseau ou que vous voyagez en dehors du pays, vous ne pourrez peut-être pas recevoir les messages. Par exemple, si vous perdez un accès au réseau ou que vous voyagez en dehors du pays, vous ne pourrez peut-être pas recevoir les messages.

source: For most people, SMS-based 2FA is much better than using a password alone. But because telephone infrastructure itself comes with a great deal of baggage, SMS isn’t the most secure method available.
fr: Pour la plupart des gens, le 2FA basé sur SMS est bien meilleur que d'utiliser un mot de passe seul. Mais parce que l'infrastructure téléphonique elle-même est livrée avec beaucoup de bagages, SMS n'est pas la méthode la plus sécurisée disponible.

source: For example, Associated Press writer Fatima Hussein told the story of how someone stole her phone number so they could take over her bank account for financial fraud. The attacker convinced her phone provider, Cricket Wireless, to transfer her number to a new SIM card on a remote device, allowing the attacker to intercept her 2FA messages.
fr: Par exemple, l'écrivain d'Associated Press, Fatima Hussein, a raconté comment quelqu'un a volé son numéro de téléphone afin qu'il puisse reprendre son compte bancaire pour la fraude financière. L'attaquante a convaincu son fournisseur de téléphone, Cricket Wireless, de transférer son numéro sur une nouvelle carte SIM sur un appareil distant, permettant à l'attaquant d'intercepter ses messages 2FA.

source: That sounds scary, but remember the real story here: The attacker was forced to work much harder than if they could simply have entered a password.
fr: Cela semble effrayant, mais rappelez-vous la vraie histoire ici: l'attaquant a été obligé de travailler beaucoup plus dur que s'il aurait pu simplement saisir un mot de passe.

source: Better option: Authentication apps
fr: Meilleure option: applications d'authentification

source: Compared to SMS messages, authenticator apps are a little more convenient and a lot more secure. Some services allow you to receive your temporary login code from a mobile app. There are many options to choose from, such as Google Authenticator or Authy.
fr: Par rapport aux messages SMS, les applications d'authentificateur sont un peu plus pratiques et beaucoup plus sécurisées. Certains services vous permettent de recevoir votre code de connexion temporaire à partir d'une application mobile. Il existe de nombreuses options à choisir, comme Google Authenticator ou Authy.

source: Authentication Apps
fr: Applications d'authentification

source: Some web services let you attach multiple authentication apps to the same account, which can be incredibly helpful for getting login codes when multiple people need access. Authenticator apps are also great because they work when you don’t have access to your phone network.
fr: Certains services Web vous permettent de joindre plusieurs applications d'authentification au même compte, ce qui peut être incroyablement utile pour obtenir des codes de connexion lorsque plusieurs personnes ont besoin d'accès. Les applications d'authentification sont également excellentes car elles fonctionnent lorsque vous n'avez pas accès à votre réseau téléphonique.

source: Unlike SMS messages, authenticator apps can’t be intercepted on the phone network, making apps a hardened option.
fr: Contrairement aux messages SMS, les applications Authenticator ne peuvent pas être interceptées sur le réseau téléphonique, faisant des applications une option durcie.

source: But, just as you can be phished into entering passwords into a fraudulent website to steal your login information, the same is true of authenticator codes. So we can do even better.
fr: Mais, tout comme vous pouvez être lancé dans la saisie des mots de passe dans un site Web frauduleux pour voler vos informations de connexion, il en va de même pour les codes d'authentification. Nous pouvons donc faire encore mieux.

source: Best option: Security keys
fr: Meilleure option: touches de sécurité

source: Right now, security keys are one of the most secure and efficient ways to use 2FA. A security key is a physical USB device you can use to authenticate into your account.
fr: À l'heure actuelle, les clés de sécurité sont l'un des moyens les plus sécurisés et les plus efficaces d'utiliser 2FA. Une clé de sécurité est un périphérique USB physique que vous pouvez utiliser pour vous authentifier dans votre compte.

source: Instead of typing in a code when prompted to provide your 2FA credentials, you insert your security key into your device and physically tap it when prompted during login. That’s all. Security keys are fairly resistant to phishing attacks, making them one of the best options available. Unlike code-based 2FA, phishing sites don’t have a great way to intercept information from security keys.
fr: Au lieu de taper un code lorsque vous êtes invité à fournir vos informations d'identification 2FA, vous insérez votre clé de sécurité dans votre appareil et appuyez physiquement à l'inviter lors de la connexion. C’est tout. Les clés de sécurité sont assez résistantes aux attaques de phishing, ce qui en fait l'une des meilleures options disponibles. Contrairement au 2FA basé sur le code, les sites de phishing n'ont pas un excellent moyen d'intercepter les informations des clés de sécurité.

source: The main problem with security keys is that as soon as you try one, you’ll want to use them everywhere. And they can’t be used everywhere yet.
fr: Le principal problème avec les clés de sécurité est que dès que vous en essayez un, vous voudrez les utiliser partout. Et ils ne peuvent pas encore être utilisés partout.

source: Security keys are not yet as well supported as authenticator apps, but the standard is getting traction on large websites. It can be used to log into Google, Facebook, Dropbox, and other services. Security keys are supported by most major browsers.
fr: Les clés de sécurité ne sont pas encore aussi bien prises en charge que les applications d'authentificateur, mais la norme est de traction sur de grands sites Web. Il peut être utilisé pour se connecter à Google, Facebook, Dropbox et d'autres services. Les clés de sécurité sont prises en charge par la plupart des principaux navigateurs.

source: FAQs about 2FA
fr: FAQ sur 2FA

source: Check out some frequently asked questions concerning the 2FA login process.
fr: Découvrez quelques questions fréquemment posées concernant le processus de connexion 2FA.

source: Is 2FA safe?
fr: 2FA est-il sûr?

source: For the most part, 2FA is safe. Still, like most online activities, there are ways that criminals can bypass 2FA security and access your account. For example, lost password recovery usually resets your password via email, and it can bypass 2FA.
fr: Pour la plupart, 2FA est sûr. Pourtant, comme la plupart des activités en ligne, il existe des moyens que les criminels puissent contourner la sécurité 2FA et accéder à votre compte. Par exemple, la récupération de mot de passe perdue réinitialise généralement votre mot de passe par e-mail et peut contourner 2FA.

source: Even though it's not 100%% secure, 2FA can bolster your online security and is recommended.
fr: Même si ce n'est pas 100%% sécurisé, 2FA peut renforcer votre sécurité en ligne et est recommandé.

source: Can two-step verification be hacked?
fr: La vérification en deux étapes peut-elle être piratée?

source: Yes, hackers can use certain phishing messages to work around 2FA login processes. That being said, having a second authentication factor makes it more difficult for hackers because more information is required to gain access.
fr: Oui, les pirates peuvent utiliser certains messages de phishing pour travailler autour des processus de connexion 2FA. Cela étant dit, avoir un deuxième facteur d'authentification rend plus difficile pour les pirates, car plus d'informations sont nécessaires pour accéder.
