Repository: sarryteng/lvl4-individual-project
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: If all the above steps fail, and you still think your iPhone may have a virus, then it’s time to use an antivirus app to help detect malware on your phone. Norton 360 for Mobile checks for the latest security patches and iOS updates, filters spam texts to help protect against phishing attacks, and notifies you if you’re using a potentially unsafe Wi-Fi network.
fr: Si toutes les étapes ci-dessus échouent et que vous pensez toujours que votre iPhone peut avoir un virus, il est temps d'utiliser une application antivirus pour aider à détecter les logiciels malveillants sur votre téléphone. Norton 360 pour les vérifications mobiles pour les derniers correctifs de sécurité et les mises à jour iOS, filtre les textes de spam pour aider à protéger contre les attaques de phishing et vous avertit si vous utilisez un réseau Wi-Fi potentiellement dangereux.

source: How to get rid of viruses on your iPhone
fr: Comment se débarrasser des virus sur votre iPhone

source: Running an iOS antivirus scan with a security app like Norton 360 for Mobile is an effective way to remove iPhone viruses. As well as helping you identity a virus or other malware infection on your iPhone, it can also help secure your iPhone in real time by blocking infections before they spread to your device.
fr: L'exécution d'une analyse antivirus iOS avec une application de sécurité comme Norton 360 pour mobile est un moyen efficace de supprimer les virus iPhone. En plus de vous aider à identifier un virus ou une autre infection de logiciels malveillants sur votre iPhone, il peut également aider à sécuriser votre iPhone en temps réel en bloquant les infections avant de se propager à votre appareil.

source: Keep reading and follow the methods below to learn how to remove iOS viruses and malware:
fr: Continuez à lire et suivez les méthodes ci-dessous pour apprendre à supprimer les virus iOS et les logiciels malveillants:

source: Clean up your device
fr: Nettoyez votre appareil

source: The first step is to wipe your iPhone clean of the most likely sources of infection. To do this, delete suspicious apps, particularly those you downloaded right before you noticed signs of an infection. To help remove lingering traces of malicious code, clear your app and browser caches, such as iMessage cookies.
fr: La première étape consiste à essuyer votre iPhone propre des sources d'infection les plus probables. Pour ce faire, supprimez les applications suspectes, en particulier celles que vous avez téléchargées juste avant de remarquer les signes d'une infection. Pour aider à éliminer les traces persistantes de code malveillant, effacez votre application et vos caches de navigateur, tels que les cookies iMessage.

source: Restart your iPhone
fr: Redémarrez votre iPhone

source: To help wipe the slate clean, restart your iPhone. Simply power off your phone, wait a few seconds after it finishes shutting down, and turn it on again. Restarting your device can help stop viruses from replicating and spreading further through iOS.
fr: Pour aider à effacer l'ardoise, redémarrez votre iPhone. Éteignez simplement votre téléphone, attendez quelques secondes une fois qu'il a terminé l'arrêt et rallumez-le. Le redémarrage de votre appareil peut aider à empêcher les virus de reproduire et de se propager davantage à travers iOS.

source: Install the latest iOS
fr: Installez le dernier iOS

source: Whether or not the previous steps have managed to purge your iPhone of malware, installing the latest version of iOS will help prevent reinfections and help your phone more effectively quarantine viruses in your system.
fr: Que les étapes précédentes aient réussi à purger ou non votre iPhone de malware, l'installation de la dernière version d'iOS aidera à prévenir les réinfections et aidera votre téléphone à mettre en quarantaine les virus dans votre système.

source: To update your iOS, go to
fr: Pour mettre à jour votre iOS, allez à

source: Settings
fr: Paramètres

source: General
fr: Général

source: Software Update
fr: Mise à jour logicielle

source: and install any available software updates.
fr: et installer toutes les mises à jour logicielles disponibles.

source: Restore from a backup or reset to factory settings
fr: Restaurer à partir d'une sauvegarde ou réinitialiser les paramètres d'usine

source: To manually remove more advanced and stubborn malware, you may have to restore your iPhone to a previously backed-up version from before the malware infection hit.
fr: Pour supprimer manuellement les logiciels malveillants plus avancés et obstinés, vous devrez peut-être restaurer votre iPhone sur une version précédemment sauvegardée avant l'infection malveillante.

source: You can restore a clean backup from iCloud by following these steps:
fr: Vous pouvez restaurer une sauvegarde propre à partir de iCloud en suivant ces étapes:

source: Go to
fr: Aller à

source: Transfer or Reset iPhone
fr: Transférer ou réinitialiser l'iPhone

source: Select
fr: Sélectionner

source: Erase All Content and Settings
fr: Effacer tous les contenus et paramètres

source: Erase Now
fr: Effacer maintenant

source: and follow the on-screen prompts to continue.
fr: et suivez les invites à l'écran pour continuer.

source: During rebooting, your iPhone will show the
fr: Pendant le redémarrage, votre iPhone affichera le

source: Apps &amp; Data
fr: Applications & amp; Données

source: page, where you can select
fr: page, où vous pouvez sélectionner

source: Restore from iCloud Backup
fr: Restaurer à partir de la sauvegarde iCloud

source: Sign into iCloud and choose the backed-up iOS version to restore.
fr: Connectez-vous à iCloud et choisissez la version iOS sauvegardée pour restaurer.

source: If all else fails and you don’t have a backup to restore from, you should try performing a factory reset, which will
fr: Si tout le reste échoue et que vous n'avez pas de sauvegarde à restaurer, vous devriez essayer d'effectuer une réinitialisation d'usine, qui

source: erase all the data from your device
fr: Effacez toutes les données de votre appareil

source: Along with purging any viruses, a factory reset will also wipe your photos, files, apps, and settings—so proceed accordingly.
fr: En plus de purger tous les virus, une réinitialisation d'usine essuiera également vos photos, fichiers, applications et paramètres, alors continuez en conséquence.

source: To factory reset your iPhone, follow the same steps as above—the only difference is that you won’t be able to restore a backed-up version of your phone’s memory during the reboot.
fr: Pour réinitialiser votre iPhone, suivez les mêmes étapes que ci-dessus - la seule différence est que vous ne pourrez pas restaurer une version sauvegardée de la mémoire de votre téléphone pendant le redémarrage.

source: Preventing iPhone viruses
fr: Prévenir les virus iPhone

source: Apple’s iOS has iPhone security features that make malware infiltration relatively rare. iPhones operate in a self-contained ecosystem, using only Apple’s programming and files and allowing app downloads only from the official App Store. That walled garden approach, combined with Apple’s extensive software security, makes it hard for malware to infiltrate.
fr: L'iOS d'Apple possède des fonctionnalités de sécurité iPhone qui rendent l'infiltration de logiciels malveillants relativement rare. Les iPhones fonctionnent dans un écosystème autonome, en utilisant uniquement la programmation et les fichiers d'Apple et n'autorisez les téléchargements des applications que depuis l'App Store officiel. Cette approche de jardin clos, combinée à la vaste sécurité logicielle d'Apple, rend difficile pour les logiciels malveillants d'infiltrer.

source: There’s no way to prevent all iPhone viruses, but there are basic and essential steps you can take to help shield your device from malicious software:
fr: Il n'y a aucun moyen d'éviter tous les virus iPhone, mais il existe des mesures de base et essentielles que vous pouvez prendre pour vous aider à protéger votre appareil à partir d'un logiciel malveillant:

source: Don’t jailbreak
fr: Ne pas jailbreaker

source: Sticking to the standard iOS configuration and not jailbreaking your phone reduces the chances that an iPhone virus infects your phone. iOS comes with built-in security features, and the company’s walled garden approach to software means that apps on the App Store are vetted before becoming available to download. Unless you have a good reason (e.g, you’re a researcher), you shouldn’t try to jailbreak your iPhone.
fr: S'en tenir à la configuration iOS standard et non jailbreaking, votre téléphone réduit les chances qu'un virus iPhone infecte votre téléphone. L'iOS est livré avec des fonctionnalités de sécurité intégrées, et l'approche de jardin clos de la société signifie que les applications sur l'App Store sont vérifiées avant de devenir disponibles en téléchargement. À moins que vous n'ayez une bonne raison (par exemple, vous êtes un chercheur), vous ne devriez pas essayer de jailbreaker votre iPhone.

source: Download apps only from the App Store
fr: Télécharger les applications uniquement à partir de l'App Store

source: Apple’s App Store is the safest place to download the apps you need for your iPhone. Downloading or installing apps from unverified third-party sources can increase the risk of exposing your device to iPhone malware.
fr: L'App Store d'Apple est l'endroit le plus sûr pour télécharger les applications dont vous avez besoin pour votre iPhone. Le téléchargement ou l'installation d'applications à partir de sources tierces non vérifiées peut augmenter le risque d'exposer votre appareil aux logiciels malveillants iPhone.

source: Stay alert to potential risks
fr: Restez attentif aux risques potentiels

source: Although iOS may be safer than other operating systems, no computing system is 100%% secure—you also have a part to play. Take care not to open unknown, unexpected, or suspicious links you receive in emails or messages, even if they come from close friends or family. And make sure you use secure Wi-Fi networks and understand the risks of using public Wi-Fi.
fr: Bien que iOS puisse être plus sûr que les autres systèmes d'exploitation, aucun système informatique n'est à 100%%, vous avez également un rôle à jouer. Veillez à ne pas ouvrir des liens inconnus, inattendus ou suspects que vous recevez dans les e-mails ou les messages, même s'ils viennent d'amis proches ou de famille. Et assurez-vous d'utiliser des réseaux Wi-Fi sécurisés et de comprendre les risques d'utiliser le Wi-Fi public.

source: Permissions and updates
fr: Autorisation et mises à jour

source: Even if you trust all the apps on your iPhone, be careful about what permissions you give them. Being careful with the permissions you grant helps protect your private data if an app becomes compromised by malware. It will also ensure that an app which turns out to be malicious will be less capable of spreading viruses to other apps on your iPhone.
fr: Même si vous faites confiance à toutes les applications de votre iPhone, faites attention aux autorisations que vous leur donnez. Faire attention aux autorisations que vous accordez aide à protéger vos données privées si une application est compromise par des logiciels malveillants. Il garantira également qu'une application qui se révèle malveillante sera moins capable de diffuser des virus à d'autres applications de votre iPhone.

source: Signs your Android phone may have a virus or other malware
fr: Signes Votre téléphone Android peut avoir un virus ou d'autres logiciels malveillants

source: Phones can be vulnerable to damage externally and internally. While the external damage is usually visible, internal damage is usually hidden from view.
fr: Les téléphones peuvent être vulnérables aux dommages à l'extérieur et en interne. Bien que les dommages externes soient généralement visibles, les dommages internes sont généralement cachés à la vue.

source: Malware like viruses is known to perform repeated tasks that can take up resources on your devices. Signs of malware may show up in these ways:
fr: Les logiciels malveillants comme les virus sont connus pour effectuer des tâches répétées qui peuvent prendre des ressources sur vos appareils. Des signes de logiciels malveillants peuvent apparaître de cette manière:

source: Your phone is too slow.
fr: Votre téléphone est trop lent.

source: Apps take longer to load.
fr: Les applications prennent plus de temps à charger.

source: The battery drains faster than expected.
fr: La batterie s'écoule plus rapidement que prévu.

source: There is an abundance of pop-up ads.
fr: Il y a une abondance d'annonces pop-up.

source: Your phone has apps you don’t remember downloading.
fr: Votre téléphone a des applications dont vous ne vous souvenez pas avoir téléchargé.

source: Unexplained data usage occurs.
fr: Une utilisation inexpliquée des données se produit.

source: Higher phone bills arrive.
fr: Les factures de téléphone plus élevées arrivent.

source: How to check for viruses and other malware on your Android phone
fr: Comment vérifier les virus et autres logiciels malveillants sur votre téléphone Android

source: A good way to check for malware on your Android phone is to run an antivirus scan.
fr: Un bon moyen de vérifier les logiciels malveillants sur votre téléphone Android consiste à exécuter une analyse antivirus.

source: Before buying antivirus software for your phone, make sure you consider the most comprehensive product that’s available for your device.
fr: Avant d'acheter un logiciel antivirus pour votre téléphone, assurez-vous de considérer le produit le plus complet disponible pour votre appareil.

source: There are many antivirus software choices available on the market. Some are free, and some are sold.
fr: Il existe de nombreux choix de logiciels antivirus disponibles sur le marché. Certains sont gratuits et certains sont vendus.

source: It’s a good idea to do your research to ensure the security software you invest in runs a complete scan and doesn’t overlook any vulnerabilities. An incomplete scan could give you a false sense of security when, in fact, your device could be vulnerable to cyberattacks.
fr: C'est une bonne idée de faire vos recherches pour garantir que le logiciel de sécurité que vous investissez dans une analyse complète et n'oublie aucune vulnérabilité. Un scan incomplet pourrait vous donner un faux sentiment de sécurité lorsque, en fait, votre appareil pourrait être vulnérable aux cyberattaques.

source: How to remove viruses and other malware from your Android device
fr: Comment supprimer les virus et autres logiciels malveillants de votre appareil Android

source: If you think you have malware on your phone, it’s important to stop the malware from causing any further damage. Here are a few steps you can take:
fr: Si vous pensez avoir des logiciels malveillants sur votre téléphone, il est important d'empêcher le malware de causer d'autres dommages. Voici quelques étapes que vous pouvez prendre:

source: Power off the phone and reboot in safe mode. Press the power button to access the Power Off options. Most Android phones come with the option to restart in Safe Mode. Here’s how, according to Google, although Safe Mode can vary by phone: Press your phone's power button. When the animation starts, press and hold your phone's volume down button. Hold it until the animation ends and your phone restarts. You'll see “Safe mode” at the bottom of your screen.
fr: Éteignez le téléphone et redémarrez en mode sans échec. Appuyez sur le bouton d'alimentation pour accéder aux options de mise hors tension. La plupart des téléphones Android sont livrés avec la possibilité de redémarrer en mode sans échec. Voici comment, selon Google, bien que le mode sûr puisse varier selon le téléphone: appuyez sur le bouton d'alimentation de votre téléphone. Lorsque l'animation démarre, appuyez et maintenez le bouton Volume Down de votre téléphone. Tenez-le jusqu'à la fin de l'animation et que votre téléphone redémarre. Vous verrez «mode sûr» en bas de votre écran.

source: Uninstall the suspicious app. Find the app in Settings and uninstall or force close it. This may not completely remove the malware, but it could prevent further damage to your device, or from it transmitting the malware to other devices on your network.
fr: Désinstaller l'application suspecte. Trouvez l'application dans les paramètres et désinstallez ou forcez-le. Cela peut ne pas supprimer complètement les logiciels malveillants, mais cela pourrait empêcher d'autres dommages à votre appareil ou transmettre les logiciels malveillants à d'autres appareils de votre réseau.

source: Look for other apps you think may be infected. There’s a chance that some apps may have been infected by the malware. If you think you can identify those apps, delete them immediately.
fr: Recherchez d'autres applications qui, selon vous, peuvent être infectées. Il y a une chance que certaines applications aient été infectées par le malware. Si vous pensez que vous pouvez identifier ces applications, supprimez-les immédiatement.

source: Install a robust mobile security app on your phone.
fr: Installez une application de sécurité mobile robuste sur votre téléphone.

source: Tips to help protect your Android device against viruses and other malware
fr: Conseils pour aider à protéger votre appareil Android contre les virus et autres logiciels malveillants

source: Here are seven key steps you can take to help protect against future risks.
fr: Voici sept étapes clés que vous pouvez prendre pour aider à protéger contre les risques futurs.

source: Invest in and use robust security software to protect your Android device.
fr: Investissez et utilisez un logiciel de sécurité robuste pour protéger votre appareil Android.

source: Keep all operating systems and software updated with the latest versions.
fr: Gardez tous les systèmes d'exploitation et logiciels à jour avec les dernières versions.

source: Don’t click on suspicious or unfamiliar links in emails and text messages.
fr: Ne cliquez pas sur les liens suspects ou inconnus dans les e-mails et les SMS.

source: Use strong, complicated passwords or a password manager.
fr: Utilisez des mots de passe forts et compliqués ou un gestionnaire de mots de passe.

source: Never use unsecure Wi-Fi connections. Always use a VPN when connecting to public Wi-Fi.
fr: N'utilisez jamais de connexions Wi-Fi non sécurisées. Utilisez toujours un VPN lors de la connexion au Wi-Fi public.

source: Always use strong cyber safety protection on all devices that connect to the internet.
fr: Utilisez toujours une forte protection contre la cyber-sécurité sur tous les appareils qui se connectent à Internet.

source: Always install apps from trusted sources, such as the Google Play Store. Read the fine print and permissions on the apps to understand how much access you are giving the app developers.
fr: Installez toujours les applications à partir de sources de confiance, telles que le Google Play Store. Lisez les petits caractères et les autorisations sur les applications pour comprendre dans quelle mesure vous donnez un accès aux développeurs d'applications.

source: GUIDE on How to Prevent Identity Theft
fr: Guide sur la façon d'éviter le vol d'identité

source: US Norton Blog - Identity theft: What is it, how it works, and common warning signs
fr: US Norton Blog - Vol d'identité: qu'est-ce que c'est, comment cela fonctionne et des signes d'avertissement communs

source: Warning signs of identity theft
fr: Signes d'avertissement de vol d'identité

source: ID theft warning signs can include:
fr: Les panneaux d'avertissement de vol d'identification peuvent inclure:

source: Unexplained financial activity:
fr: Activité financière inexpliquée:

source: Charges, accounts, or withdrawals on your bank statements or credit card reports that you don't recognize.
fr: Frais, comptes ou retraits sur vos relevés bancaires ou rapports de cartes de crédit que vous ne reconnaissez pas.

source: Unexpected calls from debt collectors:
fr: Appels inattendus des agents de recouvrement:

source: Phone calls from collection agencies about debts you aren’t aware of.
fr: Appels téléphoniques des agences de recouvrement sur les dettes dont vous n'êtes pas au courant.

source: Missing mail or bills:
fr: Mail ou factures manquantes:

source: Important documents you were expecting never arrived, especially those containing financial information.
fr: Des documents importants auxquels vous attendiez n'est jamais arrivé, en particulier ceux contenant des informations financières.

source: Errors on credit reports:
fr: Erreurs sur les rapports de crédit:

source: Inaccuracies on your credit report, such as accounts you haven't opened, inquiries you didn't initiate, or incorrect personal information.
fr: Les inexactitudes sur votre rapport de crédit, telles que les comptes que vous n'avez pas ouverts, les demandes que vous n'avez pas lancées ou les informations personnelles incorrectes.

source: Warning Signs of Identity Theft
fr: Signes d'avertissement de vol d'identité

source: These are four common red flags of identity theft to look out for. And now that you know what identity theft may look like, here are the steps to take if you know or suspect you’re a victim.
fr: Ce sont quatre drapeaux rouges communs de vol d'identité à surveiller. Et maintenant que vous savez à quoi peut ressembler le vol d'identité, voici les étapes à prendre si vous savez ou soupçonnez que vous êtes une victime.

source: What to do if you're a victim of identity theft
fr: Que faire si vous êtes victime de vol d'identité

source: If you’re a victim of ID theft, you need to mitigate damage quickly. Here are the immediate steps you should take to report identity theft.
fr: Si vous êtes victime de vol d'identité, vous devez atténuer rapidement les dommages. Voici les étapes immédiates que vous devez prendre pour signaler le vol d'identité.

source: If you are a victim of Identity Theft
fr: Si vous êtes victime de vol d'identité

source: Contact financial institutions and companies where the fraud occurred:
fr: Contactez les institutions financières et les entreprises où la fraude s'est produite:

source: Alert your bank, credit card companies, and other financial institutions about the identity theft. Also, contact the companies where the fraud occurred.
fr: Alertez votre banque, vos sociétés de cartes de crédit et d'autres institutions financières sur le vol d'identité. Contactez également les entreprises où la fraude s'est produite.

source: Freeze credit reports:
fr: Freeze Credit Rapports:

source: Contact the three major credit bureaus (Equifax®, Experian®, and TransUnion®) to freeze your credit report. This can help prevent criminals from opening new lines of credit in your name. You can also place a fraud alert on your report by contacting any of the major bureaus who must then alert the others.
fr: Contactez les trois principaux bureaux de crédit (Equifax®, Experian® et TransUnion®) pour geler votre rapport de crédit. Cela peut aider à empêcher les criminels d'ouvrir de nouvelles lignes de crédit à votre nom. Vous pouvez également placer une alerte de fraude sur votre rapport en contactant l'un des principaux bureaux qui doivent ensuite alerter les autres.

source: File a report with law enforcement:
fr: Déposer un rapport auprès des forces de l'ordre:
