Repository: sarryteng/lvl4-individual-project
Catalog: src/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: If you want to make your computer faster, one of the easiest ways is to update your software. Older software versions operate using legacy code and protocols, but engineers are constantly making tweaks to improve performance and reduce resource usage. With more RAM available, your devices can do more—and do it quicker.
fr: Si vous souhaitez accélérer votre ordinateur, l'un des moyens les plus simples est de mettre à jour votre logiciel. Les versions logicielles plus anciennes fonctionnent à l'aide du code hérité et des protocoles, mais les ingénieurs font constamment des ajustements pour améliorer les performances et réduire l'utilisation des ressources. Avec plus de RAM disponible, vos appareils peuvent faire plus et le faire plus rapidement.

source: Reliably high performance is vital for running multiple programs simultaneously, watching high-definition videos, playing the newest games, taking the best pictures and videos, and even browsing the internet.
fr: De manière fiable, des performances élevées sont essentielles pour exécuter plusieurs programmes simultanément, regarder des vidéos haute définition, jouer aux jeux les plus récents, prendre les meilleures photos et vidéos et même parcourir Internet.

source: Software updates help protect others
fr: Les mises à jour logicielles aident à protéger les autres

source: The internet is a giant, interconnected network of devices. Because of the links between systems all over the globe, keeping your devices updated and free of malware and viruses that spread through networks is like covering your mouth when you cough in public.
fr: Internet est un réseau géant et interconnecté d'appareils. En raison des liens entre les systèmes du monde entier, garder vos appareils mis à jour et exempts de logiciels malveillants et des virus qui se propagent dans les réseaux, c'est comme couvrir votre bouche lorsque vous toussez en public.

source: Doing your part can reduce the headaches and economic impacts of cybercrime and malicious software in your neighborhood as well as the farthest corners of the planet. And don’t think you’re less susceptible when using a Mac - Macs can get viruses, too.
fr: Faire votre part peut réduire les maux de tête et les impacts économiques de la cybercriminalité et des logiciels malveillants dans votre quartier ainsi que les coins les plus éloignés de la planète. Et ne pensez pas que vous êtes moins sensible lorsque vous utilisez un Mac - Mac peut également obtenir des virus.

source: What is an operating system update?
fr: Qu'est-ce qu'une mise à jour du système d'exploitation?

source: An operating system update is a new version of an operating system that, along with drivers and other first-party software, tells your computer or mobile device how to run. New versions of operating systems commonly include software patches that fix security flaws, code that improves overall system performance, and changes to how the operating system looks and functions.
fr: Une mise à jour du système d'exploitation est une nouvelle version d'un système d'exploitation qui, avec les pilotes et autres logiciels de premier parti, indique à votre ordinateur ou à un appareil mobile comment s'exécuter. Les nouvelles versions des systèmes d'exploitation incluent généralement des correctifs logiciels qui corrigent les défauts de sécurité, le code qui améliore les performances globales du système et les modifications de l'apparence et des fonctions du système d'exploitation.

source: LEARN about Two Factor Authentication
fr: Découvrez l'authentification à deux facteurs

source: What is 2FA?
fr: Qu'est-ce que 2FA?

source: 2FA, or two-factor authentication, is when a site or app requires you to enter an extra form of identification to verify your identity and log into your account.
fr: 2FA, ou l'authentification à deux facteurs, c'est quand un site ou une application vous oblige à saisir un formulaire d'identification supplémentaire pour vérifier votre identité et vous connecter à votre compte.

source: 2FA requires people to verify their identity based on two of the three factors that can confirm identity:
fr: 2FA exige que les gens vérifient leur identité en fonction de deux des trois facteurs qui peuvent confirmer l'identité:

source: Something you know (e.g., a password)
fr: Quelque chose que vous savez (par exemple, un mot de passe)

source: Something you have (e.g., a phone)
fr: Quelque chose que vous avez (par exemple, un téléphone)

source: Something you are (e.g., a fingerprint or facial scan)
fr: Quelque chose que vous êtes (par exemple, une empreinte digitale ou un scanne facial)

source: That extra ID can be a code generated and sent directly through a text message or authenticator app. It can also be in the form of a piece of hardware like a USB drive or a biometric ID like a fingerprint.
fr: Cet ID supplémentaire peut être un code généré et envoyé directement via un SMS ou une application Authenticatrice. Il peut également être sous la forme d'un matériel comme un lecteur USB ou une pièce d'identité biométrique comme une empreinte digitale.

source: Let’s break this down even further, including how two-factor authentication works, types of two-factor authentication, and why two-factor authentication is so important.
fr: Décomposons encore cela, notamment le fonctionnement de l'authentification à deux facteurs, les types d'authentification à deux facteurs, et pourquoi l'authentification à deux facteurs est si importante.

source: What is 2FA
fr: Qu'est-ce que 2FA

source: 2FA vs. multi-factor authentication (MFA)
fr: 2FA vs authentification multi-facteurs (MFA)

source: MFA refers to any type of authentication that requires two or more factors. That means that while 2FA is a form of MFA, not all forms of MFA have only two factors. Increasing the level of security by adding an extra factor makes it much more difficult for hackers to gain entry into a system.
fr: Le MFA fait référence à tout type d'authentification qui nécessite deux facteurs ou plus. Cela signifie que bien que le 2FA soit une forme de MFA, toutes les formes de MFA n'ont pas seulement deux facteurs. L'augmentation du niveau de sécurité en ajoutant un facteur supplémentaire rend beaucoup plus difficile pour les pirates de pénétrer dans un système.

source: How does 2FA work?
fr: Comment fonctionne 2FA?

source: As the name suggests, two-factor authentication requires one extra step—a second factor—to log into an account. The process works as follows:
fr: Comme son nom l'indique, l'authentification à deux facteurs nécessite une étape supplémentaire - un deuxième facteur - pour se connecter à un compte. Le processus fonctionne comme suit:

source: The user enters their username and password.
fr: L'utilisateur entre dans leur nom d'utilisateur et leur mot de passe.

source: The account, platform, or site prompts users to input another verification form, such as a one-time password or code sent to their mobile phone.
fr: Le compte, la plate-forme ou le site invite les utilisateurs à saisir un autre formulaire de vérification, tel qu'un mot de passe ou un code unique envoyé à leur téléphone mobile.

source: The user enters the verification code to access their account.
fr: L'utilisateur entre dans le code de vérification pour accéder à son compte.

source: An ATM card is a good example of two-factor authentication in the real world. In addition to physically presenting the card (something you have), you must also type in your PIN (something you know) to verify your identity and access your account.
fr: Une carte ATM est un bon exemple d'authentification à deux facteurs dans le monde réel. En plus de présenter physiquement la carte (quelque chose que vous avez), vous devez également taper votre broche (quelque chose que vous savez) pour vérifier votre identité et accéder à votre compte.

source: What is 2FA Explained
fr: Qu'est-ce que 2FA expliqué

source: Why is two-factor authentication important?
fr: Pourquoi l'authentification à deux facteurs est-elle importante?

source: Two-factor authentication is important because adding an extra layer of verification before you can access your account means thieves will struggle to get your personal information. As cybercriminals continue to use brute force or password spraying attacks, even if you’re following good password security practices you need 2FA as well. It might seem like a hassle to add an extra step to your web surfing. But without it, you could be leaving yourself vulnerable to:
fr: L'authentification à deux facteurs est importante car l'ajout d'une couche supplémentaire de vérification avant de pouvoir accéder à votre compte signifie que les voleurs auront du mal à obtenir vos informations personnelles. Alors que les cybercriminels continuent d'utiliser des attaques de pulvérisation de force brute ou de mot de passe, même si vous suivez de bonnes pratiques de sécurité de mot de passe, vous avez également besoin de 2FA. Cela peut sembler un problème pour ajouter une étape supplémentaire à votre surf. Mais sans cela, vous pourriez vous laisser vulnérable à:

source: Cybercriminals who want to steal your personal information
fr: Cybercriminels qui veulent voler vos informations personnelles

source: Hackers trying to access your bank accounts
fr: Des pirates qui essaient d'accéder à vos comptes bancaires

source: Thieves breaking into your online credit card portals
fr: Voleurs pénétrant dans vos portails de cartes de crédit en ligne

source: If you add a knowledge factor to your bank account, a cybercriminal who knows your password due to a data breach or phishing operation won’t be able to access the account. This is because your phone will receive the verification code.
fr: Si vous ajoutez un facteur de connaissances à votre compte bancaire, un cybercriminal qui connaît votre mot de passe en raison d'une violation de données ou d'une opération de phishing ne pourra pas accéder au compte. En effet, votre téléphone recevra le code de vérification.

source: That way, those still relying on simple passwords have a better shot at keeping their bank accounts secure.
fr: De cette façon, ceux qui s'appuient toujours sur des mots de passe simples ont une meilleure chance de garder leurs comptes bancaires en sécurité.

source: Statistics of accounts using simple password
fr: Statistiques des comptes utilisant un mot de passe simple

source: Types of 2FA security
fr: Types de sécurité 2FA

source: There are several types of two-factor authentication security, including:
fr: Il existe plusieurs types de sécurité d'authentification à deux facteurs, notamment:

source: Something you know:
fr: Quelque chose que vous savez:

source: These kinds of 2FA use a code, question, or password that are unique to you. Using your PIN at an ATM is a form of 2FA that requires something you know.
fr: Ces types de 2FA utilisent un code, une question ou un mot de passe qui vous sont propres. L'utilisation de votre broche sur un ATM est une forme de 2FA qui nécessite quelque chose que vous savez.

source: Something you have:
fr: Quelque chose que vous avez:

source: This type of 2FA requires users to possess a type of physical token or device, such as a phone or USB token, that they need to use to log in. When you need to enter a code you receive via email or text before you can log in, or when you use an Authenticator app, you’re using this method of 2FA.
fr: Ce type de 2FA oblige les utilisateurs à posséder un type de jeton ou d'appareil physique, tel qu'un téléphone ou un jeton USB, qu'ils doivent utiliser pour vous connecter. Lorsque vous devez saisir un code que vous recevez par e-mail ou texte avant de pouvoir vous connecter Dans ou lorsque vous utilisez une application Authenticator, vous utilisez cette méthode de 2FA.

source: Something you are:
fr: Quelque chose que vous êtes:

source: This type of 2FA requires biometrics like fingerprint or facial recognition or a physical location (confirmed by GPS) to confirm your identity.
fr: Ce type de 2FA nécessite une biométrie comme l'empreinte digitale ou la reconnaissance faciale ou un emplacement physique (confirmé par GPS) pour confirmer votre identité.

source: Types of Factors for 2FA
fr: Types de facteurs pour 2FA

source: 3 benefits of 2FA
fr: 3 avantages du 2FA

source: The added security and protection that two-factor authentication gives you is a net positive. But there are a few extra benefits that you might not know about, including:
fr: La sécurité et la protection supplémentaires que l'authentification à deux facteurs vous donne est un positif net. Mais il y a quelques avantages supplémentaires que vous ne connaissez peut-être pas, notamment:

source: Account monitoring:
fr: Surveillance du compte:

source: You’ll know if someone is trying to access your accounts because you’ll receive a message or prompt on your device. That allows you to report it and further strengthen your security by changing your password to something stronger.
fr: Vous saurez si quelqu'un essaie d'accéder à vos comptes, car vous recevrez un message ou une invite sur votre appareil. Cela vous permet de le signaler et de renforcer davantage votre sécurité en modifiant votre mot de passe en quelque chose de plus fort.

source: Dynamic process:
fr: Processus dynamique:

source: 2FA authenticator apps, push notifications, and texts are generated and sent when you log in, meaning you don’t have to worry about securely storing another factor.
fr: Les applications d'authentificateur 2FA, les notifications push et les textes sont générés et envoyés lorsque vous vous connectez, ce qui signifie que vous n'avez pas à vous soucier de stocker en toute sécurité un autre facteur.

source: Account recovery assistance:
fr: Aide à la récupération du compte:

source: 2FA means that you don’t have to put in a help desk ticket or try to get on the phone with a support team member to reset your logins or secure your account.
fr: 2FA signifie que vous n'avez pas à mettre un billet d'assistance ou à essayer de monter au téléphone avec un membre de l'équipe d'assistance pour réinitialiser vos connexions ou sécuriser votre compte.

source: LEARN about VPN
fr: Découvrez VPN

source: US Norton Blog - What is a VPN? And why you should use a VPN on public Wi-Fi
fr: US Norton Blog - Qu'est-ce qu'un VPN? Et pourquoi vous devriez utiliser un VPN sur le Wi-Fi public

source: US Norton Blog - How does a VPN work? + Tips to use one effectively
fr: US Norton Blog - Comment fonctionne un VPN? + Conseils pour en utiliser un efficacement

source: What is a VPN?
fr: Qu'est-ce qu'un VPN?

source: A virtual private network gives you online privacy and anonymity by creating a private network from a public Internet connection. VPNs mask your Internet protocol (IP) address so your online actions are virtually untraceable. Most important, VPN services establish secure and encrypted connections, guaranteed to provide greater privacy than even a secured Wi-Fi hotspot.
fr: Un réseau privé virtuel vous donne une confidentialité et un anonymat en ligne en créant un réseau privé à partir d'une connexion Internet publique. Les VPN masquent votre adresse de protocole Internet (IP) afin que vos actions en ligne soient pratiquement introuvables. Les services VPN plus importants établissent des connexions sécurisées et cryptées, garanties pour fournir une plus grande intimité que même un hotspot Wi-Fi sécurisé.

source: Why you need a VPN
fr: Pourquoi vous avez besoin d'un VPN

source: Think about all the times you’ve been on the go, reading emails while in line at the coffee shop, or checking your bank account while waiting at the doctor’s office. Unless you were logged into a private Wi-Fi network that required a password, any data transmitted during your online session was likely vulnerable to eavesdropping by strangers using the same network.
fr: Pensez à toutes les fois où vous avez été en déplacement, en lisant des e-mails en ligne au café ou en vérifiant votre compte bancaire en attendant au bureau du médecin. À moins que vous ne soyez connecté à un réseau Wi-Fi privé qui nécessitait un mot de passe, toutes les données transmises au cours de votre session en ligne étaient probablement vulnérables à l'écoute par des étrangers utilisant le même réseau.

source: The encryption and anonymity that a VPN provides protects all of your online activities: sending emails, shopping online, or paying bills. VPNs also help keep your Web browsing anonymous.
fr: Le chiffrement et l'anonymat qu'un VPN fournit protège toutes vos activités en ligne: envoyer des e-mails, faire des achats en ligne ou payer des factures. Les VPN aident également à garder votre navigation sur le Web anonyme.

source: How does a VPN work?
fr: Comment fonctionne un VPN?

source: A VPN (virtual private network) encrypts the traffic between your device and the internet. To do this, it creates a secure VPN tunnel for your internet traffic to pass through when your device connects to a network. That helps to hide your IP address and keep your online activity private.
fr: Un VPN (réseau privé virtuel) crypte le trafic entre votre appareil et Internet. Pour ce faire, il crée un tunnel VPN sécurisé pour que votre trafic Internet passe lorsque votre appareil se connecte à un réseau. Cela aide à masquer votre adresse IP et à garder votre activité en ligne privée.

source: With a VPN, you can browse without worrying that a cybercriminal or hacker is watching you, send messages safely, and access your favorite content from around the world.
fr: Avec un VPN, vous pouvez parcourir sans vous soucier qu'un cybercrimiral ou un pirate vous regarde, envoyer des messages en toute sécurité et accéder à votre contenu préféré du monde entier.

source: Here’s a step-by-step breakdown of how VPNs work.
fr: Voici une ventilation étape par étape du fonctionnement des VPN.

source: Turn on the VPN
fr: Activer le VPN

source: Turn on your VPN. Some VPNs, like Norton Secure VPN, allow you to choose the server location at this point, which can make you appear to be from other places when you visit websites.
fr: Allumez votre VPN. Certains VPN, comme Norton Secure VPN, vous permettent de choisir l'emplacement du serveur à ce stade, ce qui peut vous faire apparaître dans d'autres endroits lorsque vous visitez les sites Web.

source: The device and the VPN establish a connection
fr: L'appareil et le VPN établissent une connexion

source: Your device will connect securely to the VPN server. Once it connects, the VPN begins encrypting traffic flowing between your device and the internet.
fr: Votre appareil se connectera en toute sécurité au serveur VPN. Une fois qu'il se connecte, le VPN commence à chiffrer le trafic entre votre appareil et Internet.

source: Traffic is encrypted to securely surf the web
fr: Le trafic est crypté pour surfer en toute sécurité sur le Web

source: After you connect, all of your browsing becomes encrypted, meaning that no one else can see your online activity.
fr: Après votre connexion, toute votre navigation est cryptée, ce qui signifie que personne d'autre ne peut voir votre activité en ligne.

source: How Does a VPN Work
fr: Comment fonctionne un VPN

source: Advantages of using a VPN
fr: Avantages de l'utilisation d'un VPN

source: While it used to seem like VPNs were tools primarily for hackers and journalists, everyone can benefit from one. Privacy or security and accessing content are some of the greatest benefits of using a VPN.
fr: Bien qu'il semblait que les VPN étaient des outils principalement pour les pirates et les journalistes, tout le monde peut en bénéficier. La confidentialité ou la sécurité et l'accès au contenu sont quelques-uns des plus grands avantages de l'utilisation d'un VPN.

source: The advantages of a VPN include:
fr: Les avantages d'un VPN comprennent:

source: Masking your browsing history:
fr: Masquer votre histoire de navigation:

source: VPNs help you block snoopers, companies, and advertisers from following your browsing activity and profiling you.
fr: Les VPN vous aident à bloquer les snoopers, les entreprises et les annonceurs de suivre votre activité de navigation et de vous profilage.

source: Hiding your IP address and physical location:
fr: Cacheter votre adresse IP et votre emplacement physique:

source: Your internet browsing is your business. A VPN hides your IP address and physical location by directing the traffic from your devices to a network far away from you, making your browsing private and helping you access the content you want.
fr: Votre navigation sur Internet est votre entreprise. Un VPN masque votre adresse IP et votre emplacement physique en dirigeant le trafic de vos appareils vers un réseau loin de vous, en faisant votre navigation privée et en vous aidant à accéder au contenu que vous souhaitez.

source: Stopping cybercriminals from watching your activity:
fr: Empêcher les cybercriminels de surveiller votre activité:

source: If you’re using public Wi-Fi or an unsecured home network, cybercriminals could monitor your activity. They may be able to steal your login credentials from your mobile banking accounts and anything else you sign into online.
fr: Si vous utilisez un Wi-Fi public ou un réseau domestique non sécurisé, les cybercriminels pourraient surveiller votre activité. Ils peuvent être en mesure de voler vos informations d'identification de connexion à vos comptes bancaires mobiles et à tout ce que vous vous connectez en ligne.

source: Protecting sensitive information:
fr: Protéger les informations sensibles:

source: Even if you don’t realize it, you expose sensitive information every time you log onto a website through an unsecured network. A VPN keeps your sensitive information safe by masking your IP address and encrypting your traffic.
fr: Même si vous ne le réalisez pas, vous exposez des informations sensibles chaque fois que vous vous connectez à un site Web via un réseau non garanti. Un VPN protège vos informations sensibles en masquant votre adresse IP et en chiffrant votre trafic.

source: Sharing files securely:
fr: Partage des fichiers en toute sécurité:

source: Whether working from home or sending files to family members, a VPN lets you send and receive files without worrying about a hacker holding your files for ransom or inserting malware.
fr: Que ce soit à partir de la maison ou l'envoi de fichiers aux membres de la famille, un VPN vous permet d'envoyer et de recevoir des fichiers sans vous soucier d'un pirate qui ait vos fichiers pour rançon ou insérant des logiciels malveillants.

source: Making online payments safely:
fr: Effectuer des paiements en ligne en toute sécurité:

source: A VPN helps keep your shopping activity private, making it safer to buy online.
fr: Un VPN aide à garder votre activité d'achat privée, ce qui rend plus sûr d'acheter en ligne.

source: Advantages of VPN
fr: Avantages du VPN

source: What can I do with a VPN?
fr: Que puis-je faire avec un VPN?

source: VPNs have many practical applications. Here are some common reasons to use a VPN:
fr: Les VPN ont de nombreuses applications pratiques. Voici quelques raisons courantes d'utiliser un VPN:

source: Avoid location-based price discrimination:
fr: Évitez la discrimination des prix basée sur la localisation:

source: Many online retailers charge more in the United States than other countries. You can save money on goods, travel, and accommodation by setting your location to different countries.
fr: De nombreux détaillants en ligne facturent davantage aux États-Unis que dans d'autres pays. Vous pouvez économiser de l'argent sur les marchandises, les voyages et l'hébergement en fixant votre emplacement dans différents pays.

source: Avoid bandwidth throttling:
fr: Évitez la limitation de la bande passante:
